,{"_index":"test","_type":"document","_id":"55f3e5ac00576034f979fe4b","_score":0,"_source":{"_id":"55f3e5ac00576034f979fe4b","corpus":"Reference","external_id":"Tequila","source_type":"wikipedia","title":"Tequila","words":"Tequila (Spanish [teˈkila] ) is a regional specific name for a distilled beverage made from the blue agave plant, primarily in the area surrounding the city of Tequila, 65 km (40 mi) northwest of Guadalajara, and in the highlands (Los Altos) of the north western Mexican state of Jalisco. Although tequila is a kind of mezcal, modern tequila differs somewhat in the method of its production, in the use of only blue agave plants, as well as in its regional specificity. The red volcanic soil in the surrounding region is particularly well suited to the growing of the blue agave, and more than 300 million of the plants are harvested there each year. Agave tequila grows differently depending on the region. Blue agaves grown in the highlands Los Altos region are larger in size and sweeter in aroma and taste. Agaves harvested in the lowlands, on the other hand, have a more herbaceous fragrance and flavor. Mexican laws state that tequila can only be produced in the state of Jalisco and limited municipalities in the states of Guanajuato, Michoacán, Nayarit, and Tamaulipas. Tequila is recognized as a Mexican designation of origin product in more than 40 countries. It is protected through NAFTA in Canada and the United States, through bilateral agreements with individual countries such as Japan and Israel, and has been a protected designation of origin product in the constituent countries of the European Union since 1997. Tequila is most often made at a 38–40% alcohol content (76–80 U.S. proof), but can be produced between 31 and 55% alcohol content (62 and 110 U.S. proof). History Early history Tequila was first produced in the 16th century near the location of the city of Tequila, which was not officially established until 1666. The Aztec people had previously made a fermented beverage from the agave plant, long before the Spanish arrived in 1521. When the Spanish conquistadors ran out of their own brandy, they began to distill agave to produce one of North America's first indigenous distilled spirits. Some 80 years later, around 1600, Don Pedro Sánchez de Tagle, the Marquis of Altamira, began mass-producing tequila at the first factory in the territory of modern-day Jalisco. By 1608, the colonial governor of Nueva Galicia had begun to tax his products. Spain's King Carlos IV granted the Cuervo family the first license to commercially make tequila. Don Cenobio Sauza, founder of Sauza Tequila and Municipal President of the Village of Tequila from 1884–1885, was the first to export tequila to the United States, and shortened the name from \"Tequila Extract\" to just \"Tequila\" for the American markets. Don Cenobio's grandson Don Francisco Javier gained international attention for insisting that \"there cannot be tequila where there are no agaves!\" His efforts led to the practice that real tequila can come only from the State of Jalisco. Recent history Since the late 1990s, some significant market developments have included: The purchase of Herradura by Brown-Forman for $776 million in September 2006. A new Norma Oficial Mexicana (NOM) for tequila (NOM-006-SCFI-2005) was issued in 2006, and among other changes, introduced a category of tequila called extra añejo or \"ultra-aged\" which must be aged a minimum of three years. The purchase of the Sauza and El Tesoro brands by the holding company Fortune Brands (now Beam Suntory) Although some tequilas have remained as family-owned brands, most well-known tequila brands are owned by large multinational corporations. However, over 100 distilleries make over 900 brands of tequila in Mexico and over 2,000 brand names have been registered (2009 statistics). Due to this, each bottle of tequila contains a serial number (NOM) depicting in which distillery the tequila was produced. Because only so many distilleries are used, multiple brands of tequila come from the same location. The Tequila Regulatory Council of Mexico originally did not permit flavored tequila to carry the tequila name. In 2004, the Council decided to allow flavored tequila to be called tequila, with the exception of 100% agave tequila, which still cannot be flavored. A one-liter bottle of limited-edition premium tequila was sold for $225,000 in July 2006 in Tequila, Jalisco, by the company Tequila Ley .925. The bottle which contained the tequila was a two-kilo display of platinum and gold. The manufacturer received a certificate from The Guinness World Records for the most expensive bottle of spirit ever sold. In 2003, Mexico issued a proposal that would require all Mexican-made tequila be bottled in Mexico before being exported to other countries. The Mexican government said that bottling tequila in Mexico would guarantee its quality. Liquor companies in the United States said Mexico just wanted to create bottling jobs in their own country, and also claimed this rule would violate international trade agreements and was in discord with usual exporting practices worldwide. The proposal might have resulted in the loss of jobs at plants in California, Arkansas, Missouri, and Kentucky, because Mexican tequila exported in bulk to the United States is bottled in those plants. On January 17, 2006, the United States and Mexico signed an agreement allowing the continued bulk import of tequila into the United States. The agreement also created a \"tequila bottlers registry\" to identify approved bottlers of tequila and created an agency to monitor the registry. In June 2013, the ban on importation of premium (100% blue agave) tequila into China was lifted following a state visit to Mexico by President Xi Jinping. The entry of premium tequila into the country is expected to increase tequila exports by 20 percent within a decade (exports totaled 170 million litres in 2013). Ramon Gonzalez, director of the Consejo Regulador del Tequila, estimates that each of the top 16 producers of tequila had invested up to $3 million to enter the Chinese market. On 30 August 2013, the first 70,380 bottles of premium tequila from ten brands arrived in Shanghai. The arrival happened during an event held at the House of Roosevelt, a well-known club located on The Bund– an area with a long tradition of importing alcoholic beverages in China. Production Planting, tending, and harvesting the agave plant remains a manual effort, largely unchanged by modern farm machinery and relying on centuries-old know-how. The men who harvest it, the jimadores [ximaˈðoɾes], have intimate knowledge of how the plants should be cultivated, passed down from generation to generation. By regularly trimming any quiotes [ˈkjotes] (a several-meter high stalk that grows from the center of the plant), the jimadores prevent the agave from flowering and dying early, allowing it to fully ripen. The jimadores must be able to tell when each plant is ready to be harvested, and using a special knife called a coa (with a circular blade on a long pole), carefully cut away the leaves from the piña (the succulent core of the plant). If harvested too late or too early, the piñas, which can average around 70 kg (150 lb) in the lowlands to 110 kg (240 lb) in the highlands, will not have the right amount of carbohydrates for fermentation. After harvesting, the piñas [ˈpiɲas] are transported to ovens where they are slowly baked to break down their complex fructans into simple fructoses. Then, the baked piñas are either shredded or mashed under a large stone wheel called a tahona [taˈona]. The pulp fiber, or bagazo [βaˈɣaso], left behind is often reused as compost or animal feed, but can even be burnt as fuel or processed into paper. Some producers like to add a small amount of bagazo back into their fermentation tanks for a stronger agave flavor in the final product. The extracted agave juice is then poured into either large wooden or stainless steel vats for several days to ferment, resulting in a wort, or mosto [ˈmosto], with low alcohol content. This wort is then distilled once to produce what is called \"ordinario [oɾðiˈnaɾio], and then a second time to produce clear \"silver\" tequila. A few producers distill the product a third time, but several connoisseursconsider this third distillation a mistake because it removes too much flavor from the tequila. From there, the tequila is either bottled as silver tequila, or it is pumped into wooden barrels to age, where it develops a mellower flavor and amber color. Usually, the differences in taste between tequila made from lowland and highland agave plants is noticeable. Plants grown in the highlands often yield sweeter and fruitier-tasting tequila, while lowland agaves give the tequila an earthier flavor. Aging process Reposado may be rested in oak barrels or casks as large as 20,000 litres (5,280 gallons), allowing for richer and more complex flavors. The preferred oak comes from the US, France, or Canada, and is usually white oak. Some companies char the wood to impart a smoky flavor, or use barrels previously used with different kinds of alcohol (e.g. whiskey or wine). Some reposados can also be aged in new wood barrels to achieve the same woody flavor and smoothness, but in less time. Añejos are often rested in barrels previously used to rest reposados. The barrels cannot be more than 600 liters (158 gallons), and most are in the 200-liter (52-gallon) range. Many of the barrels used are from whiskey distilleries in the US or Canada, and Jack Daniels barrels are especially popular. This treatment creates many of the aspects of the dark color and more complex flavors of the añejo tequila. After aging of at least one year, the añejo can be removed from the wood barrels and placed in stainless steel tanks to reduce the amount of evaporation that can occur in the barrels. Threats to quality According to an interview with local growers, climate change may be degrading the quality of agave in tequla's traditional growing areas. \"The summer gets hotter and hotter every year. Traditionally for the blue agave, it took eight to 10 years to grow and mature. And now we are looking at the agaves maturing 5, 6, 7-years-old. Less sugar content because the plant is forced to grow and mature faster. And everybody's talking about it - Calentamiento global - global warming.\" TMA (tristeza y muerte de agave) is a blight has reduced the production of the agave grown to produce tequila. This has resulted in lower production and higher prices throughout the early 21st century, and due to the long maturation of the plant, will likely continue to affect prices for years to come. \"Tequila worm\" misconception It is a common misconception that some tequilas contain a 'worm' in the bottle. Only certain mezcals, usually from the state of Oaxaca, are ever sold con gusano (with worm), and that only began as a marketing gimmick in the 1940s. The worm is actually the larval form of the moth Hypopta agavis, which lives on the agave plant. Finding one in the plant during processing indicates an infestation and, correspondingly, a lower-quality product. However, this misconception continues, despite effort and marketing to represent tequila as a premium liquor—similar to the way Cognac is viewed in relation to other brandies. Norma Oficial Mexicana The Norma Oficial Mexicana (NOM) applies to all processes and activities related to the supply of agave, production, bottling, marketing, information, and business practices linked to the distilled alcoholic beverage known as tequila. Tequila must be produced using agave of the species Tequilana Weber Blue variety, grown in the federal states and municipalities indicated in the Declaration. Furthermore, the NOM establishes the technical specifications and legal requirements for the protection of the Appellation of Origin of \"Tequila\" in accordance with the current General Declaration of Protection of the Appellation of Origin of \"Tequila\", the Law, the Industrial Property Law, the Federal Consumer Protection Law and other related legal provisions. All authentic, regulated tequilas will have a NOM identifier on the bottle. The important laws since 1990 were NOM-006-SCFI-1993, the later update NOM-006-SCFI-1994, and the most recent revision in late 2005, NOM-006-SCFI-2005. The number after NOM is the distillery number, assigned by the government. NOM does not indicate the location of the distillery, merely the parent company or, in the case where a company leases space in a plant, the physical plant where the tequila was manufactured. Types The two basic categories of tequila are mixtos and 100% agave. Mixtos use no less than 51% agave, with other sugars making up the remainder. Mixtos use both glucose and fructose sugars. Tequila is usually bottled in one of five categories: Blanco [ˈblaŋko] (\"white\") or plata [ˈplata] (\"silver\"): white spirit, unaged and bottled or stored immediately after distillation, or aged less than two months in stainless steel or neutral oak barrels Joven [ˈxoβen] (\"young\") or oro [ˈoɾo] (\"gold\"): unaged silver tequila that may be flavored with caramel coloring, oak extract, glycerin, or sugar-based syrup. Could also be the result of blending silver tequila with aged and/or extra-aged tequila. Reposado [repoˈsaðo] (\"rested\"): aged a minimum of two months, but less than a year in oak barrels of any size Añejo [aˈɲexo] (\"aged\" or \"vintage\"): aged a minimum of one year, but less than three years in small oak barrels Extra Añejo (\"extra aged\" or \"ultra aged\"): aged a minimum of three years in oak barrels, this category was established in March 2006. With 100% agave tequila, blanco or plata is harsher with the bold flavors of the distilled agave up front, while reposado and añejo are smoother, subtler, and more complex. As with other spirits aged in casks, tequila takes on the flavors of the wood, while the harshness of the alcohol mellows. The major flavor distinction with 100% agave tequila is the base ingredient, which is more vegetal than grain spirits (and often more complex). Brands The Consejo Regulador del Tequila (Tequila Regulatory Council) reported 1377 registered brands from 150 producers for the year 2013. Serving In Mexico, the most traditional way to drink tequila is neat, without lime and salt. It is popular in some regions to drink fine tequila with a side of sangrita—a sweet, sour, and spicy drink typically made from orange juice, grenadine (or tomato juice), and hot chiles. Equal-sized shots of tequila and sangrita are sipped alternately, without salt or lime. Another popular drink in Mexico is the bandera (flag, in Spanish), named after the Flag of Mexico, it consists of three shot glasses, filled with lime juice (for the green), white tequila, and sangrita (for the red). Outside Mexico, a single shot of tequila is often served with salt and a slice of lime. This is called tequila cruda and is sometimes referred to as \"training wheels\", \"lick-sip-suck\", or \"lick-shoot-suck\" (referring to the way in which the combination of ingredients is imbibed). The drinkers moisten the back of their hands below the index finger (usually by licking) and pour on the salt. Then the salt is licked off the hand, the tequila is drunk, and the fruit slice is quickly bitten. Groups of drinkers often do this simultaneously. Drinking tequila in this way is often erroneously called a Tequila Slammer, which is in fact a mix of tequila and carbonated drink. Though the traditional Mexican shot is tequila by itself, lime is the fruit of choice when a chaser must be used. The salt is believed to lessen the \"burn\" of the tequila and the sour fruit balances and enhances the flavor. In Germany and some other countries, tequila oro (gold) is often consumed with cinnamon on a slice of orange after, while tequila blanco (white) is consumed with salt and lime. Finally, as with other popular liquors, a number of shot-related drinking games and \"stunt\" drinks are used, such as body shots. If the bottle of tequila does not state on the label that it is manufactured from 100% blue agave (no sugars added), then, by default, that tequila is a mixto (manufactured from 51% blue agave). Some tequila distilleries label their tequila as \"made with blue agave\" or \"made from blue agave.\" However, the Tequila Regulatory Council has stated only tequilas distilled with 100% agave can be designated as \"100% agave\". Some distillers of lower-quality tequila have marketed their product to be served \"ice-cold chilled\" when used as a shot. Chilling any alcohol can be used to reduce the smell or flavors associated with a lower-quality product. Any alcoholic product, when served as a chilled shot, may be more palatable to the consumer. Many of the higher-quality, 100% agave tequilas do not impart significant alcohol burn, and drinking them with salt and lime is likely to remove much of the flavor. These tequilas are usually sipped from a snifter glass rather than a shot glass, and savoured instead of quickly gulped. Doing so allows the taster to detect subtler fragrances and flavors that would otherwise be missed. Tequila glasses When served neat (without any additional ingredients), tequila is most often served in a narrow shot glass called a caballito (little horse, in Spanish), but can often be found in anything from a snifter to a tumbler. The Consejo Regulador del Tequila approved an \"official tequila glass\" in 2002 called the Ouverture Tequila glass, made by Riedel. The margarita glass, frequently rimmed with salt or sugar, is a staple for the entire genre of tequila-based mixed drinks, including the margarita. Cocktails A variety of cocktails are made with tequila, including the margarita, a cocktail that helped make tequila popular in the United States. The traditional margarita uses tequila, Cointreau, and lime juice, though many variations exist. A popular cocktail in Mexico is the Paloma. Also, a number of martini variants involve tequila, and a large number of tequila drinks are made by adding fruit juice. These include the Tequila Sunrise and the Matador. Sodas and other carbonated drinks are a common mixer, as in the Tequila Slammer. Other uses In 2008, Mexican scientists discovered a method to produce tiny, nanometer-sized synthetic diamonds from 80-proof (40% alcohol) tequila, which has the optimal range of water to ethanol for producing synthetic diamonds. This process involves heating the tequila to over 800 °C (1,400 °F) to break its molecular structure and be vaporized into gaseous hydrogen, carbon, and various simple molecules. The carbon molecules are then settled upon steel or silicon trays to form a thin and pure uniform layer. Extremely cheap to produce and far too small for jewels, the results are hoped to have numerous commercial and industrial applications such as in computer chips or cutting instruments. See also Beer in Mexico Mexican cuisine Mexican wine Mezcal Pulque References External links National Chamber for the Tequila Industry Tequila Product List, News, NOM Database Consejo Regulador del Tequila A.C. Tequila Database List of Tequila Brands","top_words":[{"w":"tequila","c":114},{"w":"agave","c":32},{"w":"barrels","c":14},{"w":"aged","c":13},{"w":"plant","c":12},{"w":"nom","c":12},{"w":"blue","c":11},{"w":"mexican","c":10},{"w":"flavor","c":10},{"w":"brands","c":10},{"w":"salt","c":9},{"w":"alcohol","c":8},{"w":"oak","c":8},{"w":"lime","c":8},{"w":"shot","c":8},{"w":"plants","c":7},{"w":"bottle","c":7},{"w":"quality","c":7},{"w":"distilled","c":6},{"w":"ejo","c":6},{"w":"tequilas","c":6},{"w":"juice","c":6},{"w":"flavors","c":6},{"w":"popular","c":6},{"w":"glass","c":6},{"w":"spanish","c":5},{"w":"jalisco","c":5},{"w":"agaves","c":5},{"w":"countries","c":5},{"w":"large","c":5},{"w":"premium","c":5},{"w":"bottled","c":5},{"w":"complex","c":5},{"w":"silver","c":5},{"w":"white","c":5},{"w":"drink","c":5},{"w":"served","c":5},{"w":"highlands","c":4},{"w":"harvested","c":4},{"w":"grown","c":4},{"w":"origin","c":4},{"w":"content","c":4},{"w":"don","c":4},{"w":"scfi","c":4},{"w":"extra","c":4},{"w":"minimum","c":4},{"w":"three","c":4},{"w":"company","c":4},{"w":"distilleries","c":4},{"w":"council","c":4},{"w":"flavored","c":4},{"w":"consejo","c":4},{"w":"regulador","c":4},{"w":"del","c":4},{"w":"producers","c":4},{"w":"steel","c":4},{"w":"wood","c":4},{"w":"traditional","c":4},{"w":"lower","c":4},{"w":"worm","c":4},{"w":"fruit","c":4},{"w":"drinks","c":4},{"w":"margarita","c":4},{"w":"beverage","c":3},{"w":"modern","c":3},{"w":"region","c":3},{"w":"canada","c":3},{"w":"proof","c":3},{"w":"history","c":3},{"w":"location","c":3},{"w":"began","c":3},{"w":"spirits","c":3},{"w":"sauza","c":3},{"w":"norma","c":3},{"w":"oficial","c":3},{"w":"mexicana","c":3},{"w":"distillery","c":3},{"w":"sold","c":3},{"w":"gold","c":3},{"w":"bottling","c":3},{"w":"allowing","c":3},{"w":"alcoholic","c":3},{"w":"jimadores","c":3},{"w":"stainless","c":3},{"w":"reposado","c":3},{"w":"rested","c":3},{"w":"sugar","c":3},{"w":"misconception","c":3},{"w":"marketing","c":3},{"w":"protection","c":3},{"w":"law","c":3},{"w":"manufactured","c":3},{"w":"mixtos","c":3},{"w":"sugars","c":3},{"w":"blanco","c":3},{"w":"plata","c":3},{"w":"sangrita","c":3},{"w":"slice","c":3},{"w":"drinking","c":3},{"w":"regional","c":2},{"w":"surrounding","c":2},{"w":"altos","c":2},{"w":"north","c":2},{"w":"mezcal","c":2},{"w":"red","c":2},{"w":"growing","c":2},{"w":"grows","c":2},{"w":"sweeter","c":2},{"w":"taste","c":2},{"w":"lowlands","c":2},{"w":"hand","c":2},{"w":"laws","c":2},{"w":"municipalities","c":2},{"w":"designation","c":2},{"w":"protected","c":2},{"w":"agreements","c":2},{"w":"century","c":2},{"w":"arrived","c":2},{"w":"distill","c":2},{"w":"cenobio","c":2},{"w":"extract","c":2},{"w":"market","c":2},{"w":"purchase","c":2},{"w":"issued","c":2},{"w":"category","c":2},{"w":"ultra","c":2},{"w":"owned","c":2},{"w":"registered","c":2},{"w":"liter","c":2},{"w":"spirit","c":2},{"w":"proposal","c":2},{"w":"exported","c":2},{"w":"liquor","c":2},{"w":"companies","c":2},{"w":"jobs","c":2},{"w":"practices","c":2},{"w":"bulk","c":2},{"w":"agreement","c":2},{"w":"created","c":2},{"w":"bottlers","c":2},{"w":"registry","c":2},{"w":"china","c":2},{"w":"exports","c":2},{"w":"litres","c":2},{"w":"harvesting","c":2},{"w":"effort","c":2},{"w":"generation","c":2},{"w":"fermentation","c":2},{"w":"baked","c":2},{"w":"break","c":2},{"w":"bagazo","c":2},{"w":"tanks","c":2},{"w":"wooden","c":2},{"w":"wort","c":2},{"w":"mosto","c":2},{"w":"third","c":2},{"w":"distillation","c":2},{"w":"color","c":2},{"w":"lowland","c":2},{"w":"aging","c":2},{"w":"casks","c":2},{"w":"gallons","c":2},{"w":"impart","c":2},{"w":"whiskey","c":2},{"w":"wine","c":2},{"w":"reposados","c":2},{"w":"hotter","c":2},{"w":"grow","c":2},{"w":"mature","c":2},{"w":"global","c":2},{"w":"higher","c":2},{"w":"prices","c":2},{"w":"federal","c":2},{"w":"declaration","c":2},{"w":"legal","c":2},{"w":"appellation","c":2},{"w":"industrial","c":2},{"w":"consumer","c":2},{"w":"categories","c":2},{"w":"unaged","c":2},{"w":"months","c":2},{"w":"oro","c":2},{"w":"subtler","c":2},{"w":"neat","c":2},{"w":"sour","c":2},{"w":"orange","c":2},{"w":"sized","c":2},{"w":"shots","c":2},{"w":"sipped","c":2},{"w":"flag","c":2},{"w":"glasses","c":2},{"w":"lick","c":2},{"w":"suck","c":2},{"w":"ingredients","c":2},{"w":"drinkers","c":2},{"w":"slammer","c":2},{"w":"carbonated","c":2},{"w":"burn","c":2},{"w":"consumed","c":2},{"w":"label","c":2},{"w":"chilled","c":2},{"w":"snifter","c":2},{"w":"cocktails","c":2},{"w":"cocktail","c":2},{"w":"synthetic","c":2},{"w":"diamonds","c":2},{"w":"carbon","c":2},{"w":"database","c":2},{"w":"kila","c":1},{"w":"specific","c":1},{"w":"northwest","c":1},{"w":"guadalajara","c":1},{"w":"kind","c":1},{"w":"differs","c":1},{"w":"specificity","c":1},{"w":"volcanic","c":1},{"w":"soil","c":1},{"w":"suited","c":1},{"w":"differently","c":1},{"w":"larger","c":1},{"w":"aroma","c":1},{"w":"herbaceous","c":1},{"w":"fragrance","c":1},{"w":"guanajuato","c":1},{"w":"michoac","c":1},{"w":"nayarit","c":1},{"w":"tamaulipas","c":1},{"w":"recognized","c":1},{"w":"nafta","c":1},{"w":"bilateral","c":1},{"w":"japan","c":1},{"w":"israel","c":1},{"w":"constituent","c":1},{"w":"european","c":1},{"w":"union","c":1},{"w":"officially","c":1},{"w":"aztec","c":1},{"w":"fermented","c":1},{"w":"conquistadors","c":1},{"w":"brandy","c":1},{"w":"america","c":1},{"w":"indigenous","c":1},{"w":"pedro","c":1},{"w":"nchez","c":1},{"w":"tagle","c":1},{"w":"marquis","c":1},{"w":"altamira","c":1},{"w":"factory","c":1},{"w":"territory","c":1},{"w":"colonial","c":1},{"w":"governor","c":1},{"w":"nueva","c":1},{"w":"galicia","c":1},{"w":"begun","c":1},{"w":"tax","c":1},{"w":"products","c":1},{"w":"spain","c":1},{"w":"king","c":1},{"w":"carlos","c":1},{"w":"granted","c":1},{"w":"cuervo","c":1},{"w":"license","c":1},{"w":"commercially","c":1},{"w":"founder","c":1},{"w":"municipal","c":1},{"w":"village","c":1},{"w":"export","c":1},{"w":"shortened","c":1},{"w":"markets","c":1},{"w":"grandson","c":1},{"w":"francisco","c":1},{"w":"javier","c":1},{"w":"gained","c":1},{"w":"attention","c":1},{"w":"insisting","c":1},{"w":"efforts","c":1},{"w":"practice","c":1},{"w":"developments","c":1},{"w":"herradura","c":1},{"w":"brown","c":1},{"w":"forman","c":1},{"w":"tesoro","c":1},{"w":"holding","c":1},{"w":"fortune","c":1},{"w":"beam","c":1},{"w":"suntory","c":1},{"w":"remained","c":1},{"w":"multinational","c":1},{"w":"corporations","c":1},{"w":"brand","c":1},{"w":"names","c":1},{"w":"statistics","c":1},{"w":"serial","c":1},{"w":"depicting","c":1},{"w":"originally","c":1},{"w":"permit","c":1},{"w":"carry","c":1},{"w":"decided","c":1},{"w":"exception","c":1},{"w":"edition","c":1},{"w":"ley","c":1},{"w":"contained","c":1},{"w":"kilo","c":1},{"w":"display","c":1},{"w":"platinum","c":1},{"w":"manufacturer","c":1},{"w":"certificate","c":1},{"w":"guinness","c":1},{"w":"records","c":1},{"w":"expensive","c":1},{"w":"guarantee","c":1},{"w":"wanted","c":1},{"w":"rule","c":1},{"w":"violate","c":1},{"w":"trade","c":1},{"w":"discord","c":1},{"w":"usual","c":1},{"w":"exporting","c":1},{"w":"worldwide","c":1},{"w":"loss","c":1},{"w":"arkansas","c":1},{"w":"missouri","c":1},{"w":"kentucky","c":1},{"w":"signed","c":1},{"w":"continued","c":1},{"w":"import","c":1},{"w":"identify","c":1},{"w":"agency","c":1},{"w":"monitor","c":1},{"w":"ban","c":1},{"w":"importation","c":1},{"w":"lifted","c":1},{"w":"visit","c":1},{"w":"jinping","c":1},{"w":"entry","c":1},{"w":"expected","c":1},{"w":"decade","c":1},{"w":"totaled","c":1},{"w":"ramon","c":1},{"w":"gonzalez","c":1},{"w":"estimates","c":1},{"w":"invested","c":1},{"w":"chinese","c":1},{"w":"bottles","c":1},{"w":"ten","c":1},{"w":"arrival","c":1},{"w":"happened","c":1},{"w":"event","c":1},{"w":"roosevelt","c":1},{"w":"club","c":1},{"w":"located","c":1},{"w":"bund","c":1},{"w":"tradition","c":1},{"w":"importing","c":1},{"w":"beverages","c":1},{"w":"planting","c":1},{"w":"tending","c":1},{"w":"manual","c":1},{"w":"unchanged","c":1},{"w":"farm","c":1},{"w":"machinery","c":1},{"w":"relying","c":1},{"w":"centuries","c":1},{"w":"harvest","c":1},{"w":"xima","c":1},{"w":"intimate","c":1},{"w":"knowledge","c":1},{"w":"cultivated","c":1},{"w":"passed","c":1},{"w":"regularly","c":1},{"w":"trimming","c":1},{"w":"quiotes","c":1},{"w":"kjotes","c":1},{"w":"meter","c":1},{"w":"stalk","c":1},{"w":"flowering","c":1},{"w":"dying","c":1},{"w":"fully","c":1},{"w":"ripen","c":1},{"w":"ready","c":1},{"w":"special","c":1},{"w":"knife","c":1},{"w":"coa","c":1},{"w":"circular","c":1},{"w":"blade","c":1},{"w":"pole","c":1},{"w":"carefully","c":1},{"w":"cut","c":1},{"w":"leaves","c":1},{"w":"succulent","c":1},{"w":"core","c":1},{"w":"average","c":1},{"w":"carbohydrates","c":1},{"w":"transported","c":1},{"w":"ovens","c":1},{"w":"slowly","c":1},{"w":"fructans","c":1},{"w":"fructoses","c":1},{"w":"shredded","c":1},{"w":"mashed","c":1}],"meta":{"abstract":"Tequila (Spanish [teˈkila] ) is a regional specific name for a distilled beverage made from the blue agave plant, primarily in the area surrounding the city of Tequila, 65 km (40 mi) northwest of Guadalajara, and in the highlands (Los Altos) of the north western Mexican state of Jalisco. Although tequila is a kind of mezcal, modern tequila differs somewhat in the method of its production, in the use of only blue agave plants, as well as in its regional specificity. The red volcanic soil in the surrounding region is particularly well suited to the growing of the blue agave, and more than 300 million of the plants are harvested there each year. Agave tequila grows differently depending on the region. Blue agaves grown in the highlands Los Altos region are larger in size and sweeter in aroma and taste. Agaves harvested in the lowlands, on the other hand, have a more herbaceous fragrance and flavor. Mexican laws state that tequila can only be produced in the state of Jalisco and limited municipalities in the states of Guanajuato, Michoacán, Nayarit, and Tamaulipas. Tequila is recognized as a Mexican designation of origin product in more than 40 countries. It is protected through NAFTA in Canada and the United States, through bilateral agreements with individual countries such as Japan and Israel, and has been a protected designation of origin product in the constituent countries of the European Union since 1997. Tequila is most often made at a 38–40% alcohol content (76–80 U.S. proof), but can be produced between 31 and 55% alcohol content (62 and 110 U.S. proof). History Early history Tequila was first produced in the 16th century near the location of the city of Tequila, which was not officially established until 1666. The Aztec people had previously made a fermented beverage from the agave plant, long before the Spanish arrived in 1521. When the Spanish conquistadors ran out of their own brandy, they began to distill agave to produce one of North America's first indigenous distilled spirits. Some 80 years later, around 1600, Don Pedro Sánchez de Tagle, the Marquis of Altamira, began mass-producing tequila at the first factory in the territory of modern-day Jalisco. By 1608, the colonial governor of Nueva Galicia had begun to tax his products. Spain's King Carlos IV granted the Cuervo family the first license to commercially make tequila. Don Cenobio Sauza, founder of Sauza Tequila and Municipal President of the Village of Tequila from 1884–1885, was the first to export tequila to the United States, and shortened the name from \"Tequila Extract\" to just \"Tequila\" for the American markets. Don Cenobio's grandson Don Francisco Javier gained international attention for insisting that \"there cannot be tequila where there are no agaves!\" His efforts led to the practice that real tequila can come only from the State of Jalisco. Recent history Since the late 1990s, some significant market developments have included: The purchase of Herradura by Brown-Forman for $776 million in September 2006. A new Norma","date":"2015-04-11T02:32:22Z","url":"http://en.wikipedia.org/wiki/Tequila"}}}
,{"_index":"test","_type":"document","_id":"55f3e5ac00576034f979fe50","_score":0,"_source":{"_id":"55f3e5ac00576034f979fe50","corpus":"Reference","external_id":"Irwin–Hall_distribution","source_type":"wikipedia","title":"Irwin–Hall Distribution","words":"In probability and statistics, the Irwin–Hall distribution, named after Joseph Oscar Irwin and Philip Hall, is a probability distribution for a random variable defined as sum of a number of independent random variables, each having a uniform distribution. For this reason it is also known as the uniform sum distribution. The generation of pseudo-random numbers having an approximately normal distribution is sometimes accomplished by computing the sum of a number of pseudo-random numbers having a uniform distribution; usually for the sake of simplicity of programming. Rescaling the Irwin–Hall distribution provides the exact distribution of the random variates being generated. This distribution is sometimes confused with the Bates distribution, which is the mean (not sum) of n independent random variables uniformly distributed from 0 to 1. Definition The Irwin–Hall distribution is the continuous probability distribution for the sum of n independent and identically distributed U(0, 1) random variables: The probability density function (pdf) is given by where sgn(x − k) denotes the sign function: Thus the pdf is a spline (piecewise polynomial function) of degree n − 1 over the knots 0, 1, ..., n. In fact, for x between the knots located at k and k + 1, the pdf is equal to where the coefficients aj(k,n) may be found from a recurrence relation over k The coefficients are also A188816 in OEIS. The coefficients for the cumulative distribution is A188668. The mean and variance are n/2 and n/12, respectively. Special cases For n = 1, X follows a uniform distribution: For n = 2, X follows a triangular distribution: For n = 3, For n = 4, For n = 5, Notes References Hall, Philip. (1927) \"The Distribution of Means for Samples of Size N Drawn from a Population in which the Variate Takes Values Between 0 and 1, All Such Values Being Equally Probable\". Biometrika, Vol. 19, No. 3/4., pp. 240–245. Irwin, J.O. (1927) \"On the Frequency Distribution of the Means of Samples from a Population Having any Law of Frequency with Finite Moments, with Special Reference to Pearson's Type II\". Biometrika, Vol. 19, No. 3/4., pp. 225–239.","top_words":[{"w":"random","c":7},{"w":"irwin","c":5},{"w":"hall","c":5},{"w":"sum","c":5},{"w":"probability","c":4},{"w":"uniform","c":4},{"w":"independent","c":3},{"w":"variables","c":3},{"w":"pdf","c":3},{"w":"coefficients","c":3},{"w":"philip","c":2},{"w":"pseudo","c":2},{"w":"numbers","c":2},{"w":"distributed","c":2},{"w":"knots","c":2},{"w":"special","c":2},{"w":"biometrika","c":2},{"w":"frequency","c":2},{"w":"statistics","c":1},{"w":"named","c":1},{"w":"joseph","c":1},{"w":"oscar","c":1},{"w":"variable","c":1},{"w":"reason","c":1},{"w":"generation","c":1},{"w":"accomplished","c":1},{"w":"computing","c":1},{"w":"sake","c":1},{"w":"simplicity","c":1},{"w":"programming","c":1},{"w":"rescaling","c":1},{"w":"exact","c":1},{"w":"variates","c":1},{"w":"confused","c":1},{"w":"bates","c":1},{"w":"uniformly","c":1},{"w":"definition","c":1},{"w":"identically","c":1},{"w":"density","c":1},{"w":"sgn","c":1},{"w":"denotes","c":1},{"w":"sign","c":1},{"w":"spline","c":1},{"w":"piecewise","c":1},{"w":"polynomial","c":1},{"w":"located","c":1},{"w":"equal","c":1},{"w":"recurrence","c":1},{"w":"relation","c":1},{"w":"oeis","c":1},{"w":"cumulative","c":1},{"w":"variance","c":1},{"w":"triangular","c":1},{"w":"notes","c":1},{"w":"references","c":1},{"w":"drawn","c":1},{"w":"variate","c":1},{"w":"takes","c":1},{"w":"equally","c":1},{"w":"probable","c":1},{"w":"law","c":1},{"w":"finite","c":1},{"w":"moments","c":1},{"w":"pearson","c":1}],"meta":{"abstract":"In probability and statistics, the Irwin–Hall distribution, named after Joseph Oscar Irwin and Philip Hall, is a probability distribution for a random variable defined as sum of a number of independent random variables, each having a uniform distribution. For this reason it is also known as the uniform sum distribution. The generation of pseudo-random numbers having an approximately normal distribution is sometimes accomplished by computing the sum of a number of pseudo-random numbers having a uniform distribution; usually for the sake of simplicity of programming. Rescaling the Irwin–Hall distribution provides the exact distribution of the random variates being generated. This distribution is sometimes confused with the Bates distribution, which is the mean (not sum) of n independent random variables uniformly distributed from 0 to 1. Definition The Irwin–Hall distribution is the continuous probability distribution for the sum of n independent and identically distributed U(0, 1) random variables: The probability density function (pdf) is given by where sgn(x − k) denotes the sign function: Thus the pdf is a spline (piecewise polynomial function) of degree n − 1 over the knots 0, 1, ..., n. In fact, for x between the knots located at k and k + 1, the pdf is equal to where the coefficients aj(k,n) may be found from a recurrence relation over k The coefficients are also A188816 in OEIS. The coefficients for the cumulative distribution is A188668. The mean and variance are n/2 and n/12, respectively. Special cases For n = 1, X follows a uniform distribution: For n = 2, X follows a triangular distribution: For n = 3, For n = 4, For n = 5, Notes References Hall, Philip. (1927) \"The Distribution of Means for Samples of Size N Drawn from a Population in which the Variate Takes Values Between 0 and 1, All Such Values Being Equally Probable\". Biometrika, Vol. 19, No. 3/4., pp. 240–245. Irwin, J.O. (1927) \"On the Frequency Distribution of the Means of Samples from a Population Having any Law of Frequency with Finite Moments, with Special Reference to Pearson's Type II\". Biometrika, Vol. 19, No. 3/4., pp. 225–239.","date":"2015-04-16T20:56:58Z","url":"http://en.wikipedia.org/wiki/Irwin%E2%80%93Hall%20distribution"}}}
,{"_index":"test","_type":"document","_id":"55f3e5ac00576034f979fe4f","_score":0,"_source":{"_id":"55f3e5ac00576034f979fe4f","corpus":"Reference","external_id":"Impredicativity","source_type":"wikipedia","title":"Impredicativity","words":"In mathematics and logic, a self-referencing definition is called impredicative. More precisely, a definition is said to be impredicative if it invokes (mentions or quantifies over) the set being defined, or (more commonly) another set which contains the thing being defined. The opposite of impredicativity is predicativity, which essentially entails building stratified (or ramified) theories where quantification over lower levels results in variables of some new type, distinguished from the lower types that the variable ranges over. A prototypical example is intuitionistic type theory, which retains ramification but discards impredicativity. Russell's paradox is a famous example of an impredicative construction, namely the set of all sets which do not contain themselves. The paradox is whether such a set contains itself or not — if it does then by definition it should not, and if it does not then by definition it should. The greatest lower bound of a set X, glb(X), also has an impredicative definition; y = glb(X) if and only if for all elements x of X, y is less than or equal to x, and any z less than or equal to all elements of X is less than or equal to y. But this definition also quantifies over the set (potentially infinite, depending on the order in question) whose members are the lower bounds of X, one of which being the glb itself. Hence predicativism would reject this definition. History The vicious circle principle was suggested by Henri Poincaré (1905-6, 1908) and Bertrand Russell in the wake of the paradoxes as a requirement on legitimate set specifications. Sets which do not meet the requirement are called impredicative. The first modern paradox appeared with Cesare Burali-Forti's 1897 A question on transfinite numbers and would become known as the Burali-Forti paradox. Cantor had apparently discovered the same paradox in his (Cantor's) \"naive\" set theory and this become known as Cantor's paradox. Russell's awareness of the problem originated in June 1901 with his reading of Frege's treatise of mathematical logic, his 1879 Begriffsschrift; the offending sentence in Frege is the following: \"On the other hand, it may be also be that the argument is determinate and the function indeterminate\". In other words, given f(a) the function f is the variable and a is the invariant part. So why not substitute the value f(a) for f itself? Russell promptly wrote Frege a letter pointing out that: \"You state ... that a function too, can act as the indeterminate element. This I formerly believed, but now this view seems doubtful to me because of the following contradiction. Let w be the predicate: to be a predicate that cannot be predicated of itself. Can w be predicated of itself? From each answer its opposite follows. There we must conclude that w is not a predicate. Likewise there is no class (as a totality) of those classes which each taken as a totality, do not belong to themselves. From this I conclude that under certain circumstances a definable collection does not form a totality\". Frege promptly wrote back to Russell acknowledging the problem: \"Your discovery of the contradiction caused me the greatest surprise and, I would almost say, consternation, since it has shaken the basis on which I intended to build arithmetic\". While the problem had adverse personal consequences for both men (both had works at the printers that had to be emended), van Heijenoort observes that \"The paradox shook the logicians' world, and the rumbles are still felt today. ... Russell's paradox, which makes use of the bare notions of set and element, falls squarely in the field of logic. The paradox was first published by Russell in The principles of mathematics (1903) and is discussed there in great detail...\". Russell, after 6 years of false starts, would eventually answer the matter with his 1908 theory of types by \"propounding his axiom of reducibility. It says that any function is coextensive with what he calls a predicative function: a function in which the types of apparent variables run no higher than the types of the arguments\". But this \"axiom\" was met with resistance from all quarters. The rejection of impredicatively defined mathematical objects (while accepting the natural numbers as classically understood) leads to the position in the philosophy of mathematics known as predicativism, advocated by Henri Poincaré and Hermann Weyl in his Das Kontinuum. Poincaré and Weyl argued that impredicative definitions are problematic only when one or more underlying sets are infinite. Ernst Zermelo in his 1908 A new proof of the possibility of a well-ordering presents an entire section \"b. Objection concerning nonpredicative definition\" where he argued against \"Poincaré (1906, p. 307) [who states that] a definition is 'predicative' and logically admissible only if it excludes all objects that are dependent upon the notion defined, that is, that can in any way be determined by it\". He gives two examples of impredicative definitions -- (i) the notion of Dedekind chains and (ii) \"in analysis wherever the maximum or minimum of a previously defined \"completed\" set of numbers Z is used for further inferences. This happens, for example, in the well-known Cauchy proof of the fundamental theorem of algebra, and up to now it has not occurred to anyone to regard this as something illogical\". He ends his section with the following observation: \"A definition may very well rely upon notions that are equivalent to the one being defined; indeed, in every definition definiens and definiendum are equivalent notions, and the strict observance of Poincaré's demand would make every definition, hence all of science, impossible\". Zermelo's example of minimum and maximum of a previously defined \"completed\" set of numbers reappears in Kleene 1952:42-42 where Kleene uses the example of Least upper bound in his discussion of impredicative definitions; Kleene does not resolve this problem. In the next paragraphs he discusses Weyl's attempt in his 1918 Das Kontinuum (The continuum) to eliminate impredicative definitions and his failure to retain the \"theorem that an arbitrary non-empty set M of real numbers having an upper bound has a least upper bound (Cf. also Weyl 1919.)\" Ramsey argued that \"impredicative\" definitions can be harmless: for instance, the definition of \"Tallest person in the room\" is impredicative, since it depends on a set of things of which it is an element, namely the set of all persons in the room. Concerning mathematics, an example of an impredicative definition is the smallest number in a set, which is formally defined as: y = min(X) if and only if for all elements x of X, y is less than or equal to x, and y is in X. Burgess (2005) discusses predicative and impredicative theories at some length, in the context of Frege's logic, Peano arithmetic, second order arithmetic, and axiomatic set theory. See also Gödel, Escher, Bach Gödel, Escher, Bach#Themes Impredicative polymorphism Richard's paradox Notes References Predicative and Impredicative Definitions entry in the Internet Encyclopedia of Philosophy PlanetMath article on predicativism John Burgess, 2005. Fixing Frege. Princeton Univ. Press. Solomon Feferman, 2005, \"Predicativity\" in The Oxford Handbook of Philosophy of Mathematics and Logic. Oxford University Press: 590–624. Stephen C. Kleene 1952 (1971 edition), Introduction to Metamathematics, North-Holland Publishing Company, Amsterdam NY, ISBN 0-7204-2103-9. In particular cf his §11 The Paradoxes (pp. 36–40) and §12 First inferences from the paradoxes IMPREDICATIVE DEFINITION (p. 42). He states that his 6 or so (famous) examples of paradoxes (antinomies) are all examples of impredicative definition, and says that Poincaré (1905–6, 1908) and Russell (1906, 1910) \"enunciated the cause of the paradoxes to lie in these impredicative definitions\" (p. 42), however, \"parts of mathematics we want to retain, particularly analysis, also contain impredicative definitions.\" (ibid). Weyl in his 1918 (\"Das Kontinuum\") attempted to derive as much of analysis as was possible without the use of impredicative definitions, \"but not the theorem that an arbitrary non-empty set M of real numbers having an upper bound has a least upper bound (CF. also Weyl 1919)\" (p. 43). Hans Reichenbach 1947, Elements of Symbolic Logic, Dover Publications, Inc., NY, ISBN 0-486-24004-5. Cf his §40. The antinomies and the theory of types (pp. 218 — wherein he demonstrates how to create antinomies, including the definition of impredicable itself (\"Is the definition of \"impredicable\" impredicable?\"). He claims to show methods for eliminating the \"paradoxes of syntax\" (\"logical paradoxes\") — by use of the theory of types — and \"the paradoxes of semantics\" — by the use of metalanguage (his \"theory of levels of language\"). He attributes the suggestion of this notion to Russell and more concretely to Ramsey. Jean van Heijenoort 1967, third printing 1976, From Frege to Gödel: A Source Book in Mathematical Logic, 1879-1931, Harvard University Press, Cambridge MA, ISBN 0-674-32449-8 (pbk.)","top_words":[{"w":"impredicative","c":20},{"w":"definition","c":18},{"w":"paradox","c":10},{"w":"definitions","c":9},{"w":"paradoxes","c":8},{"w":"logic","c":7},{"w":"theory","c":7},{"w":"frege","c":7},{"w":"mathematics","c":6},{"w":"bound","c":6},{"w":"poincar","c":6},{"w":"numbers","c":6},{"w":"weyl","c":6},{"w":"upper","c":5},{"w":"lower","c":4},{"w":"elements","c":4},{"w":"equal","c":4},{"w":"problem","c":4},{"w":"predicative","c":4},{"w":"kleene","c":4},{"w":"sets","c":3},{"w":"glb","c":3},{"w":"predicativism","c":3},{"w":"cantor","c":3},{"w":"mathematical","c":3},{"w":"element","c":3},{"w":"predicate","c":3},{"w":"totality","c":3},{"w":"arithmetic","c":3},{"w":"notions","c":3},{"w":"philosophy","c":3},{"w":"das","c":3},{"w":"kontinuum","c":3},{"w":"argued","c":3},{"w":"notion","c":3},{"w":"theorem","c":3},{"w":"del","c":3},{"w":"press","c":3},{"w":"isbn","c":3},{"w":"antinomies","c":3},{"w":"impredicable","c":3},{"w":"quantifies","c":2},{"w":"opposite","c":2},{"w":"impredicativity","c":2},{"w":"predicativity","c":2},{"w":"theories","c":2},{"w":"variables","c":2},{"w":"variable","c":2},{"w":"famous","c":2},{"w":"greatest","c":2},{"w":"infinite","c":2},{"w":"question","c":2},{"w":"henri","c":2},{"w":"requirement","c":2},{"w":"burali","c":2},{"w":"forti","c":2},{"w":"indeterminate","c":2},{"w":"wrote","c":2},{"w":"contradiction","c":2},{"w":"predicated","c":2},{"w":"answer","c":2},{"w":"conclude","c":2},{"w":"heijenoort","c":2},{"w":"axiom","c":2},{"w":"objects","c":2},{"w":"zermelo","c":2},{"w":"proof","c":2},{"w":"concerning","c":2},{"w":"maximum","c":2},{"w":"minimum","c":2},{"w":"inferences","c":2},{"w":"equivalent","c":2},{"w":"discusses","c":2},{"w":"retain","c":2},{"w":"arbitrary","c":2},{"w":"empty","c":2},{"w":"ramsey","c":2},{"w":"burgess","c":2},{"w":"escher","c":2},{"w":"bach","c":2},{"w":"oxford","c":2},{"w":"referencing","c":1},{"w":"precisely","c":1},{"w":"invokes","c":1},{"w":"mentions","c":1},{"w":"commonly","c":1},{"w":"essentially","c":1},{"w":"entails","c":1},{"w":"building","c":1},{"w":"stratified","c":1},{"w":"ramified","c":1},{"w":"quantification","c":1},{"w":"distinguished","c":1},{"w":"ranges","c":1},{"w":"prototypical","c":1},{"w":"intuitionistic","c":1},{"w":"retains","c":1},{"w":"ramification","c":1},{"w":"discards","c":1},{"w":"construction","c":1},{"w":"members","c":1},{"w":"bounds","c":1},{"w":"reject","c":1},{"w":"history","c":1},{"w":"vicious","c":1},{"w":"circle","c":1},{"w":"principle","c":1},{"w":"bertrand","c":1},{"w":"wake","c":1},{"w":"legitimate","c":1},{"w":"specifications","c":1},{"w":"meet","c":1},{"w":"modern","c":1},{"w":"appeared","c":1},{"w":"cesare","c":1},{"w":"transfinite","c":1},{"w":"discovered","c":1},{"w":"naive","c":1},{"w":"awareness","c":1},{"w":"originated","c":1},{"w":"reading","c":1},{"w":"treatise","c":1},{"w":"begriffsschrift","c":1},{"w":"offending","c":1},{"w":"sentence","c":1},{"w":"hand","c":1},{"w":"argument","c":1},{"w":"determinate","c":1},{"w":"invariant","c":1},{"w":"substitute","c":1},{"w":"letter","c":1},{"w":"pointing","c":1},{"w":"believed","c":1},{"w":"view","c":1},{"w":"doubtful","c":1},{"w":"likewise","c":1},{"w":"class","c":1},{"w":"classes","c":1},{"w":"belong","c":1},{"w":"circumstances","c":1},{"w":"definable","c":1},{"w":"collection","c":1},{"w":"acknowledging","c":1},{"w":"discovery","c":1},{"w":"surprise","c":1},{"w":"consternation","c":1},{"w":"shaken","c":1},{"w":"basis","c":1},{"w":"build","c":1},{"w":"adverse","c":1},{"w":"personal","c":1},{"w":"consequences","c":1},{"w":"works","c":1},{"w":"printers","c":1},{"w":"emended","c":1},{"w":"observes","c":1},{"w":"shook","c":1},{"w":"logicians","c":1},{"w":"rumbles","c":1},{"w":"felt","c":1},{"w":"today","c":1},{"w":"bare","c":1},{"w":"falls","c":1},{"w":"squarely","c":1},{"w":"principles","c":1},{"w":"detail","c":1},{"w":"false","c":1},{"w":"starts","c":1},{"w":"eventually","c":1},{"w":"matter","c":1},{"w":"propounding","c":1},{"w":"reducibility","c":1},{"w":"coextensive","c":1},{"w":"calls","c":1},{"w":"higher","c":1},{"w":"arguments","c":1},{"w":"resistance","c":1},{"w":"quarters","c":1},{"w":"rejection","c":1},{"w":"impredicatively","c":1},{"w":"accepting","c":1},{"w":"natural","c":1},{"w":"classically","c":1},{"w":"leads","c":1},{"w":"position","c":1},{"w":"advocated","c":1},{"w":"hermann","c":1},{"w":"problematic","c":1},{"w":"ernst","c":1},{"w":"possibility","c":1},{"w":"ordering","c":1},{"w":"presents","c":1},{"w":"entire","c":1},{"w":"objection","c":1},{"w":"nonpredicative","c":1},{"w":"logically","c":1},{"w":"admissible","c":1},{"w":"excludes","c":1},{"w":"dedekind","c":1},{"w":"chains","c":1},{"w":"cauchy","c":1},{"w":"fundamental","c":1},{"w":"algebra","c":1},{"w":"occurred","c":1},{"w":"regard","c":1},{"w":"illogical","c":1},{"w":"ends","c":1},{"w":"observation","c":1},{"w":"rely","c":1},{"w":"definiens","c":1},{"w":"definiendum","c":1},{"w":"strict","c":1},{"w":"observance","c":1},{"w":"demand","c":1},{"w":"impossible","c":1},{"w":"reappears","c":1},{"w":"discussion","c":1},{"w":"resolve","c":1},{"w":"paragraphs","c":1},{"w":"attempt","c":1},{"w":"continuum","c":1},{"w":"eliminate","c":1},{"w":"failure","c":1},{"w":"harmless","c":1},{"w":"instance","c":1},{"w":"tallest","c":1},{"w":"person","c":1},{"w":"depends","c":1},{"w":"persons","c":1},{"w":"smallest","c":1},{"w":"formally","c":1},{"w":"context","c":1},{"w":"peano","c":1},{"w":"axiomatic","c":1},{"w":"themes","c":1},{"w":"polymorphism","c":1},{"w":"richard","c":1},{"w":"notes","c":1},{"w":"references","c":1},{"w":"entry","c":1},{"w":"internet","c":1},{"w":"encyclopedia","c":1},{"w":"planetmath","c":1},{"w":"fixing","c":1},{"w":"princeton","c":1},{"w":"univ","c":1},{"w":"solomon","c":1},{"w":"feferman","c":1},{"w":"handbook","c":1},{"w":"stephen","c":1},{"w":"edition","c":1},{"w":"introduction","c":1},{"w":"metamathematics","c":1},{"w":"north","c":1},{"w":"holland","c":1},{"w":"company","c":1},{"w":"amsterdam","c":1},{"w":"enunciated","c":1},{"w":"lie","c":1},{"w":"parts","c":1},{"w":"ibid","c":1},{"w":"attempted","c":1},{"w":"derive","c":1},{"w":"hans","c":1},{"w":"reichenbach","c":1},{"w":"symbolic","c":1},{"w":"dover","c":1},{"w":"publications","c":1},{"w":"eliminating","c":1},{"w":"syntax","c":1},{"w":"logical","c":1},{"w":"semantics","c":1},{"w":"metalanguage","c":1},{"w":"language","c":1},{"w":"attributes","c":1},{"w":"suggestion","c":1},{"w":"concretely","c":1},{"w":"jean","c":1},{"w":"third","c":1},{"w":"printing","c":1},{"w":"book","c":1},{"w":"harvard","c":1},{"w":"cambridge","c":1},{"w":"pbk","c":1}],"meta":{"abstract":"In mathematics and logic, a self-referencing definition is called impredicative. More precisely, a definition is said to be impredicative if it invokes (mentions or quantifies over) the set being defined, or (more commonly) another set which contains the thing being defined. The opposite of impredicativity is predicativity, which essentially entails building stratified (or ramified) theories where quantification over lower levels results in variables of some new type, distinguished from the lower types that the variable ranges over. A prototypical example is intuitionistic type theory, which retains ramification but discards impredicativity. Russell's paradox is a famous example of an impredicative construction, namely the set of all sets which do not contain themselves. The paradox is whether such a set contains itself or not — if it does then by definition it should not, and if it does not then by definition it should. The greatest lower bound of a set X, glb(X), also has an impredicative definition; y = glb(X) if and only if for all elements x of X, y is less than or equal to x, and any z less than or equal to all elements of X is less than or equal to y. But this definition also quantifies over the set (potentially infinite, depending on the order in question) whose members are the lower bounds of X, one of which being the glb itself. Hence predicativism would reject this definition. History The vicious circle principle was suggested by Henri Poincaré (1905-6, 1908) and Bertrand Russell in the wake of the paradoxes as a requirement on legitimate set specifications. Sets which do not meet the requirement are called impredicative. The first modern paradox appeared with Cesare Burali-Forti's 1897 A question on transfinite numbers and would become known as the Burali-Forti paradox. Cantor had apparently discovered the same paradox in his (Cantor's) \"naive\" set theory and this become known as Cantor's paradox. Russell's awareness of the problem originated in June 1901 with his reading of Frege's treatise of mathematical logic, his 1879 Begriffsschrift; the offending sentence in Frege is the following: \"On the other hand, it may be also be that the argument is determinate and the function indeterminate\". In other words, given f(a) the function f is the variable and a is the invariant part. So why not substitute the value f(a) for f itself? Russell promptly wrote Frege a letter pointing out that: \"You state ... that a function too, can act as the indeterminate element. This I formerly believed, but now this view seems doubtful to me because of the following contradiction. Let w be the predicate: to be a predicate that cannot be predicated of itself. Can w be predicated of itself? From each answer its opposite follows. There we must conclude that w is not a predicate. Likewise there is no class (as a totality) of those classes which each taken as a totality, do not belong to themselves. From this I conclude that under certain circumstances a definable collection does not form a","date":"2014-02-16T22:00:43Z","url":"http://en.wikipedia.org/wiki/Impredicativity"}}}
,{"_index":"test","_type":"document","_id":"55f3e5ac00576034f979fe4c","_score":0,"_source":{"_id":"55f3e5ac00576034f979fe4c","corpus":"Reference","external_id":"Go_(game)","source_type":"wikipedia","title":"Go (Game)","words":"Go (simplified Chinese: 围棋; traditional Chinese: 圍棋; pinyin: wéiqí, Japanese: 囲碁 igo, literal meaning: \"encircling game\", Korean: 바둑 baduk) is a board game involving two players that originated in ancient China more than 2,500 years ago. It was considered one of the four essential arts of a cultured Chinese scholar in antiquity. Its earliest written reference dates back to the Confucian Analects. There is significant strategy involved in the game, and the number of possible games is vast (10761 compared, for example, to the 10120 possible in chess), despite its relatively simple rules. The two players alternately place black and white playing pieces, called \"stones\", on the vacant intersections (\"points\") of a board with a 19x19 grid of lines. Beginners often play on smaller 9×9 and 13×13 boards, and archaeological evidence shows that game was played in earlier centuries on a board with a 17×17 grid. By the time the game had spread to Korea and Japan in about the 5th and 7th centuries CE respectively, however, boards with a 19×19 grid had become standard. The objective of the game—as the translation of its name implies—is to have surrounded a larger total area of the board with one's stones than the opponent by the end of the game, although this result typically involves many more intricacies than simply using surrounding areas directly. Once placed on the board, stones may not be moved, but stones may be removed from the board if captured—this is done by surrounding an opposing stone or group of stones by occupying all orthogonally-adjacent points. The two players place stones alternately until they reach a point at which neither player wishes to make another move; the game has no set ending conditions beyond this. When a game concludes, the territory is counted along with captured stones and komi (points added to the score of the player with the white stones as compensation for playing second) to determine the winner. Games may also be won by resignation. As of mid-2008, there were well over 40 million Go players worldwide, the overwhelming majority of them living in East Asia. As of May 2012, the International Go Federation has a total of 74 member countries and four Association Members covering multiple countries. Overview Go is an adversarial game with the objective of having surrounded a larger total area of the board with one's stones than the opponent. As the game progresses, the players place stones which map out formations and potential territories. Areas are contested in battles between opposing stones, which are often complex and may result in the expansion, reduction, or wholesale capture and loss of the contested area. A basic principle of Go is that stones must have at least one \"liberty\" (Chinese: 氣) to remain on the board. A \"liberty\" is an open \"point\" (intersection) next to a stone. An enclosed liberty (or liberties) is called an \"eye\" (眼), and a group of stones with at least two separate eyes is said to be unconditionally \"alive\". Such groups cannot be captured, even if surrounded. \"Dead\" stones are stones that are surrounded and in groups with poor shape (one or no eyes), and thus cannot resist eventual capture. The general strategy of Go is to expand one's territory where possible, attack the opponent's weak groups (groups that can possibly be killed), and always stay mindful of the \"life status\" of one's own groups. The liberties of groups are countable. Situations where two opposing groups must capture the other to live are called capturing races ('semeai' [攻め合い] in Japanese). In a capturing race, the group with more liberties (and/or better \"shape\") will ultimately be able to capture the opponent's stones. Capturing races and questions of life and death are examples of what makes Go challenging. The game ends when both players pass, and players pass when there are no more profitable moves to be made. The game is then scored: The player with the greater number of controlled (surrounded) points, factoring in the number of captured stones and komi, wins the game. Games may also be won by resignation, for example if a player has lost a large group of stones. Finer points In the opening stages of the game, players typically establish positions (or \"bases\") in the corners and around the sides of the board. These bases help to quickly develop strong shapes which have many options for life (self-viability for a group of stones which prevents capture and removal from the board) and establish formations for potential territory. Players usually start in the corners, because it is more efficient to make life and to establish territory with the aid of two edges of the board. Established corner opening sequences are called \"joseki\" (Japanese, 定石) or \"jungsuk\" (in Korean) and are often studied independently. \"駄目\" (pronounced [dame], 'neutral points') are points that lie in-between the boundary walls of black and white, and as such are considered to be of no value to either side. \"Seki\" (Chinese: 共活) are mutually alive pairs of white and black groups where neither has two eyes. A \"ko\" (Chinese and Japanese: 劫) is a repeated-position shape that may be contested by making forcing moves elsewhere. After the forcing move is played, the ko may be \"taken back\" and returned to its original position. Some \"ko fights\" may be important and decide the life of a large group, while others may be worth just one or two points. Some ko fights are referred to as \"picnic kos\" when only one side has a lot to lose. The Japanese call it a hanami (flower-viewing) ko. Playing with others usually requires a knowledge of each player's strength, as indicated by their rank (30kyu→1kyu|1dan→6dan|1dan pro→9dan pro). Handicaps can be given if there is a difference in rank—Black is allowed to place two or more stones on the board to compensate for White's greater strength. There are different rule-sets (Japanese, Chinese, AGA, etc.), which are almost entirely equivalent, except for certain special-case positions. Game theory In formal game theory terms, Go is a non-chance, combinatorial game with perfect information. Informally that means there are no dice used (and decisions or moves create discrete outcome vectors rather than probability distributions); the underlying math is combinatorial; and all moves (via single vertex analysis) are visible to both players (unlike some card games where some information is hidden). Perfect information also implies sequence—players can theoretically know about all past moves. Other game theoretical taxonomy elements include the facts that Go is bounded (because every game must end with a victor (or a tie) within a finite number of moves); the strategy is associative (every strategy is a function of board position); format is non-cooperative (not a team sport); positions are extensible (can be represented by board position trees); game is zero-sum (player choices do not increase resources available–colloquially, rewards in the game are fixed and if one player wins, the other loses) and the utility function is restricted (in the sense of win/lose; however, ratings, monetary rewards, national and personal pride and other factors can extend utility functions, but generally not to the extent of removing the win/lose restriction). Affine transformations are beyond the scope of this article, but they can theoretically add non zero and complex utility aspects even to two player games (see the Maschler reference on go/chess that follows here, p. 111). Rules Aside from the order of play (alternating moves, Black moves first or takes a handicap) and scoring rules, there are essentially only two rules in Go: Rule 1 (the rule of liberty) states that every stone remaining on the board must have at least one open \"point\" (an intersection, called a \"liberty\") directly next to it (up, down, left, or right), or must be part of a connected group that has at least one such open point (\"liberty\") next to it. Stones or groups of stones which lose their last liberty are removed from the board. Rule 2 (the \"ko rule\") states that the stones on the board must never repeat a previous position of stones. Moves which would do so are forbidden, and thus only moves elsewhere on the board are permitted that turn. Almost all other information about how the game is played is a heuristic, meaning it is learned information about how the game is played, rather than a rule. Other rules are specialized, as they come about through different rule-sets, but the above two rules cover almost all of any played game. Although there are some minor differences between rule sets used in different countries, most notably in Chinese and Japanese scoring rules, these differences do not greatly affect the tactics and strategy of the game. Except where noted otherwise, the basic rules presented here are valid independent of the scoring rules used. The scoring rules are explained separately. Go terms for which there are no ready English equivalent are commonly called by their Japanese names. Basic rules Two players, Black and White, take turns placing a stone (game piece) of their own color on a vacant point (intersection) of the grid on a Go board. Black moves first. If there is a large difference in skill between the players, Black is typically allowed to place two or more stones on the board to compensate for the difference (see Go handicaps). The official grid comprises 19×19 lines, though the rules can be applied to any grid size. 13×13 and 9×9 boards are popular choices to teach beginners. Once placed, a stone may not be moved to a different point. Vertically and horizontally adjacent stones of the same color form a chain (also called a string or group) that cannot subsequently be subdivided and, in effect, becomes a single larger stone. Only stones connected to one another by the lines on the board create a chain; stones that are diagonally adjacent are not connected. Chains may be expanded by placing additional stones on adjacent intersections, and can be connected together by placing a stone on an intersection that is adjacent to two or more chains of the same color. A vacant point adjacent to a stone is called a liberty for that stone. Stones in a chain share their liberties. A chain of stones must have at least one liberty to remain on the board. When a chain is surrounded by opposing stones so that it has no liberties, it is captured and removed from the board. The ko rule Players are not allowed to make a move that returns the game to the previous position. This rule, called the ko rule (Chinese: 劫; Japanese: 劫 kō \"eon\", Korean: 패; 'pae'), prevents unending repetition. As shown in the example pictured to the right: Black has just played the stone marked 1, capturing a white stone at the intersection marked with a circle. If White were now allowed to play on the marked intersection, that move would capture the black stone marked 1 and recreate the situation before Black made the move marked 1. Allowing this could result in an unending cycle of captures by both players. The ko rule therefore prohibits White from playing at the marked intersection immediately. Instead White must play elsewhere, or pass; Black can then end the ko by filling at the marked intersection, creating a five-stone black chain. If White wants to continue the ko (that specific repeating position), White tries to find a play elsewhere on the board that Black must answer; if Black answers, then White can retake the ko. A repetition of such exchanges is called a ko fight. While the various rule-sets agree on the ko rule prohibiting returning the board to an immediately previous position, they deal in different ways with the relatively uncommon situation in which a player might recreate a past position that is further removed. See Rules of Go: Repetition for further information. Suicide A player may not place a stone such that it or its group immediately has no liberties, unless doing so immediately deprives an enemy group of its final liberty. In the latter case, the enemy group is captured, leaving the new stone with at least one liberty. This rule is responsible for the all-important difference between one and two eyes: if a group with only one eye is fully surrounded on the outside, it can be killed with a stone placed in its single eye. The Ing and New Zealand rules do not have this rule, and there a player might destroy one of its own groups—\"commit suicide\". This play would only be useful in a limited set of situations involving a small interior space. Komi Because Black has the advantage of playing the first move, the idea of awarding White some compensation came into being during the 20th century. This is called komi, which gives white a 6.5 points compensation under Japanese rules (number of points varies by rule set). If there is one stone (rank) difference in strength between players, the stronger player takes white, and White may receive only 0.5 points komi, to break a possible tie (\"jigo\"). In handicap games with two or more handicap stones, White may also take 0.5 points komi to break a tie but it is more common that there is no komi. Scoring rules Two general types of scoring system are used, and players determine which to use before play. Both systems almost always give the same result. Territory scoring counts the number of empty points a player's stones surround, together with the number of stones she or he captured. Area scoring counts the number of points your stones occupy and surround. It is associated with contemporary Chinese play and was probably established there during the Ming Dynasty in the 15th or 16th century. After both players have passed consecutively, the stones that are still on the board but unable to avoid capture, called dead stones, are removed. Area scoring (including Chinese): A player's score is the number of stones that the player has on the board, plus the number of empty intersections surrounded by that player's stones. Territory scoring (including Japanese and Korean): In the course of the game, each player retains the stones they capture, termed prisoners. Any dead stones removed at the end of the game become prisoners. The score is the number of empty points enclosed by a player's stones, plus the number of prisoners captured by that player. If there is disagreement about which stones are dead, then under area scoring rules, the players simply resume play to resolve the matter. The score is computed using the position after the next time the players pass consecutively. Under territory scoring, the rules are considerably more complex; however, in practice, players generally play on, and, once the status of each stone has been determined, return to the position at the time the first two consecutive passes occurred and remove the dead stones. For further information, see Rules of Go. Given that the number of stones a player has on the board is directly related to the number of prisoners their opponent has taken, the resulting net score, that is the difference between Black's and White's scores, is identical under both rulesets (unless the players have passed different numbers of times during the course of the game). Thus, the net result given by the two scoring systems rarely differs by more than a point. Life and death While not actually mentioned in the rules of Go (at least in simpler rule sets, such as those of New Zealand and the U.S.), the concept of a living group of stones is necessary for a practical understanding of the game. When a group of stones is mostly surrounded and has no options to connect with friendly stones elsewhere, the status of the group is either alive, dead or unsettled. A group of stones is said to be alive if it cannot be captured, even if the opponent is allowed to move first. Conversely, a group of stones is said to be dead if it cannot avoid capture, even if the owner of the group is allowed the first move. Otherwise, the group is said to be unsettled: the defending player can make it alive or the opponent can kill it, depending on who gets to play first. To be alive, a group must be able to create at least two \"eyes\" if threatened. An eye is an empty point that is surrounded by friendly stones, where the opponent can never play due to the suicide rule. If two such eyes exist, the opponent can never capture a group of stones, because it always has at least two liberties. One eye is not enough for life, because a point that would normally be suicide may be played upon if doing so fills the last liberty of opposing stones, thereby capturing those stones. In the \"Examples of eyes\" diagram, all the circled points are eyes. The two black groups in the upper corners are alive, as both have at least two eyes. The groups in the lower corners are dead, as both have only one eye. The group in the lower left may seem to have two eyes, but the surrounded empty point marked a is not actually an eye. White can play there and take a black stone. Such a point is often called a false eye. Seki (mutual life) There is an exception to the requirement that a group must have two eyes to be alive, a situation called seki (or mutual life). Where different colored groups are adjacent and share liberties, the situation may reach a position when neither player wants to move first, because doing so would allow the opponent to capture; in such situations therefore both player's stones remain on the board in mutual life or \"seki\". Neither player receives any points for those groups, but at least those groups themselves remain living, as opposed to being captured. Seki can occur in many ways. The simplest are: (1) each player has a group without eyes and they share two liberties, and (2) each player has a group with one eye and they share one more liberty. In the \"Example of seki (mutual life)\" diagram, the circled points are liberties shared by both a black and a white group. Neither player wants to play on a circled point, because doing so would allow the opponent to capture. All the other groups in this example, both black and white, are alive with at least two eyes. Seki is unusual, but can result from an attempt by one player to invade and kill a nearly settled group of the other player. Tactics In Go, tactics deal with immediate fighting between stones, capturing and saving stones, life, death and other issues localized to a specific part of the board. Larger issues, not limited to only part of the board, are referred to as strategy, and are covered in their own section. Capturing tactics There are several tactical constructs aimed at capturing stones. These are among the first things a player learns after understanding the rules. Recognizing the possibility that stones can be captured using these techniques is an important step forward. The most basic technique is the ladder. To capture stones in a ladder, a player uses a constant series of capture threats—called atari—to force the opponent into a zigzag pattern as shown in the diagram to the right. Unless the pattern runs into friendly stones along the way, the stones in the ladder cannot avoid capture. Experienced players recognize the futility of continuing the pattern and play elsewhere. The presence of a ladder on the board does give a player the option to play a stone in the path of the ladder, thereby threatening to rescue their stones, forcing a response. Such a move is called a ladder breaker and may be a powerful strategic move. In the diagram, Black has the option of playing a ladder breaker. Another technique to capture stones is the so-called net, also known by its Japanese name, geta. This refers to a move that loosely surrounds some stones, preventing their escape in all directions. An example is given in the diagram to the left. It is generally better to capture stones in a net than in a ladder, because a net does not depend on the condition that there are no opposing stones in the way, nor does it allow the opponent to play a strategic ladder breaker. A third technique to capture stones is the snapback. In a snapback, one player allows a single stone to be captured, then immediately plays on the point formerly occupied by that stone; by so doing, the player captures a larger group of their opponent's stones, in effect snapping back at those stones. An example can be seen on the right. As with the ladder, an experienced player does not play out such a sequence, recognizing the futility of capturing only to be captured back immediately. Reading ahead One of the most important skills required for strong tactical play is the ability to read ahead. Reading ahead includes considering available moves to play, the possible responses to each move, and the subsequent possibilities after each of those responses. Some of the strongest players of the game can read up to 40 moves ahead even in complicated positions. As explained in the scoring rules, some stone formations can never be captured and are said to be alive, while other stones may be in the position where they cannot avoid being captured and are said to be dead. Much of the practice material available to players of the game comes in the form of life and death problems, also known as tsumego. In such problems, players are challenged to find the vital move sequence that kills a group of the opponent or saves a group of their own. Tsumego are considered an excellent way to train a player's ability at reading ahead, and are available for all skill levels, some posing a challenge even to top players. Ko fighting In situations when the Ko rule applies, a ko fight may occur. If the player who is prohibited from capture is of the opinion that the capture is important, because it prevents a large group of stones from being captured for instance, the player may play a ko threat. This is a move elsewhere on the board that threatens to make a large profit if the opponent does not respond. If the opponent does respond to the ko threat, the situation on the board has changed, and the prohibition on capturing the ko no longer applies. Thus the player who made the ko threat may now recapture the ko. Their opponent is then in the same situation and can either play a ko threat as well, or concede the ko by simply playing elsewhere. If a player concedes the ko, either because they do not think it important or because there are no moves left that could function as a ko threat, they have lost the ko, and their opponent may connect the ko. Instead of responding to a ko threat, a player may also choose to ignore the threat and connect the ko. They thereby win the ko, but at a cost. The choice of when to respond to a threat and when to ignore it is a subtle one, which requires a player to consider many factors, including how much is gained by connecting, how much is lost by not responding, how many possible ko threats both players have remaining, what the optimal order of playing them is, and what the size—points lost or gained—of each of the remaining threats is. Frequently, the winner of the ko fight does not connect the ko but instead captures one of the chains that constituted their opponent's side of the ko. In some cases, this leads to another ko fight at a neighboring location. Strategy Strategy deals with global influence, interaction between distant stones, keeping the whole board in mind during local fights, and other issues that involve the overall game. It is therefore possible to allow a tactical loss when it confers a strategic advantage. Novices often start by randomly placing stones on the board, as if it were a game of chance. An understanding of how stones connect for greater power develops, and then a few basic common opening sequences may be understood. Learning the ways of life and death helps in a fundamental way to develop one's strategic understanding of weak groups. A player who both plays aggressively and can handle adversity is said to display kiai, or fighting spirit, in the game. Basic concepts Basic strategic aspects include the following: Connection: Keeping one's own stones connected means that fewer groups need to make living shape, and one has fewer groups to defend. Cut: Keeping opposing stones disconnected means that the opponent needs to defend and make living shape for more groups. Stay alive: The simplest way to stay alive is to establish a foothold in the corner or along one of the sides. At a minimum, a group must have two eyes (separate open points) to be \"alive\". An opponent cannot fill in either eye, as any such move is suicidal and prohibited in the rules. Mutual life (seki) is better than dying: A situation in which neither player can play on a particular point without then allowing the other player to play at another point to capture. The most common example is that of adjacent groups that share their last few liberties—if either player plays in the shared liberties, they can reduce their own group to a single liberty (putting themselves in atari), allowing their opponent to capture it on the next move. Death: A group that lacks living shape is eventually removed from the board as captured. Invasion: Set up a new living group inside an area where the opponent has greater influence, means one reduces the opponents score in proportion to the area one occupies. Reduction: Placing a stone far enough into the opponent's area of influence to reduce the amount of territory they eventually get, but not so far in that it can be cut off from friendly stones outside. Sente: A play that forces one's opponent to respond (gote). A player who can regularly play sente has the initiative and can control the flow of the game. Sacrifice: Allowing a group to die in order to carry out a play, or plan, in a more important area. The strategy involved can become very abstract and complex. High-level players spend years improving their understanding of strategy, and a novice may play many hundreds of games against opponents before being able to win regularly. Opening strategy In the opening of the game, players usually play in the corners of the board first, as the presence of two edges make it easier for them to surround territory and establish their stones. After the corners, focus moves to the sides, where there is still one edge to support a player's stones. Opening moves are generally on the third and fourth line from the edge, with occasional moves on the second and fifth lines. In general, stones on the third line offer stability and are good defensive moves, whereas stones on the fourth line influence more of the board and are good attacking moves. The opening is the most difficult part of the game for professional players and takes a disproportionate amount of the playing time. In the opening, players often play established sequences called joseki, which are locally balanced exchanges; however, the joseki chosen should also produce a satisfactory result on a global scale. It is generally advisable to keep a balance between territory and influence. Which of these gets precedence is often a matter of individual taste. Phases of the game In the opening of the game, players usually play and gain territory in the corners of the board first, as the presence of two edges make it easier for them to surround territory and establish their stones. From a secure position in a corner, it is possible to lay claim to more territory by extending along the side of the board. The opening is the most theoretically difficult part of the game, and takes a large proportion of professional players' thinking time. The middle phase of the game is the most combative, and usually lasts for more than 100 moves. During the middlegame, the players invade each other's territories, and attack formations that lack the necessary two eyes for viability. Such groups may be saved or sacrificed for something more significant on the board. It is possible that one player may succeed in capturing a large weak group of the opponent's, which often proves decisive and ends the game by a resignation. However, matters may be more complex yet, with major trade-offs, apparently dead groups reviving, and skillful play to attack in such a way as to construct territories rather than kill. The end of the middlegame and transition to the endgame is marked by a few features. The game breaks up into areas that do not affect each other (with a caveat about ko fights), where before the central area of the board related to all parts of it. No large weak groups are still in serious danger. Moves can reasonably be attributed some definite value, such as 20 points or fewer, rather than simply being necessary to compete. Both players set limited objectives in their plans, in making or destroying territory, capturing or saving stones. These changing aspects of the game usually occur at much the same time, for strong players. In brief, the middlegame switches into the endgame when the concepts of strategy and influence need reassessment in terms of concrete final results on the board. History Origin in China The earliest written reference to the game is generally recognized as the historical annal Zuo Zhuan (c. 4th century BC), referring to a historical event of 548 BC. It is also mentioned in Book XVII of the Analects of Confucius and in two books written by Mencius (c. 3rd century BC). In all of these works, the game is referred to as yì (弈). Today, in China, it is known as weiqi (simplified Chinese: 围棋; traditional Chinese: 圍棋; pinyin: wéiqí; Wade–Giles: wei ch'i), literally the \"encirclement board game\". Go was originally played on a 17×17 line grid, but a 19×19 grid became standard by the time of the Tang Dynasty (618–907). Legends trace the origin of the game to the Chinese emperor Yao (2337–2258 BC), who was said to have had his counselor Shun design it for his unruly son, Danzhu, to favorably influence him. Other theories suggest that the game was derived from Chinese tribal warlords and generals, who used pieces of stone to map out attacking positions. In China, Go was considered one of the four cultivated arts of the Chinese scholar gentleman, along with calligraphy, painting and playing the musical instrument guqin. Spread to Korea and Japan Weiqi was introduced to Korea sometime between the 5th and 7th centuries CE, and was popular among the higher classes. In Korea, the game is called baduk (hangul: 바둑), and a variant of the game called Sunjang baduk was developed by the 16th century. Sunjang baduk became the main variant played in Korea until the end of the 19th century. The game reached Japan in the 7th century CE—where it is called go (碁) or igo (囲碁)—the game became popular at the Japanese imperial court in the 8th century, and among the general public by the 13th century. In 1603, Tokugawa Ieyasu re-established Japan's unified national government. In the same year, he assigned the then-best player in Japan, a Buddhist monk named Nikkai (né Kanō Yosaburo, 1559), to the post of Godokoro (Minister of Go). Nikkai took the name Honinbo Sansa and founded the Honinbo Go school. Several competing schools were founded soon after. These officially recognized and subsidized Go schools greatly developed the level of play and introduced the dan/kyu style system of ranking players. Players from the four schools (Honinbo, Yasui, Inoue and Hayashi) competed in the annual castle games, played in the presence of the shogun. Go in the West Despite its widespread popularity in East Asia, Go has been slow to spread to the rest of the world. Although there are some mentions of the game in western literature from the 16th century forward, Go did not start to become popular in the West until the end of the 19th century, when German scientist Oskar Korschelt wrote a treatise on the game. By the early 20th century, Go had spread throughout the German and Austro-Hungarian empires. In 1905, Edward Lasker learned the game while in Berlin. When he moved to New York, Lasker founded the New York Go Club together with (amongst others) Arthur Smith, who had learned of the game while touring the East and had published the book The Game of Go in 1908. Lasker's book Go and Go-moku (1934) helped spread the game throughout the U.S., and in 1935, the American Go Association was formed. Two years later, in 1937, the German Go Association was founded. World War II put a stop to most Go activity, but after the war, Go continued to spread. For most of the 20th century, the Japan Go Association (Nihon Ki-in) played a leading role in spreading Go outside East Asia by publishing the English-language magazine Go Review in the 1960s; establishing Go centers in the U.S., Europe and South America; and often sending professional teachers on tour to Western nations. Internationally, the game is now commonly known by its shortened Japanese name, and terms for common Go concepts are derived from their Japanese pronunciation. In 1996, NASA astronaut Daniel Barry and Japanese astronaut Koichi Wakata became the first people to play Go in space. They used a special Go set, which was named Go Space, designed by Wai-Cheung Willson Chow. Both astronauts were awarded honorary dan ranks by the Nihon Ki-in. As of May 2012, the International Go Federation has 57 member countries outside Asia. Learning and pedagogy After each Go game, it is common practice to thank the opponent when losing, the winner should then comment the game to help the weaker player progress. A common initiation method for beginners is to explain briefly the essential rules, then play on a small size goban, preferably 6x6 or 7x7. The small size allows to play quickly several games and to get simple positions easier to understand for beginners. The aim is to let beginners discover the strategies by direct practice of the game rather than theoretical presentation. Competitive play Ranks and ratings In Go, rank indicates a player's skill in the game. Traditionally, ranks are measured using kyu and dan grades, a system also adopted by many martial arts. More recently, mathematical rating systems similar to the Elo rating system have been introduced. Such rating systems often provide a mechanism for converting a rating to a kyu or dan grade. Kyu grades (abbreviated k) are considered student grades and decrease as playing level increases, meaning 1st kyu is the strongest available kyu grade. Dan grades (abbreviated d) are considered master grades, and increase from 1st dan to 7th dan. First dan equals a black belt in eastern martial arts using this system. The difference among each amateur rank is one handicap stone. For example, if a 5k plays a game with a 1k, the 5k would need a handicap of four stones to even the odds. Top-level amateur players sometimes defeat professionals in tournament play. Professional players have professional dan ranks (abbreviated p). These ranks are separate from amateur ranks. The rank system comprises, from the lowest to highest ranks: Tournament and match rules Tournament and match rules deal with factors that may influence the game but are not part of the actual rules of play. Such rules may differ between events. Rules that influence the game include: the setting of compensation points (komi), handicap, and time control parameters. Rules that do not generally influence the game are: the tournament system, pairing strategies, and placement criteria. Common tournament systems used in Go include the McMahon system, Swiss system, league systems and the knockout system. Tournaments may combine multiple systems; many professional Go tournaments use a combination of the league and knockout systems. Tournament rules may also set the following: compensation points, called komi, which compensate the second player for the first move advantage of his opponent; tournaments commonly use a compensation in the range of 5–8 points, generally including a half-point to prevent draws; handicap stones placed on the board before alternate play, allowing players of different strengths to play competitively (see Go handicap for more information); and superko: Although the basic ko rule described above covers more than 95% of all cycles occurring in games, there are some complex situations—triple ko, eternal life, etc.—that are not covered by it but would allow the game to cycle indefinitely. To prevent this, the ko rule is sometimes extended to disallow the repetition of any previous position. This extension is called superko. Top players and professional go A Go professional is a professional player of the game of Go. There are six areas with professional go associations, these are: China (China Qiyuan), Japan (Nihon Ki-in, Kansai Ki-in), Korea (Korea Baduk Association), Taiwan (Taiwan Chi Yuan Culture Foundation), the United States (AGA Professional System) and Europe (European Professional System). Although the game was developed in China, the establishment of the Four Go houses by Tokugawa Ieyasu at the start of the 17th century shifted the focus of the Go world to Japan. State sponsorship, allowing players to dedicate themselves full-time to study of the game, and fierce competition between individual houses resulted in a significant increase in the level of play. During this period, the best player of his generation was given the prestigious title Meijin (master) and the post of Godokoro (minister of Go). Of special note are the players who were dubbed Kisei (Go Sage). The only three players to receive this honor were Dosaku, Jowa and Shusaku, all of the house Honinbo. After the end of the Tokugawa shogunate and the Meiji Restoration period, the Go houses slowly disappeared, and in 1924, the Nihon Ki-in (Japanese Go Association) was formed. Top players from this period often played newspaper-sponsored matches of 2–10 games. Of special note are the (Chinese-born) player Go Seigen (Chinese: Wu Qingyuan), who scored 80% in these matches, and Minoru Kitani, who dominated matches in the early 1930s. These two players are also recognized for their groundbreaking work on new opening theory (Shinfuseki). For much of the 20th century, Go continued to be dominated by players trained in Japan. Notable names included Eio Sakata, Rin Kaiho (born in China), Masao Kato, Koichi Kobayashi and Cho Chikun (born Cho Ch'i-hun, South Korea). Top Chinese and Korean talents often moved to Japan, because the level of play there was high and funding was more lavish. One of the first Korean players to do so was Cho Namchul, who studied in the Kitani Dojo 1937–1944. After his return to Korea, the Hanguk Kiwon (Korea Baduk Association) was formed and caused the level of play in South Korea to rise significantly in the second half of the 20th century. In China, the game declined during the Cultural Revolution (1966–1976) but quickly recovered in the last quarter of the 20th century, bringing Chinese players, such as Nie Weiping and Ma Xiaochun, on par with their Japanese and Korean counterparts. The Chinese Weiqi Association (today part of the China Qiyuan) was established in 1962, professional dan grades started being issued in 1982. With the advent of major international titles from 1989 onward, it became possible to compare the level of players from different countries more accurately. Korean players such as Lee Chang-ho, Cho Hunhyun, Lee Sedol and Yoo Changhyuk dominated international Go and won many titles. Several Chinese players also rose to the top in international Go, most notably Ma Xiaochun, Chang Hao and Gu Li. As of 2013, Japan lags behind in the international Go scene. Historically, as with most sports and games, more men than women have played Go. Special tournaments for women exist, but until recently, men and women did not compete together at the highest levels; however, the creation of new, open tournaments and the rise of strong female players, most notably Rui Naiwei, have in recent years highlighted the strength and competitiveness of emerging female players. The level in other countries has traditionally been much lower, except for some players who had preparatory professional training in Asia. Knowledge of the game has been scant elsewhere up until the 20th century. A famous player of the 1920s was Edward Lasker. It was not until the 1950s that more than a few Western players took up the game as other than a passing interest. In 1978, Manfred Wimmer became the first Westerner to receive a professional player's certificate from an Asian professional Go association. In 2000, a Westerner, Michael Redmond, finally achieved the top rank awarded by an Asian Go association, 9 dan. In total, as of 2008, only nine non-Asian Go players have ever achieved professional status in Asian associations. Equipment It is possible to play Go with a simple paper board and coins or plastic tokens for the stones. More popular midrange equipment includes cardstock, a laminated particle board, or wood boards with stones of plastic or glass. More expensive traditional materials are still used by many players.The most expensive Go sets have black stones carved from slate and white stones carved from translucent white shells, played on boards carved in a single piece from the trunk of a tree. Traditional equipment Boards The Go board (generally referred to by its Japanese name goban (碁盤)) typically measures between 45 and 48 cm (18 and 19 in) in length (from one player's side to the other) and 42 to 44 cm (17 to 17 in) in width. Chinese boards are slightly larger, as a traditional Chinese Go stone is slightly larger to match. The board is not square; there is a 15:14 ratio in length to width, because with a perfectly square board, from the player's viewing angle the perspective creates a foreshortening of the board. The added length compensates for this. There are two main types of boards: a table board similar in most respects to other gameboards like that used for chess, and a floor board, which is its own free-standing table and at which the players sit. The traditional Japanese goban is between 10 and 18 cm (3.9 and 7.1 in) thick and has legs; it sits on the floor (see picture). It is preferably made from the rare golden-tinged Kaya tree (Torreya nucifera), with the very best made from Kaya trees up to 700 years old. More recently, the related California Torreya (Torreya californica) has been prized for its light color and pale rings as well as its reduced expense and more readily available stock. The natural resources of Japan have been unable to keep up with the enormous demand for the slow-growing Kaya trees; both T. nucifera and T. californica take many hundreds of years to grow to the necessary size, and they are now extremely rare, raising the price of such equipment tremendously. As Kaya trees are a protected species in Japan, they cannot be harvested until they have died. Thus, an old-growth, floor-standing Kaya goban can easily cost in excess of $10,000 with the highest-quality examples costing more than $60,000. Other, less expensive woods often used to make quality table boards in both Chinese and Japanese dimensions include Hiba (Thujopsis dolabrata), Katsura (Cercidiphyllum japonicum), Kauri (Agathis), and Shin Kaya (various varieties of spruce, commonly from Alaska, Siberia and China's Yunnan Province). So-called Shin Kaya is a potentially confusing merchant's term: shin means \"new\", and thus shin kaya is best translated \"faux kaya\", because the woods so described are biologically unrelated to Kaya. Stones A full set of Go stones (goishi) usually contains 181 black stones and 180 white ones; a 19×19 grid has 361 points, so there are enough stones to cover the board, and Black gets the extra odd stone because that player goes first. Traditional Japanese stones are double-convex, and made of clamshell (white) and slate (black). The classic slate is nachiguro stone mined in Wakayama Prefecture and the clamshell from the Hamaguri clam; however, due to a scarcity in the Japanese supply of this clam, the stones are most often made of shells harvested from Mexico. Historically, the most prized stones were made of jade, often given to the reigning emperor as a gift. In China, the game is traditionally played with single-convex stones made of a composite called Yunzi. The material comes from Yunnan Province and is made by sintering a proprietary and trade-secret mixture of mineral compounds derived from the local stone. This process dates to the Tang Dynasty and, after the knowledge was lost in the 1920s during the Chinese Civil War, was rediscovered in the 1960s by the now state-run Yunzi company. The material is praised for its colors, its pleasing sound as compared to glass or to synthetics such as melamine, and its lower cost as opposed to other materials such as slate/shell. The term \"yunzi\" can also refer to a single-convex stone made of any material; however, most English-language Go suppliers specify Yunzi as a material and single-convex as a shape to avoid confusion, as stones made of Yunzi are also available in double-convex while synthetic stones can be either shape. Traditional stones are made so that black stones are slightly larger in diameter than white; this is to compensate for the optical illusion created by contrasting colors that would make equal-sized white stones appear larger on the board than black stones. Bowls The bowls for the stones are shaped like a flattened sphere with a level underside. The lid is loose fitting and upturned before play to receive stones captured during the game. Chinese bowls are slightly larger, and a little more rounded, a style known generally as Go Seigen; Japanese Kitani bowls tend to have a shape closer to that of the bowl of a snifter glass, such as for brandy. The bowls are usually made of turned wood. Mulberry is the traditional material for Japanese bowls, but is very expensive; wood from the Chinese jujube date tree, which has a lighter color (it is often stained) and slightly more visible grain pattern, is a common substitute for rosewood, and traditional for Go Seigen-style bowls. Other traditional materials used for making Chinese bowls include lacquered wood, ceramics, stone and woven straw or rattan. The names of the bowl shapes, \"Go Seigen\" and \"Kitani\", were introduced in the last quarter of the 20th century by the professional player Janice Kim as homage to two 20th-century professional Go players by the same names, of Chinese and Japanese nationality, respectively, who are referred to as the \"Fathers of modern Go\". Playing technique and etiquette The traditional way to place a Go stone is to first take one from the bowl, gripping it between the index and middle fingers, with the middle finger on top, and then placing it directly on the desired intersection. One can also place a stone on the board and then slide it into position under appropriate circumstances (where it does not move any other stones). It is considered respectful towards White for Black to place the first stone of the game in the upper right-hand corner. (Because of symmetry, this has no effect on the game's outcome.) It is considered poor manners to run one's fingers through one's bowl of unplayed stones, as the sound, however soothing to the player doing this, can be disturbing to one's opponent. Similarly, \"clacking\" a stone against another stone, the board, or the table or floor is also discouraged. However, it is permissible to emphasize select moves by striking the board more firmly than normal, thus producing a sharp clack. Time control A game of Go may be timed using a game clock. Formal time controls were introduced into the professional game during the 1920s and were controversial. Adjournments and sealed moves began to be regulated in the 1930s. Go tournaments use a number of different time control systems. All common systems envisage a single main period of time for each player for the game, but they vary on the protocols for continuation (in overtime) after a player has finished that time allowance. The most widely used time control system is the so-called byoyomi system. The top professional Go matches have timekeepers so that the players do not have to press their own clocks. Two widely used variants of the byoyomi system are: Standard byoyomi: After the main time is depleted, a player has a certain number of time periods (typically around thirty seconds). After each move, the number of full-time periods that the player took (often zero) is subtracted. For example, if a player has three thirty-second time periods and takes thirty or more (but less than sixty) seconds to make a move, they lose one time period. With 60–89 seconds, they lose two time periods, and so on. If, however, they take less than thirty seconds, the timer simply resets without subtracting any periods. Using up the last period means that the player has lost on time. Canadian byoyomi: After using all of their main time, a player must make a certain number of moves within a certain period of time, such as twenty moves within five minutes. If the time period expires without the required number of stones having been played, then the player has lost on time. Notation and recording games Go games are recorded with a simple coordinate system. This is comparable to algebraic chess notation, except that Go stones do not move and thus require only one coordinate per turn. Coordinate systems include purely numerical (4-4 point), hybrid (K3), and purely alphabetical. The Smart Game Format uses alphabetical coordinates internally, but most editors represent the board with hybrid coordinates as this reduces confusion. The Japanese word kifu is sometimes used to refer to a game record. In Unicode, Go stones are encoded in the block Miscellaneous Symbols: U+2686 ⚆ white circle with dot right (HTML &#9862;) U+2687 ⚇ white circle with two dots (HTML &#9863;) U+2688 ⚈ black circle with dot right (HTML &#9864;) U+2689 ⚉ black circle with two dots (HTML &#9865;) Computers and Go Nature of the game In combinatorial game theory terms, Go is a zero-sum, perfect-information, partisan, deterministic strategy game, putting it in the same class as chess, checkers (draughts) and Reversi (Othello); however it differs from these in its game play. Although the rules are simple, the practical strategy is extremely complex. The game emphasizes the importance of balance on multiple levels and has internal tensions. To secure an area of the board, it is good to play moves close together; however, to cover the largest area, one needs to spread out, perhaps leaving weaknesses that can be exploited. Playing too low (close to the edge) secures insufficient territory and influence, yet playing too high (far from the edge) allows the opponent to invade. It has been claimed that Go is the most complex game in the world due to its vast number of variations in individual games. Its large board and lack of restrictions allow great scope in strategy and expression of players' individuality. Decisions in one part of the board may be influenced by an apparently unrelated situation in a distant part of the board. Plays made early in the game can shape the nature of conflict a hundred moves later. The game complexity of Go is such that describing even elementary strategy fills many introductory books. In fact, numerical estimates show that the number of possible games of Go far exceeds the number of atoms in the observable universe. Research of go endgame by John H. Conway led to the invention of the surreal numbers. Go also contributed to development of combinatorial game theory (with Go Infinitesimals being a specific example of its use in Go). Software players Go poses a daunting challenge to computer programmers. The best Go programs only manage to reach amateur dan level. On the small 9×9 board, the computer fares better, and some programs now win a fraction of their 9×9 games against professional players. Many in the field of artificial intelligence consider Go to require more elements that mimic human thought than chess. The reasons why computer programs do not play Go at the professional dan level include: The number of spaces on the board is much larger (over five times the number of spaces on a chess board—361 vs. 64). On most turns there are many more possible moves in Go than in chess. Throughout most of the game, the number of legal moves stays at around 150–250 per turn, and rarely falls below 50 (in chess, the average number of moves is 37). Because an exhaustive computer program for Go must calculate and compare every possible legal move in each ply (player turn), its ability to calculate the best plays is sharply reduced when there are a large number of possible moves. Most computer game algorithms, such as those for chess, compute several moves in advance. Given an average of 200 available moves through most of the game, for a computer to calculate its next move by exhaustively anticipating the next four moves of each possible play (two of its own and two of its opponent's), it would have to consider more than 320 billion (3.2×1011) possible combinations. To exhaustively calculate the next eight moves, would require computing 512 quintillion (5.12×1020) possible combinations. As of March 2014, the most powerful supercomputer in the world, NUDT's \"Tianhe-2\", can sustain 33.86 petaflops. At this rate, even given an exceedingly low estimate of 10 operations required to assess the value of one play of a stone, Tianhe-2 would require 4 hours, to assess all possible combinations of the next eight moves in order to make a single play. The placement of a single stone in the initial phase can affect the play of the game a hundred or more moves later. A computer would have to predict this influence, and it would be unworkable to attempt to exhaustively analyze the next hundred moves. In capture-based games (such as chess), a position can often be evaluated relatively easily, such as by calculating who has a material advantage or more active pieces. In Go, there is often no easy way to evaluate a position. However a 6-kyu human can evaluate a position at a glance, to see which player has more territory, and even beginners can estimate the score within 10 points, given time to count it. The number of stones on the board (material advantage) is only a weak indicator of the strength of a position, and a territorial advantage (more empty points surrounded) for one player might be compensated by the opponent's strong positions and influence all over the board. Normally a 3-dan can easily judge most of these positions. As an illustration, the greatest handicap normally given to a weaker opponent is 9 stones. It was not until August 2008 that a computer won a game against a professional level player at this handicap. It was the Mogo program, which scored this first victory in an exhibition game played during the US Go Congress. Software assistance An abundance of software is available to support players of the game. This includes programs that can be used to view or edit game records and diagrams, programs that allow the user to search for patterns in the games of strong players, and programs that allow users to play against each other over the Internet. Some web servers provide graphical aids like maps, to aid learning during play. These graphical aids may suggest possible next moves, indicate areas of influence, highlight vital stones under attack and mark stones in atari or about to be captured. There are several file formats used to store game records, the most popular of which is SGF, short for Smart Game Format. Programs used for editing game records allow the user to record not only the moves, but also variations, commentary and further information on the game. Electronic databases can be used to study life and death situations, joseki, fuseki and games by a particular player. Programs are available that give players pattern searching options, which allow players to research positions by searching for high-level games in which similar situations occur. Such software generally lists common follow-up moves that have been played by professionals and gives statistics on win/loss ratio in opening situations. Internet-based Go servers allow access to competition with players all over the world, for real-time and turn-based games. Such servers also allow easy access to professional teaching, with both teaching games and interactive game review being possible. In popular culture and science Apart from technical literature and study material, Go and its strategies have been the subject of several works of fiction, such as The Master of Go by Nobel prize-winning author Yasunari Kawabata and The Girl Who Played Go by Shan Sa. Other books have used Go as a theme or minor plot device. For example, the novel Shibumi by Trevanian centers around the game and uses Go metaphors, and The Way of Go: 8 Ancient Strategy Secrets for Success in Business and Life by Troy Anderson applies Go strategy to business. GO: An Asian Paradigm for Business Strategy by Miura Yasuyuki, a manager with Japan Airlines, uses Go to describe the thinking and behavior of business men. Of particular note is the manga (Japanese comic book) and anime series Hikaru no Go, released in Japan in 1998, which had a large impact in popularizing Go among young players, both in Japan and—as translations were released—abroad. Go Player is a similar animated series about young Go players that aired in China. Similarly, Go has been used as a subject or plot device in film, such as π, A Beautiful Mind, Tron: Legacy, and The Go Master, a biopic of Go professional Go Seigen. 2013's Tôkyô ni kita bakari or Tokyo Newcomer portrays a Chinese foreigner Go player moving to Tokyo. In King Hu's wuxia film The Valiant Ones, the characters are color-coded as Go stones (black or other dark shades for the Chinese, white for the Japanese invaders), Go boards and stones are used by the characters to keep track of soldiers prior to battle, and the battles themselves are structured like a game of Go. The corporation and brand Atari was named after the Go term. Hedge fund manager Mark Spitznagel used weiqi as his main investing metaphor in his popular investing book The Dao of Capital. Psychology A 2004 review of literature by Fernand Gobet, de Voogt & Retschitzki shows that relatively little scientific research has been carried out on the psychology of Go, compared with other traditional board games such as chess and Mancala. Computer Go research has shown that given the large search tree, knowledge and pattern recognition are more important in Go than in other strategy games, such as chess. A study of the effects of age on Go-playing has shown that mental decline is milder with strong players than with weaker players. According to the review of Gobet and colleagues, the pattern of brain activity observed with techniques such as PET and fMRI does not show large differences between Go and chess. On the other hand, a study by Xiangchuan Chen et al. showed greater activation in the right hemisphere among Go players than among chess players. There is some evidence to suggest a correlation between playing board games and reduced risk of Alzheimer's disease and dementia. Comparisons Go begins with an empty board. It is focused on building from the ground up (nothing to something) with multiple, simultaneous battles leading to a point-based win. Chess is tactical rather than strategic, as the predetermined strategy is to kill one individual piece (the king). This comparison has also been applied to military and political history, with Scott Boorman's 1969 book The Protracted Game exploring the strategy of the Communist Party of China in the Chinese Civil War through the lens of Go. A similar comparison has been drawn among Go, chess and backgammon, perhaps the three oldest games that enjoy worldwide popularity. Backgammon is a \"man vs. fate\" contest, with chance playing a strong role in determining the outcome. Chess, with rows of soldiers marching forward to capture each other, embodies the conflict of \"man vs. man\". Because the handicap system tells Go players where they stand relative to other players, an honestly ranked player can expect to lose about half of their games; therefore, Go can be seen as embodying the quest for self-improvement, \"man vs. self\". See also Benson's algorithm – a method for determining the chains that are unconditionally alive Go opening strategy Go proverbs Go variants and Games played with Go equipment List of Go organizations List of professional Go tournaments Royal Game of Ur – a backgammon-like dice boardgame played in Near East ca. 2500–100 BC, known from archaeology Notes References Citations Bibliography Further reading Introductory books Historical interest External links Go at DMOZ International Go Federation (IGF), at intergofed.org European Go Federation (EGF), at eurogofed.org American Go Association (AGA), at usgo.org The Nihon Ki-in (Japan Go Association), at nihonkiin.or.jp History of Go Sensei's Library, a wiki about and around the game of Go Goproblems.com, open database of interactive Go problems, at goproblems.com Go Game Guru, frequently updated site where you can learn Go, study Go and read Go news Direct download for free print and play 9x9 Go set in A4 and letter formats. The Interactive Way to Go, an interactive tutorial for the Go game. GNU Go, a free text-mode Go engine program. qGo, a free graphical user interface Go client, complete with a full featured SGF editor.","top_words":[{"w":"stones","c":118},{"w":"game","c":117},{"w":"players","c":79},{"w":"player","c":79},{"w":"play","c":56},{"w":"moves","c":41},{"w":"stone","c":39},{"w":"opponent","c":34},{"w":"chinese","c":33},{"w":"rules","c":32},{"w":"white","c":32},{"w":"japanese","c":29},{"w":"games","c":29},{"w":"points","c":27},{"w":"professional","c":27},{"w":"move","c":24},{"w":"capture","c":24},{"w":"strategy","c":23},{"w":"rule","c":22},{"w":"played","c":21},{"w":"position","c":20},{"w":"century","c":20},{"w":"captured","c":19},{"w":"point","c":19},{"w":"chess","c":18},{"w":"dan","c":18},{"w":"playing","c":17},{"w":"japan","c":17},{"w":"territory","c":16},{"w":"eyes","c":15},{"w":"china","c":14},{"w":"liberty","c":14},{"w":"alive","c":14},{"w":"scoring","c":14},{"w":"influence","c":14},{"w":"traditional","c":13},{"w":"large","c":13},{"w":"opening","c":13},{"w":"surrounded","c":12},{"w":"liberties","c":12},{"w":"capturing","c":12},{"w":"korea","c":11},{"w":"larger","c":11},{"w":"generally","c":11},{"w":"handicap","c":11},{"w":"boards","c":10},{"w":"eye","c":10},{"w":"dead","c":10},{"w":"shape","c":10},{"w":"ladder","c":10},{"w":"kaya","c":10},{"w":"grid","c":9},{"w":"komi","c":9},{"w":"intersection","c":9},{"w":"positions","c":9},{"w":"kyu","c":9},{"w":"marked","c":9},{"w":"computer","c":9},{"w":"korean","c":8},{"w":"adjacent","c":8},{"w":"complex","c":8},{"w":"situations","c":8},{"w":"seki","c":8},{"w":"popular","c":8},{"w":"situation","c":8},{"w":"threat","c":8},{"w":"period","c":8},{"w":"bowls","c":8},{"w":"programs","c":8},{"w":"spread","c":7},{"w":"removed","c":7},{"w":"opposing","c":7},{"w":"living","c":7},{"w":"death","c":7},{"w":"lost","c":7},{"w":"corners","c":7},{"w":"lose","c":7},{"w":"rank","c":7},{"w":"difference","c":7},{"w":"win","c":7},{"w":"empty","c":7},{"w":"pattern","c":7},{"w":"ranks","c":7},{"w":"tournaments","c":7},{"w":"baduk","c":6},{"w":"beginners","c":6},{"w":"compensation","c":6},{"w":"countries","c":6},{"w":"establish","c":6},{"w":"sets","c":6},{"w":"placing","c":6},{"w":"color","c":6},{"w":"allowing","c":6},{"w":"advantage","c":6},{"w":"strategic","c":6},{"w":"plays","c":6},{"w":"book","c":6},{"w":"best","c":6},{"w":"grades","c":6},{"w":"tournament","c":6},{"w":"typically","c":5},{"w":"simply","c":5},{"w":"areas","c":5},{"w":"east","c":5},{"w":"asia","c":5},{"w":"greater","c":5},{"w":"strength","c":5},{"w":"special","c":5},{"w":"theory","c":5},{"w":"takes","c":5},{"w":"connected","c":5},{"w":"turn","c":5},{"w":"share","c":5},{"w":"circle","c":5},{"w":"avoid","c":5},{"w":"net","c":5},{"w":"understanding","c":5},{"w":"connect","c":5},{"w":"diagram","c":5},{"w":"mutual","c":5},{"w":"ahead","c":5},{"w":"nihon","c":5},{"w":"seigen","c":5},{"w":"asian","c":5},{"w":"equipment","c":5},{"w":"convex","c":5},{"w":"yunzi","c":5},{"w":"periods","c":5},{"w":"arts","c":4},{"w":"directly","c":4},{"w":"moved","c":4},{"w":"won","c":4},{"w":"federation","c":4},{"w":"formations","c":4},{"w":"attack","c":4},{"w":"status","c":4},{"w":"better","c":4},{"w":"pass","c":4},{"w":"start","c":4},{"w":"corner","c":4},{"w":"joseki","c":4},{"w":"fights","c":4},{"w":"knowledge","c":4},{"w":"compensate","c":4},{"w":"combinatorial","c":4},{"w":"trees","c":4},{"w":"previous","c":4},{"w":"tactics","c":4},{"w":"commonly","c":4},{"w":"names","c":4},{"w":"chains","c":4},{"w":"repetition","c":4},{"w":"fight","c":4},{"w":"suicide","c":4},{"w":"receive","c":4},{"w":"surround","c":4},{"w":"prisoners","c":4},{"w":"practice","c":4},{"w":"friendly","c":4},{"w":"kill","c":4},{"w":"lower","c":4},{"w":"tactical","c":4},{"w":"technique","c":4},{"w":"atari","c":4},{"w":"reading","c":4},{"w":"respond","c":4},{"w":"edge","c":4},{"w":"books","c":4},{"w":"weiqi","c":4},{"w":"honinbo","c":4},{"w":"founded","c":4},{"w":"lasker","c":4},{"w":"goban","c":4},{"w":"rating","c":4},{"w":"master","c":4},{"w":"amateur","c":4},{"w":"matches","c":4},{"w":"kitani","c":4},{"w":"cho","c":4},{"w":"wood","c":4},{"w":"expensive","c":4},{"w":"slate","c":4},{"w":"tree","c":4},{"w":"floor","c":4},{"w":"shin","c":4},{"w":"bowl","c":4},{"w":"byoyomi","c":4},{"w":"thirty","c":4},{"w":"seconds","c":4},{"w":"html","c":4},{"w":"calculate","c":4},{"w":"interactive","c":4},{"w":"business","c":4},{"w":"meaning","c":3},{"w":"written","c":3},{"w":"pieces","c":3},{"w":"vacant","c":3},{"w":"intersections","c":3},{"w":"centuries","c":3},{"w":"reach","c":3},{"w":"winner","c":3},{"w":"resignation","c":3},{"w":"territories","c":3},{"w":"contested","c":3},{"w":"battles","c":3},{"w":"loss","c":3},{"w":"separate","c":3},{"w":"stay","c":3},{"w":"scored","c":3},{"w":"sides","c":3},{"w":"options","c":3},{"w":"prevents","c":3},{"w":"edges","c":3},{"w":"sequences","c":3},{"w":"forcing","c":3},{"w":"aga","c":3},{"w":"chance","c":3},{"w":"perfect","c":3},{"w":"outcome","c":3},{"w":"sequence","c":3},{"w":"theoretically","c":3},{"w":"tie","c":3},{"w":"format","c":3},{"w":"utility","c":3},{"w":"aspects","c":3},{"w":"learned","c":3},{"w":"cover","c":3},{"w":"notably","c":3},{"w":"piece","c":3},{"w":"skill","c":3},{"w":"captures","c":3},{"w":"specific","c":3},{"w":"deal","c":3},{"w":"ways","c":3},{"w":"space","c":3},{"w":"dynasty","c":3},{"w":"circled","c":3},{"w":"invade","c":3},{"w":"fighting","c":3},{"w":"issues","c":3},{"w":"forward","c":3},{"w":"series","c":3},{"w":"threats","c":3},{"w":"breaker","c":3},{"w":"third","c":3},{"w":"read","c":3},{"w":"problems","c":3},{"w":"applies","c":3},{"w":"cost","c":3},{"w":"consider","c":3},{"w":"keeping","c":3},{"w":"learning","c":3},{"w":"concepts","c":3},{"w":"fewer","c":3},{"w":"easier","c":3},{"w":"middle","c":3},{"w":"middlegame","c":3},{"w":"endgame","c":3},{"w":"history","c":3},{"w":"recognized","c":3},{"w":"historical","c":3},{"w":"tokugawa","c":3},{"w":"named","c":3},{"w":"schools","c":3},{"w":"style","c":3},{"w":"literature","c":3},{"w":"german","c":3},{"w":"south","c":3},{"w":"weaker","c":3},{"w":"strategies","c":3},{"w":"traditionally","c":3},{"w":"abbreviated","c":3},{"w":"highest","c":3},{"w":"match","c":3},{"w":"half","c":3},{"w":"houses","c":3},{"w":"note","c":3},{"w":"three","c":3},{"w":"dominated","c":3},{"w":"glass","c":3},{"w":"carved","c":3},{"w":"torreya","c":3},{"w":"reduced","c":3},{"w":"easily","c":3},{"w":"coordinate","c":3},{"w":"program","c":3},{"w":"exhaustively","c":3},{"w":"combinations","c":3},{"w":"records","c":3},{"w":"user","c":3},{"w":"servers","c":3},{"w":"graphical","c":3},{"w":"backgammon","c":3},{"w":"simplified","c":2},{"w":"pinyin","c":2},{"w":"igo","c":2},{"w":"ancient","c":2},{"w":"essential","c":2},{"w":"earliest","c":2},{"w":"dates","c":2},{"w":"analects","c":2},{"w":"vast","c":2},{"w":"despite","c":2},{"w":"alternately","c":2},{"w":"objective","c":2},{"w":"implies","c":2},{"w":"surrounding","c":2},{"w":"worldwide","c":2},{"w":"member","c":2},{"w":"map","c":2},{"w":"reduction","c":2},{"w":"enclosed","c":2},{"w":"unconditionally","c":2},{"w":"poor","c":2},{"w":"killed","c":2},{"w":"races","c":2},{"w":"ends","c":2},{"w":"wins","c":2},{"w":"bases","c":2},{"w":"help","c":2},{"w":"develop","c":2},{"w":"shapes","c":2},{"w":"viability","c":2},{"w":"aid","c":2},{"w":"viewing","c":2},{"w":"requires","c":2},{"w":"handicaps","c":2},{"w":"equivalent","c":2},{"w":"formal","c":2},{"w":"dice","c":2},{"w":"decisions","c":2},{"w":"visible","c":2},{"w":"theoretical","c":2},{"w":"elements","c":2},{"w":"sum","c":2},{"w":"choices","c":2},{"w":"resources","c":2},{"w":"rewards","c":2},{"w":"ratings","c":2},{"w":"scope","c":2},{"w":"minor","c":2},{"w":"greatly","c":2},{"w":"explained","c":2},{"w":"turns","c":2},{"w":"unending","c":2},{"w":"recreate","c":2},{"w":"cycle","c":2},{"w":"exchanges","c":2},{"w":"enemy","c":2},{"w":"leaving","c":2},{"w":"zealand","c":2},{"w":"break","c":2},{"w":"counts","c":2},{"w":"passed","c":2},{"w":"consecutively","c":2},{"w":"unable","c":2},{"w":"course","c":2},{"w":"matter","c":2},{"w":"return","c":2},{"w":"numbers","c":2},{"w":"rarely","c":2},{"w":"differs","c":2},{"w":"practical","c":2},{"w":"unsettled","c":2},{"w":"exist","c":2},{"w":"fills","c":2},{"w":"upper","c":2},{"w":"opposed","c":2},{"w":"simplest","c":2},{"w":"shared","c":2},{"w":"attempt","c":2},{"w":"saving","c":2},{"w":"covered","c":2},{"w":"recognizing","c":2},{"w":"experienced","c":2},{"w":"futility","c":2},{"w":"option","c":2},{"w":"powerful","c":2},{"w":"snapback","c":2},{"w":"responses","c":2},{"w":"strongest","c":2},{"w":"tsumego","c":2},{"w":"vital","c":2},{"w":"challenge","c":2},{"w":"prohibited","c":2},{"w":"responding","c":2},{"w":"ignore","c":2},{"w":"gained","c":2},{"w":"frequently","c":2},{"w":"global","c":2},{"w":"distant","c":2},{"w":"mind","c":2},{"w":"defend","c":2},{"w":"cut","c":2},{"w":"putting","c":2},{"w":"eventually","c":2},{"w":"reduces","c":2},{"w":"opponents","c":2},{"w":"proportion","c":2},{"w":"sente","c":2}],"meta":{"abstract":"Go (simplified Chinese: 围棋; traditional Chinese: 圍棋; pinyin: wéiqí, Japanese: 囲碁 igo, literal meaning: \"encircling game\", Korean: 바둑 baduk) is a board game involving two players that originated in ancient China more than 2,500 years ago. It was considered one of the four essential arts of a cultured Chinese scholar in antiquity. Its earliest written reference dates back to the Confucian Analects. There is significant strategy involved in the game, and the number of possible games is vast (10761 compared, for example, to the 10120 possible in chess), despite its relatively simple rules. The two players alternately place black and white playing pieces, called \"stones\", on the vacant intersections (\"points\") of a board with a 19x19 grid of lines. Beginners often play on smaller 9×9 and 13×13 boards, and archaeological evidence shows that game was played in earlier centuries on a board with a 17×17 grid. By the time the game had spread to Korea and Japan in about the 5th and 7th centuries CE respectively, however, boards with a 19×19 grid had become standard. The objective of the game—as the translation of its name implies—is to have surrounded a larger total area of the board with one's stones than the opponent by the end of the game, although this result typically involves many more intricacies than simply using surrounding areas directly. Once placed on the board, stones may not be moved, but stones may be removed from the board if captured—this is done by surrounding an opposing stone or group of stones by occupying all orthogonally-adjacent points. The two players place stones alternately until they reach a point at which neither player wishes to make another move; the game has no set ending conditions beyond this. When a game concludes, the territory is counted along with captured stones and komi (points added to the score of the player with the white stones as compensation for playing second) to determine the winner. Games may also be won by resignation. As of mid-2008, there were well over 40 million Go players worldwide, the overwhelming majority of them living in East Asia. As of May 2012, the International Go Federation has a total of 74 member countries and four Association Members covering multiple countries. Overview Go is an adversarial game with the objective of having surrounded a larger total area of the board with one's stones than the opponent. As the game progresses, the players place stones which map out formations and potential territories. Areas are contested in battles between opposing stones, which are often complex and may result in the expansion, reduction, or wholesale capture and loss of the contested area. A basic principle of Go is that stones must have at least one \"liberty\" (Chinese: 氣) to remain on the board. A \"liberty\" is an open \"point\" (intersection) next to a stone. An enclosed liberty (or liberties) is called an \"eye\" (眼), and a group of stones with at least two separate eyes is said to be unconditionally \"alive\". Such","date":"2015-04-13T22:45:02Z","url":"http://en.wikipedia.org/wiki/Go%20%28game%29"}}}
,{"_index":"test","_type":"document","_id":"55f3e5ac00576034f979fe51","_score":0,"_source":{"_id":"55f3e5ac00576034f979fe51","corpus":"Reference","external_id":"Permutation","source_type":"wikipedia","title":"Permutation","words":"In mathematics, the notion of permutation relates to the act of rearranging, or permuting, all the members of a set into some sequence or order (unlike combinations, which are selections of some members of the set where order is disregarded). For example, written as tuples, there are six permutations of the set {1,2,3}, namely: (1,2,3), (1,3,2), (2,1,3), (2,3,1), (3,1,2), and (3,2,1). As another example, an anagram of a word, all of whose letters are different, is a permutation of its letters. The study of permutations of finite sets is a topic in the field of combinatorics. Permutations occur, in more or less prominent ways, in almost every area of mathematics. They often arise when different orderings on certain finite sets are considered, possibly only because one wants to ignore such orderings and needs to know how many configurations are thus identified. For similar reasons permutations arise in the study of sorting algorithms in computer science. The number of permutations of n distinct objects is n factorial usually written as n!, which means the product of all positive integers less than or equal to n. In algebra and particularly in group theory, a permutation of a set S is defined as a bijection from S to itself. That is, it is a function from S to S for which every element occurs exactly once as an image value. This is related to the rearrangement of the elements of S in which each element s is replaced by the corresponding f(s). The collection of such permutations form a group called the symmetric group of S. The key to this group's structure is the fact that the composition of two permutations (performing two given rearrangements in succession) results in another rearrangement. Permutations may act on structured objects by rearranging their components, or by certain replacements (substitutions) of symbols. In elementary combinatorics, the k-permutations, or partial permutations, are the ordered arrangements of k distinct elements selected from a set. When k is equal to the size of the set, these are the permutations of the set. History The rule to determine the number of permutations of n objects was known in Indian culture at least as early as around 1150: the Lilavati by the Indian mathematician Bhaskara II contains a passage that translates to The product of multiplication of the arithmetical series beginning and increasing by unity and continued to the number of places, will be the variations of number with specific figures. Fabian Stedman in 1677 described factorials when explaining the number of permutations of bells in change ringing. Starting from two bells: \"first, two must be admitted to be varied in two ways\" which he illustrates by showing 1 2 and 2 1. He then explains that with three bells there are \"three times two figures to be produced out of three\" which again is illustrated. His explanation involves \"cast away 3, and 1.2 will remain; cast away 2, and 1.3 will remain; cast away 1, and 2.3 will remain\". He then moves on to four bells and repeats the casting away argument showing that there will be four different sets of three. Effectively this is an recursive process. He continues with five bells using the \"casting away\" method and tabulates the resulting 120 combinations. At this point he gives up and remarks: Now the nature of these methods is such, that the changes on one number comprehends the changes on all lesser numbers, ... insomuch that a compleat Peal of changes on one number seemeth to be formed by uniting of the compleat Peals on all lesser numbers into one entire body; Stedman widens the consideration of permutations; he goes on to consider the number of permutations of the letters of the alphabet and horses from a stable of 20. A first case in which seemingly unrelated mathematical questions were studied with the help of permutations occurred around 1770, when Joseph Louis Lagrange, in the study of polynomial equations, observed that properties of the permutations of the roots of an equation are related to the possibilities to solve it. This line of work ultimately resulted, through the work of Évariste Galois, in Galois theory, which gives a complete description of what is possible and impossible with respect to solving polynomial equations (in one unknown) by radicals. In modern mathematics there are many similar situations in which understanding a problem requires studying certain permutations related to it. Definition and one-line notation There are two equivalent common ways of regarding permutations, sometimes called the \"active\" and \"passive\" forms, or in older terminology \"substitutions\" and \"permutations\". Which form is preferable depends on the type of questions being asked in a given discipline. The \"active\" way to regard permutations of a set S (finite or infinite) is to define them as the bijections from S to itself. Thus, the permutations are thought of as functions which can be composed with each other, forming groups of permutations. From this viewpoint, the elements of S have no internal structure and are just labels for the objects being moved: one may refer to permutations of any set of n elements as \"permutations on n letters\". In Cauchy's two-line notation, one lists the elements of S in the first row, and for each one its image below it in the second row. For instance, a particular permutation of the set S = {1,2,3,4,5} can be written as: this means that σ satisfies σ(1)=2, σ(2)=5, σ(3)=4, σ(4)=3, and σ(5)=1. The elements of S may appear in any order in the first row. This permutation could also be written as: The \"passive\" way to regard a permutation of the set S is an ordered arrangement (or listing, or linearly ordered arrangement, or sequence without repetition) of the elements of S. This is related to the active form as follows. If there is a \"natural\" order for the elements of S, say , then one uses this for the first row of the two-line notation: Under this assumption, one may omit the first row and write the permutation in one-line notation as , that is, an ordered arrangement of S. Care must be taken to distinguish one-line notation from the cycle notation described later. In mathematics literature, a common usage is to omit parentheses for one-line notation, while using them for cycle notation. The one-line notation is also called the word representation of a permutation. The example above would then be 2 5 4 3 1 since the natural order 1 2 3 4 5 would be assumed for the first row. (It is typical to use commas to separate these entries only if some have two or more digits.) This form is more compact, and is common in elementary combinatorics and computer science. It is especially useful in applications where the elements of S or the permutations are to be compared as larger or smaller. There are n! permutations of a finite set S having n elements. Other uses of the term permutation The concept of a permutation as an ordered arrangement admits several generalizations that are not permutations but have been called permutations in the literature. k-permutations of n A weaker meaning of the term \"permutation\", sometimes used in elementary combinatorics texts, designates those ordered arrangements in which no element occurs more than once, but without the requirement of using all the elements from a given set. These are not permutations except in special cases, but are natural generalizations of the ordered arrangement concept. Indeed, this use often involves considering arrangements of a fixed length k of elements taken from a given set of size n, in other words, these k-permutations of n are the different ordered arrangements of a k-element subset of an n-set (sometimes called variations in the older literature.) These objects are also known as partial permutations or as sequences without repetition, terms that avoid confusion with the other, more common, meaning of \"permutation\". The number of such -permutations of is denoted variously by such symbols as , , , , or , and its value is given by the product , which is 0 when k > n, and otherwise is equal to The product is well defined without the assumption that is a non-negative integer and is of importance outside combinatorics as well; it is known as the Pochhammer symbol or as the -th falling factorial power of . This usage of the term \"permutation\" is closely related to the term \"combination\". A k-element combination of an n-set S is a k element subset of S, the elements of which are not ordered. By taking all the k element subsets of S and ordering each of them in all possible ways we obtain all the k-permutations of S. The number of k-combinations of an n-set, C(n,k), is therefore related to the number of k-permutations of n by: These numbers are also known as binomial coefficients and denoted . Permutations with repetition Ordered arrangements of the elements of a set S of length n where repetition is allowed are called n-tuples, but have sometimes been referred to as permutations with repetition although they are not permutations in general. They are also called words over the alphabet S in some contexts. If the set S has k elements, the number of n-tuples over S is: There is no restriction on how often an element can appear in an n-tuple, but if restrictions are placed on how often an element can appear, this formula is no longer valid. Permutations of multisets If M is a finite multiset, then a multiset permutation is an ordered arrangement of elements of M in which each element appears exactly as often as is its multiplicity in M. An anagram of a word having some repeated letters is an example of a multiset permutation. If the multiplicities of the elements of M (taken in some order) are , , ..., and their sum (i.e., the size of M) is n, then the number of multiset permutations of M is given by the multinomial coefficient, For example, the number of distinct anagrams of the word MISSISSIPPI is: . A k-permutation of a multiset M is a sequence of length k of elements of M in which each element appears at most its multiplicity in M times (an element's repetition number). Circular permutations Permutations, when considered as arrangements, are sometimes referred to as linearly ordered arrangements. In these arrangements there is a first element, a second element, and so on. If, however, the objects are arranged in a circular manner this distinguished ordering no longer exists, that is, there is no \"first element\" in the arrangement, any element can be considered as the start of the arrangement. The arrangements of objects in a circular manner are called circular permutations. These can be formally defined as equivalence classes of ordinary permutations of the objects, for the equivalence relation generated by moving the final element of the linear arrangement to its front. Two circular permutations are equivalent if one can be rotated into the other (that is, cycled without changing the relative positions of the elements). The following two circular permutations on four letters are considered to be the same. 1 4 4 3 2 1 2 3 The circular arrangements are to be read counterclockwise, so the following two are not equivalent since no rotation can bring one to the other. 1 1 4 3 3 4 2 2 The number of circular permutations of a set S with n elements is (n - 1)!. Permutations in group theory The set of all permutations of any given set S forms a group, with the composition of maps as the product operation and the identity function as the neutral element of the group. This is the symmetric group of S, denoted by Sym(S). Up to isomorphism, this symmetric group only depends on the cardinality of the set (called the degree of the group), so the nature of elements of S is irrelevant for the structure of the group. Symmetric groups have been studied mostly in the case of finite sets, so, confined to this case, one can assume without loss of generality that S = {1,2,...,n} for some natural number n. This is then the symmetric group of degree n, usually written as Sn. Any subgroup of a symmetric group is called a permutation group. By Cayley's theorem any group is isomorphic to some permutation group, and every finite group to a subgroup of some finite symmetric group. Cycle notation This alternative notation describes the effect of repeatedly applying the permutation, thought of as a function from a set onto itself. It expresses the permutation as a product of cycles corresponding to the orbits of the permutation; since distinct orbits are disjoint, this is referred to as \"decomposition into disjoint cycles\". Starting from some element x of S, one writes the sequence (x σ(x) σ(σ(x)) ...) of successive images under σ, until the image returns to x, at which point one closes the parenthesis rather than repeat x. The set of values written down forms the orbit (under σ) of x, and the parenthesized expression gives the corresponding cycle of σ. One then continues by choosing a new element y of S outside the previous orbit and writing down the cycle starting at y; and so on until all elements of S are written in cycles. Since for every new cycle the starting point can be chosen in different ways, there are in general many different cycle notations for the same permutation; for the example above one has: A cycle (x) of length 1 occurs when σ(x) = x, and is commonly omitted from the cycle notation, provided the set S is clear: for any element x ∈ S not appearing in a cycle, one implicitly assumes σ(x) = x. The identity permutation, which consists only of 1-cycles, can be denoted by a single 1-cycle (x), by the number 1, or by id. A cycle (x1 x2 ... xk) of length k is called a k-cycle. Written by itself, it denotes a permutation in its own right, which maps xi to xi+1 for i < k, and xk to x1, while implicitly mapping all other elements of S to themselves (omitted 1-cycles). Therefore the individual cycles in the cycle notation can be interpreted as factors in a composition product. Since the orbits are disjoint, the corresponding cycles commute under composition, and so can be written in any order. The cycle decomposition is essentially unique: apart from the reordering the cycles in the product, there are no other ways to write σ as a product of cycles. Each individual cycle can be written in different ways, as in the example above where (5 1 2) and (1 2 5) and (2 5 1) all denote the same cycle, though note that (5 2 1) denotes a different cycle. An element in a 1-cycle (x), corresponding to σ(x) = x, is called a fixed point of the permutation σ. A permutation with no fixed points is called a derangement. Cycles of length two are called transpositions; such permutations merely exchange the place of two elements, implicitly leaving the others fixed. Since the orbits of a permutation partition the set S, for a finite set of size n, the lengths of the cycles of a permutation σ form a partition of n called the cycle type of σ. There is a \"1\" in the cycle type for every fixed point of σ, a \"2\" for every transposition, and so on. The cycle type of β = (1 2 5)(3 4)(6 8)(7), is (3,2,2,1) which is sometimes written in a more compact form as (11,22,31). The number of n-permutations with k disjoint cycles is the signless Stirling number of the first kind, denoted by . Abstract groups vs. permutations vs. group actions Permutation groups have more structure than abstract groups, and different realizations of a group as a permutation group need not be equivalent as permutations. For instance S3 is naturally a permutation group, in which any transposition has cycle type (2,1); but the proof of Cayley's theorem realizes S3 as a subgroup of S6 (namely the permutations of the 6 elements of S3 itself), in which permutation group transpositions have cycle type (2,2,2). Finding the minimal-order symmetric group containing a subgroup isomorphic to a given group (sometimes called minimal faithful degree representation) is a rather difficult problem. So in spite of Cayley's theorem, the study of permutation groups differs from the study of abstract groups, being a branch of representation theory. Much of the power of permutations can be regained in an abstract setting by considering group actions instead. A group action actually permutes the elements of a set according to the recipe provided by the abstract group. For example, S3 acts faithfully and transitively (by permuting) a set with exactly three elements. Product and inverse The product of two permutations is defined as their composition as functions, in other words σ·π is the function that maps any element x of the set to σ(π(x)). Note that the rightmost permutation is applied to the argument first, because of the way function application is written. Some authors prefer the leftmost factor acting first, but to that end permutations must be written to the right of their argument, for instance as an exponent, where σ acting on x is written xσ; then the product is defined by xσ·π = (xσ)π. However this gives a different rule for multiplying permutations; this article uses the definition where the rightmost permutation is applied first. Since the composition of two bijections always gives another bijection, the product of two permutations is again a permutation. In two-line notation, the product of two permutations is obtained by rearranging the columns of the second (leftmost) permutation so that its first row is identical with the second row of the first (rightmost) permutation. The product can then be written as the first row of the first permutation over the second row of the modified second permutation. For example, given the permutations, the product QP is: In cyclic notation this same product would be given by: Since function composition is associative, so is the product operation on permutations: (σ·π)·ρ = σ·(π·ρ). Therefore, products of more than two permutations are usually written without adding parentheses to express grouping; they are also usually written without a dot or other sign to indicate multiplication. The identity permutation, which maps every element of the set to itself, is the neutral element for this product. In two-line notation, the identity is Since bijections have inverses, so do permutations, and the inverse σ−1 of σ is again a permutation. Explicitly, whenever σ(x)=y one also has σ−1(y)=x. In two-line notation the inverse can be obtained by interchanging the two lines (and sorting the columns if one wishes the first line to be in a given order). For instance In cycle notation one can reverse the order of the elements in each cycle to obtain a cycle notation for its inverse. Thus, Having an associative product, a neutral element, and inverses for all its elements, makes the set of all permutations of S into a group, called the symmetric group of S. Properties Every permutation of a finite set can be expressed as the product of transpositions. Moreover, although many such expressions for a given permutation may exist, there can never be among them both expressions with an even number and expressions with an odd number of transpositions. All permutations are then classified as even or odd, according to the parity of the transpositions in any such expression. Multiplying permutations written in cycle notation follows no easily described pattern, and the cycles of the product can be entirely different from those of the permutations being composed. However the cycle structure is preserved in the special case of conjugating a permutation σ by another permutation π, which means forming the product π·σ·π−1. Here the cycle notation of the result can be obtained by taking the cycle notation for σ and applying π to all the entries in it. Matrix representation One can represent a permutation of {1, 2, ..., n} as an n×n matrix. There are two natural ways to do so, but only one for which multiplications of matrices corresponds to multiplication of permutations in the same order: this is the one that associates to σ the matrix M whose entry Mi,j is 1 if i = σ(j), and 0 otherwise. The resulting matrix has exactly one entry 1 in each column and in each row, and is called a permutation matrix.Here (file) is a list of these matrices for permutations of 4 elements. The Cayley table on the right shows these matrices for permutations of 3 elements. Permutation of components of a sequence As with any group, one can consider actions of a symmetric group on a set, and there are many ways in which such an action can be defined. For the symmetric group of {1, 2, ..., n} there is one particularly natural action, namely the action by permutation on the set Xn of sequences of n symbols taken from some set X. As with the matrix representation, there are two natural ways in which the result of permuting a sequence (x1,x2,...,xn) by σ can be defined, but only one is compatible with the multiplication of permutations (so as to give a left action of the symmetric group on Xn); with the multiplication rule used in this article this is the one given by This means that each component xi ends up at position σ(i) in the sequence permuted by σ. Permutations of totally ordered sets In some applications, the elements of the set being permuted will be compared with each other. This requires that the set S has a total order so that any two elements can be compared. The set {1, 2, ..., n} is totally ordered by the usual \"≤\" relation and so it is the most frequently used set in these applications, but in general, any totally ordered set will do. In these applications, the ordered arrangement view of a permutation is needed to talk about the positions in a permutation. Here are a number of properties that are directly related to the total ordering of S. Ascents, descents, runs and excedances An ascent of a permutation σ of n is any position i < n where the following value is bigger than the current one. That is, if σ = σ1σ2...σn, then i is an ascent if σi < σi+1. For example, the permutation 3452167 has ascents (at positions) 1,2,5,6. Similarly, a descent is a position i < n with σi > σi+1, so every i with either is an ascent or is a descent of σ. An ascending run of a permutation is a nonempty increasing contiguous subsequence of the permutation that cannot be extended at either end; it corresponds to a maximal sequence of successive ascents (the latter may be empty: between two successive descents there is still an ascending run of length 1). By contrast an increasing subsequence of a permutation is not necessarily contiguous: it is an increasing sequence of elements obtained from the permutation by omitting the values at some positions. For example, the permutation 2453167 has the ascending runs 245, 3, and 167, while it has an increasing subsequence 2367. If a permutation has k − 1 descents, then it must be the union of k ascending runs. The number of permutations of n with k ascents is (by definition) the Eulerian number ; this is also the number of permutations of n with k descents. Some authors however define the Eulerian number as the number of permutations with k ascending runs, which corresponds to k-1 descents. An excedance of a permutation σ1σ2...σn in an index j such that σj > j. If the inequality is not strict, i.e. σj ≥ j, then j is called a weak excedance. The number of n-permutations with k excedances coincides with the number of n-permutations with k descents. Canonical cycle notation (aka standard form) In some combinatorial contexts it useful to fix a certain order or the elements in the cycles and of the (disjoint) cycles themselves. Miklós Bóna calls the following ordering choices the canonical cycle notation: in each cycle the largest element is listed first the cycles are sorted in increasing order of their first element For example, (312)(54)(8)(976) is a permutation in canonical cycle notation. Note that the canonical cycle notation does not omit one-cycles. Richard P. Stanley calls the same choice of representation the \"standard representation\" of a permutation. and Martin Aigner uses the term \"standard form\" for the same notion. Sergey Kitaev also uses the \"standard form\" terminology, but reverses both choices, i.e. each cycle lists its least element first and the cycles are sorted in decreasing order of their least/first elements. In the remainder of this article, we use the first of these dual forms as the standard/canonical one. Foata's transition lemma (or the fundamental bijection) A natural question arises as to the relationship of the one-line and the canonical cycle notation. For example, considering the permutation (2)(31), which is in canonical cycle notation, if we erase its cycle parentheses, we obtain a different permutation in one-line notation, namely 231. (The permutation (2)(31) is actually 321 in one-line notation.) Foata's transition lemma establishes the nature of this correspondence as a bijection on the set of n-permutations (to itself). Richard P. Stanley calls this correspondence the fundamental bijection. Let be the parentheses-erasing transformation. The inverse of is a bit less intuitive. Starting with the one-line notation , the first cycle in canonical cycle notation must start with . As long as the subsequent elements are smaller than , we are in the same cycle. The second cycle starts at the smallest index such that . In other words, is larger than everything else to its left, so it is called a left-to-right maximum. Every cycle in the canonical cycle notation starts with a left-to-right maximum. For example, in the one-line notation 312548976, 5 is the first element larger than 3, so the first cycle must be (312). Then 8 is the next element larger than 5, so the second cycle is (54). Since 9 is larger than 8, (8) is a cycle by itself. Finally, 9 is larger than all the remaining elements to its right, so the last cycle is (976). As a first corollary, the number of n-permutations with exactly k left-to-right maxima is also equal to the signless Stirling number of the first kind, . Furthermore, Foata's mapping takes an n-permutation with k-weak excedances to an n-permutations with k − 1 ascents. For example, (2)(31) = 321 has two weak excedances (at index 1 and 2), whereas f(321)=231 has one ascent (at index 1, i.e. from 2 to 3). Inversions An inversion of a permutation σ is a pair (i,j) of positions where the entries of a permutation are in the opposite order: and . So a descent is just an inversion at two adjacent positions. For example, the permutation σ = 23154 has three inversions: (1,3), (2,3), (4,5), for the pairs of entries (2,1), (3,1), (5,4). Sometimes an inversion is defined as the pair of values (σi,σj) itself whose order is reversed; this makes no difference for the number of inversions, and this pair (reversed) is also an inversion in the above sense for the inverse permutation σ−1. The number of inversions is an important measure for the degree to which the entries of a permutation are out of order; it is the same for σ and for σ−1. To bring a permutation with k inversions into order (i.e., transform it into the identity permutation), by successively applying (right-multiplication by) adjacent transpositions, is always possible and requires a sequence of k such operations. Moreover any reasonable choice for the adjacent transpositions will work: it suffices to choose at each step a transposition of i and i + 1 where i is a descent of the permutation as modified so far (so that the transposition will remove this particular descent, although it might create other descents). This is so because applying such a transposition reduces the number of inversions by 1; also note that as long as this number is not zero, the permutation is not the identity, so it has at least one descent. Bubble sort and insertion sort can be interpreted as particular instances of this procedure to put a sequence into order. Incidentally this procedure proves that any permutation σ can be written as a product of adjacent transpositions; for this one may simply reverse any sequence of such transpositions that transforms σ into the identity. In fact, by enumerating all sequences of adjacent transpositions that would transform σ into the identity, one obtains (after reversal) a complete list of all expressions of minimal length writing σ as a product of adjacent transpositions. The number of permutations of n with k inversions is expressed by a Mahonian number, it is the coefficient of Xk in the expansion of the product which is also known (with q substituted for X) as the q-factorial [n]q! . The expansion of the product appears in Necklace (combinatorics). Permutations in computing Numbering permutations One way to represent permutations of n is by an integer N with 0 ≤ N < n!, provided convenient methods are given to convert between the number and the representation of a permutation as an ordered arrangement (sequence). This gives the most compact representation of arbitrary permutations, and in computing is particularly attractive when n is small enough that N can be held in a machine word; for 32-bit words this means n ≤ 12, and for 64-bit words this means n ≤ 20. The conversion can be done via the intermediate form of a sequence of numbers dn, dn−1, ..., d2, d1, where di is a non-negative integer less than i (one may omit d1, as it is always 0, but its presence makes the subsequent conversion to a permutation easier to describe). The first step then is to simply express N in the factorial number system, which is just a particular mixed radix representation, where for numbers up to n! the bases for successive digits are n, n − 1, ..., 2, 1. The second step interprets this sequence as a Lehmer code or (almost equivalently) as an inversion table. In the Lehmer code for a permutation σ, the number dn represents the choice made for the first term σ1, the number dn−1 represents the choice made for the second term σ2 among the remaining n − 1 elements of the set, and so forth. More precisely, each dn+1−i gives the number of remaining elements strictly less than the term σi. Since those remaining elements are bound to turn up as some later term σj, the digit dn+1−i counts the inversions (i,j) involving i as smaller index (the number of values j for which i < j and σi > σj). The inversion table for σ is quite similar, but here dn+1−k counts the number of inversions (i,j) where k = σj occurs as the smaller of the two values appearing in inverted order. Both encodings can be visualized by an n by n Rothe diagram (named after Heinrich August Rothe) in which dots at (i,σi) mark the entries of the permutation, and a cross at (i,σj) marks the inversion (i,j); by the definition of inversions a cross appears in any square that comes both before the dot (j,σj) in its column, and before the dot (i,σi) in its row. The Lehmer code lists the numbers of crosses in successive rows, while the inversion table lists the numbers of crosses in successive columns; it is just the Lehmer code for the inverse permutation, and vice versa. To effectively convert a Lehmer code dn, dn−1, ..., d2, d1 into a permutation of an ordered set S, one can start with a list of the elements of S in increasing order, and for i increasing from 1 to n set σi to the element in the list that is preceded by dn+1−i other ones, and remove that element from the list. To convert an inversion table dn, dn−1, ..., d2, d1 into the corresponding permutation, one can traverse the numbers from d1 to dn while inserting the elements of S from largest to smallest into an initially empty sequence; at the step using the number d from the inversion table, the element from S inserted into the sequence at the point where it is preceded by d elements already present. Alternatively one could process the numbers from the inversion table and the elements of S both in the opposite order, starting with a row of n empty slots, and at each step place the element from S into the empty slot that is preceded by d other empty slots. Converting successive natural numbers to the factorial number system produces those sequences in lexicographic order (as is the case with any mixed radix number system), and further converting them to permutations preserves the lexicographic ordering, provided the Lehmer code interpretation is used (using inversion tables, one gets a different ordering, where one starts by comparing permutations by the place of their entries 1 rather than by the value of their first entries). The sum of the numbers in the factorial number system representation gives the number of inversions of the permutation, and the parity of that sum gives the signature of the permutation. Moreover the positions of the zeroes in the inversion table give the values of left-to-right maxima of the permutation (in the example 6, 8, 9) while the positions of the zeroes in the Lehmer code are the positions of the right-to-left minima (in the example positions the 4, 8, 9 of the values 1, 2, 5); this allows computing the distribution of such extrema among all permutations. A permutation with Lehmer code dn, dn−1, ..., d2, d1 has an ascent n − i if and only if di ≥ di+1. Algorithms to generate permutations In computing it may be required to generate permutations of a given sequence of values. The methods best adapted to do this depend on whether one wants some randomly chosen permutations, or all permutations, and in the latter case if a specific ordering is required. Another question is whether possible equality among entries in the given sequence is to be taken into account; if so, one should only generate distinct multiset permutations of the sequence. An obvious way to generate permutations of n is to generate values for the Lehmer code (possibly using the factorial number system representation of integers up to n!), and convert those into the corresponding permutations. However, the latter step, while straightforward, is hard to implement efficiently, because it requires n operations each of selection from a sequence and deletion from it, at an arbitrary position; of the obvious representations of the sequence as an array or a linked list, both require (for different reasons) about n2/4 operations to perform the conversion. With n likely to be rather small (especially if generation of all permutations is needed) that is not too much of a problem, but it turns out that both for random and for systematic generation there are simple alternatives that do considerably better. For this reason it does not seem useful, although certainly possible, to employ a special data structure that would allow performing the conversion from Lehmer code to permutation in O(n log n) time. Random generation of permutations For generating random permutations of a given sequence of n values, it makes no difference whether one applies a randomly selected permutation of n to the sequence, or chooses a random element from the set of distinct (multiset) permutations of the sequence. This is because, even though in case of repeated values there can be many distinct permutations of n that result in the same permuted sequence, the number of such permutations is the same for each possible result. Unlike for systematic generation, which becomes unfeasible for large n due to the growth of the number n!, there is no reason to assume that n will be small for random generation. The basic idea to generate a random permutation is to generate at random one of the n! sequences of integers d1,d2,...,dn satisfying 0 ≤ di < i (since d1 is always zero it may be omitted) and to convert it to a permutation through a bijective correspondence. For the latter correspondence one could interpret the (reverse) sequence as a Lehmer code, and this gives a generation method first published in 1938 by Ronald A. Fisher and Frank Yates. While at the time computer implementation was not an issue, this method suffers from the difficulty sketched above to convert from Lehmer code to permutation efficiently. This can be remedied by using a different bijective correspondence: after using di to select an element among i remaining elements of the sequence (for decreasing values of i), rather than removing the element and compacting the sequence by shifting down further elements one place, one swaps the element with the final remaining element. Thus the elements remaining for selection form a consecutive range at each point in time, even though they may not occur in the same order as they did in the original sequence. The mapping from sequence of integers to permutations is somewhat complicated, but it can be seen to produce each permutation in exactly one way, by an immediate induction. When the selected element happens to be the final remaining element, the swap operation can be omitted. This does not occur sufficiently often to warrant testing for the condition, but the final element must be included among the candidates of the selection, to guarantee that all permutations can be generated. The resulting algorithm for generating a random permutation of a[0], a[1], ..., a[n − 1] can be described as follows in pseudocode: for i from n downto 2 do di ← random element of { 0, ..., i − 1 } swap a[di] and a[i − 1] This can be combined with the initialization of the array a[i] = i as follows: for i from 0 to n−1 do di+1 ← random element of { 0, ..., i } a[i] ← a[di+1] a[di+1] ← i If di+1 = i, the first assignment will copy an uninitialized value, but the second will overwrite it with the correct value i. Generation in lexicographic order There are many ways to systematically generate all permutations of a given sequence. One classical algorithm, which is both simple and flexible, is based on finding the next permutation in lexicographic ordering, if it exists. It can handle repeated values, for which case it generates the distinct multiset permutations each once. Even for ordinary permutations it is significantly more efficient than generating values for the Lehmer code in lexicographic order (possibly using the factorial number system) and converting those to permutations. To use it, one starts by sorting the sequence in (weakly) increasing order (which gives its lexicographically minimal permutation), and then repeats advancing to the next permutation as long as one is found. The method goes back to Narayana Pandita in 14th century India, and has been frequently rediscovered ever since. The following algorithm generates the next permutation lexicographically after a given permutation. It changes the given permutation in-place. Find the largest index k such that a[k] < a[k + 1]. If no such index exists, the permutation is the last permutation. Find the largest index l greater than k such that a[k] < a[l]. Swap the value of a[k] with that of a[l]. Reverse the sequence from a[k + 1] up to and including the final element a[n]. For example, given the sequence [1, 2, 3, 4] which starts in a weakly increasing order, and given that the index is zero-based, the steps are as follows: Index k = 2, because 3 is placed at an index that satisfies condition of being the largest index that is still less than a[k + 1] which is 4. Index l = 3, because 4 is the only value in the sequence that is greater than 3 in order to satisfy the condition a[k] < a[l]. The values of a[2] and a[3] are swapped to form the new sequence [1,2,4,3]. The sequence after k-index a[2] to the final element is reversed. Because only one value lies after this index (the 3), the sequence remains unchanged in this instance. Thus the lexicographic successor of the initial state is permuted: [1,2,4,3]. Following this algorithm, the next lexicographic permutation will be [1,3,2,4], and the 24th permutation will be [4,3,2,1] at which point a[k] < a[k + 1] does not exist, indicating that this is the last permutation. Generation with minimal changes An alternative to the above algorithm, the Steinhaus–Johnson–Trotter algorithm, generates an ordering on all the permutations of a given sequence with the property that any two consecutive permutations in its output differ by swapping two adjacent values. This ordering on the permutations was known to 17th-century English bell ringers, among whom it was known as \"plain changes\". One advantage of this method is that the small amount of change from one permutation to the next allows the method to be implemented in constant time per permutation. The same can also easily generate the subset of even permutations, again in constant time per permutation, by skipping every other output permutation. An alternative to Steinhaus–Johnson–Trotter is Heap's algorithm, said by Robert Sedgewick in 1977 to be the fastest algorithm of generating permutations in applications. Meandric permutations Meandric systems give rise to meandric permutations, a special subset of alternate permutations. An alternate permutation of the set {1,2,...,2n} is a cyclic permutation (with no fixed points) such that the digits in the cyclic notation form alternate between odd and even integers. Meandric permutations are useful in the analysis of RNA secondary structure. Not all alternate permutations are meandric. A modification of Heap's algorithm has been used to generate all alternate permutations of order n (that is, of length 2n) without generating all (2n)! permutations. Generation of these alternate permutations is needed before they are analyzed to determine if they are meandric or not. The algorithm is recursive. The following table exhibits a step in the procedure. In the previous step, all alternate permutations of length 5 have been generated. Three copies of each of these have a \"6\" added to the right end, and then a different transposition involving this last entry and a previous entry in an even position is applied (including the identity, i.e., no transposition). Software implementations Calculator functions Many scientific calculators and computing software have a built-in function for calculating the number of k-permutations of n. Casio and TI calculators: nPr HP calculators: PERM Mathematica: FactorialPower Spreadsheet functions Most spreadsheet software also provides a built-in function for calculating the number of k-permutations of n, called PERMUT in many popular spreadsheets. Applications Permutations are used in the interleaver component of the error detection and correction algorithms, such as turbo codes, for example 3GPP Long Term Evolution mobile telecommunication standard uses these ideas (see 3GPP technical specification 36.212 ). Such applications raise the question of fast generation of permutations satisfying certain desirable properties. One of the methods is based on the permutation polynomials. Also as a base for optimal hashing in Unique Permutation Hashing. See also Notes References Bogart, Kenneth P. (1990), Introductory Combinatorics (2nd ed.), Harcourt Brace Jovanovich, ISBN 0-15-541576-X Bóna, Miklós (2004), Combinatorics of Permutations, Chapman Hall-CRC, ISBN 1-58488-434-7 Brualdi, Richard A. (2010), Introductory Combinatorics (5th ed.), Prentice-Hall, ISBN 978-0-13-602040-0 Cameron, Peter J. (1994), Combinatorics: Topics, Techniques, Algorithms, Cambridge University Press, ISBN 0-521-45761-0 Carmichael, Robert D. (1956) [1937], Introduction to the theory of Groups of Finite Order, Dover, ISBN 0-486-60300-8 Gerstein, Larry J. (1987), Discrete Mathematics and Algebraic Structures, W.H. Freeman and Co., ISBN 0-7167-1804-9 Donald Knuth. The Art of Computer Programming, Volume 4: Generating All Tuples and Permutations, Fascicle 2, first printing. Addison–Wesley, 2005. ISBN 0-201-85393-0. Donald Knuth. The Art of Computer Programming, Volume 3: Sorting and Searching, Second Edition. Addison–Wesley, 1998. ISBN 0-201-89685-0. Section 5.1: Combinatorial Properties of Permutations, pp. 11–72. Hall, Jr., Marshall (1959), The Theory of Groups, MacMillan Humphreys, J. F. (1996), A course in group theory, Oxford University Press, ISBN 978-0-19-853459-4 Rotman, Joseph J. (2002), Advanced Modern Algebra, Prentice-Hall, ISBN 0-13-087868-5 Stedman, Fabian (1677), Campanalogia, London The publisher is given as \"W.S.\" who may have been William Smith, possibly acting as agent for the Society of College Youths, to which society the \"Dedicatory\" is addressed. In quotations the original long \"S\" has been replaced by a modern short \"s\". External links Hazewinkel, Michiel, ed. (2001), \"Permutation\", Encyclopedia of Mathematics, Springer, ISBN 978-1-55608-010-4","top_words":[{"w":"permutations","c":130},{"w":"permutation","c":115},{"w":"cycle","c":50},{"w":"elements","c":48},{"w":"element","c":47},{"w":"sequence","c":40},{"w":"notation","c":35},{"w":"written","c":19},{"w":"ordered","c":18},{"w":"cycles","c":18},{"w":"row","c":13},{"w":"inversion","c":13},{"w":"lehmer","c":13},{"w":"code","c":13},{"w":"symmetric","c":12},{"w":"representation","c":12},{"w":"finite","c":11},{"w":"ways","c":11},{"w":"numbers","c":11},{"w":"arrangement","c":11},{"w":"transpositions","c":11},{"w":"inversions","c":11},{"w":"isbn","c":11},{"w":"combinatorics","c":10},{"w":"arrangements","c":10},{"w":"increasing","c":10},{"w":"ordering","c":10},{"w":"positions","c":10},{"w":"generate","c":10},{"w":"generation","c":10},{"w":"random","c":10},{"w":"algorithm","c":10},{"w":"natural","c":9},{"w":"entries","c":9},{"w":"identity","c":9},{"w":"canonical","c":9},{"w":"distinct","c":8},{"w":"objects","c":8},{"w":"factorial","c":8},{"w":"point","c":8},{"w":"multiset","c":8},{"w":"circular","c":8},{"w":"theory","c":7},{"w":"three","c":7},{"w":"applications","c":7},{"w":"successive","c":7},{"w":"transposition","c":7},{"w":"inverse","c":7},{"w":"descents","c":7},{"w":"adjacent","c":7},{"w":"lexicographic","c":7},{"w":"alternate","c":7},{"w":"mathematics","c":6},{"w":"letters","c":6},{"w":"exactly","c":6},{"w":"multiplication","c":6},{"w":"repetition","c":6},{"w":"larger","c":6},{"w":"fixed","c":6},{"w":"matrix","c":6},{"w":"descent","c":6},{"w":"convert","c":6},{"w":"generating","c":6},{"w":"meandric","c":6},{"w":"word","c":5},{"w":"sets","c":5},{"w":"computer","c":5},{"w":"integers","c":5},{"w":"bijection","c":5},{"w":"bells","c":5},{"w":"instance","c":5},{"w":"sequences","c":5},{"w":"denoted","c":5},{"w":"disjoint","c":5},{"w":"minimal","c":5},{"w":"action","c":5},{"w":"position","c":5},{"w":"ascents","c":5},{"w":"ascent","c":5},{"w":"ascending","c":5},{"w":"empty","c":5},{"w":"largest","c":5},{"w":"correspondence","c":5},{"w":"starts","c":5},{"w":"computing","c":5},{"w":"tuples","c":4},{"w":"sorting","c":4},{"w":"algorithms","c":4},{"w":"equal","c":4},{"w":"requires","c":4},{"w":"definition","c":4},{"w":"equivalent","c":4},{"w":"lists","c":4},{"w":"omit","c":4},{"w":"parentheses","c":4},{"w":"smaller","c":4},{"w":"special","c":4},{"w":"subset","c":4},{"w":"appears","c":4},{"w":"maps","c":4},{"w":"subgroup","c":4},{"w":"cayley","c":4},{"w":"applying","c":4},{"w":"orbits","c":4},{"w":"note","c":4},{"w":"reverse","c":4},{"w":"expressions","c":4},{"w":"entry","c":4},{"w":"permuted","c":4},{"w":"runs","c":4},{"w":"excedances","c":4},{"w":"choice","c":4},{"w":"conversion","c":4},{"w":"hall","c":4},{"w":"rearranging","c":3},{"w":"permuting","c":3},{"w":"combinations","c":3},{"w":"image","c":3},{"w":"symbols","c":3},{"w":"elementary","c":3},{"w":"rule","c":3},{"w":"stedman","c":3},{"w":"cast","c":3},{"w":"argument","c":3},{"w":"modern","c":3},{"w":"problem","c":3},{"w":"bijections","c":3},{"w":"appear","c":3},{"w":"literature","c":3},{"w":"digits","c":3},{"w":"compact","c":3},{"w":"considering","c":3},{"w":"integer","c":3},{"w":"repeated","c":3},{"w":"sum","c":3},{"w":"exists","c":3},{"w":"start","c":3},{"w":"operation","c":3},{"w":"neutral","c":3},{"w":"theorem","c":3},{"w":"alternative","c":3},{"w":"previous","c":3},{"w":"implicitly","c":3},{"w":"mapping","c":3},{"w":"actions","c":3},{"w":"rightmost","c":3},{"w":"acting","c":3},{"w":"columns","c":3},{"w":"cyclic","c":3},{"w":"dot","c":3},{"w":"odd","c":3},{"w":"matrices","c":3},{"w":"corresponds","c":3},{"w":"totally","c":3},{"w":"needed","c":3},{"w":"subsequence","c":3},{"w":"calls","c":3},{"w":"richard","c":3},{"w":"foata","c":3},{"w":"question","c":3},{"w":"bit","c":3},{"w":"pair","c":3},{"w":"reversed","c":3},{"w":"operations","c":3},{"w":"preceded","c":3},{"w":"converting","c":3},{"w":"selection","c":3},{"w":"swap","c":3},{"w":"generates","c":3},{"w":"calculators","c":3},{"w":"notion","c":2},{"w":"members","c":2},{"w":"anagram","c":2},{"w":"orderings","c":2},{"w":"reasons","c":2},{"w":"algebra","c":2},{"w":"rearrangement","c":2},{"w":"replaced","c":2},{"w":"substitutions","c":2},{"w":"partial","c":2},{"w":"indian","c":2},{"w":"variations","c":2},{"w":"specific","c":2},{"w":"figures","c":2},{"w":"fabian","c":2},{"w":"repeats","c":2},{"w":"casting","c":2},{"w":"effectively","c":2},{"w":"recursive","c":2},{"w":"continues","c":2},{"w":"lesser","c":2},{"w":"compleat","c":2},{"w":"consider","c":2},{"w":"alphabet","c":2},{"w":"joseph","c":2},{"w":"polynomial","c":2},{"w":"equations","c":2},{"w":"galois","c":2},{"w":"passive","c":2},{"w":"older","c":2},{"w":"terminology","c":2},{"w":"depends","c":2},{"w":"regard","c":2},{"w":"define","c":2},{"w":"thought","c":2},{"w":"composed","c":2},{"w":"satisfies","c":2},{"w":"linearly","c":2},{"w":"assumption","c":2},{"w":"write","c":2},{"w":"concept","c":2},{"w":"generalizations","c":2},{"w":"meaning","c":2},{"w":"negative","c":2},{"w":"power","c":2},{"w":"contexts","c":2},{"w":"longer","c":2},{"w":"multiplicity","c":2},{"w":"coefficient","c":2},{"w":"manner","c":2},{"w":"equivalence","c":2},{"w":"relation","c":2},{"w":"bring","c":2},{"w":"assume","c":2},{"w":"isomorphic","c":2},{"w":"decomposition","c":2},{"w":"orbit","c":2},{"w":"expression","c":2},{"w":"writing","c":2},{"w":"appearing","c":2},{"w":"denotes","c":2},{"w":"interpreted","c":2},{"w":"unique","c":2},{"w":"points","c":2},{"w":"partition","c":2},{"w":"signless","c":2},{"w":"stirling","c":2},{"w":"kind","c":2},{"w":"finding","c":2},{"w":"authors","c":2},{"w":"leftmost","c":2},{"w":"multiplying","c":2},{"w":"modified","c":2},{"w":"associative","c":2},{"w":"express","c":2},{"w":"inverses","c":2},{"w":"expressed","c":2},{"w":"exist","c":2},{"w":"parity","c":2},{"w":"easily","c":2},{"w":"represent","c":2},{"w":"column","c":2},{"w":"frequently","c":2},{"w":"contiguous","c":2},{"w":"eulerian","c":2},{"w":"excedance","c":2},{"w":"combinatorial","c":2},{"w":"mikl","c":2},{"w":"choices","c":2},{"w":"sorted","c":2},{"w":"stanley","c":2},{"w":"decreasing","c":2},{"w":"transition","c":2},{"w":"lemma","c":2},{"w":"fundamental","c":2},{"w":"subsequent","c":2},{"w":"smallest","c":2},{"w":"maximum","c":2},{"w":"maxima","c":2},{"w":"opposite","c":2},{"w":"difference","c":2},{"w":"transform","c":2},{"w":"sort","c":2},{"w":"simply","c":2},{"w":"expansion","c":2},{"w":"arbitrary","c":2},{"w":"radix","c":2},{"w":"represents","c":2},{"w":"counts","c":2},{"w":"rothe","c":2},{"w":"cross","c":2},{"w":"crosses","c":2},{"w":"slots","c":2},{"w":"zeroes","c":2},{"w":"randomly","c":2},{"w":"obvious","c":2},{"w":"efficiently","c":2},{"w":"array","c":2},{"w":"systematic","c":2},{"w":"reason","c":2},{"w":"satisfying","c":2},{"w":"bijective","c":2},{"w":"consecutive","c":2},{"w":"weakly","c":2},{"w":"lexicographically","c":2},{"w":"century","c":2},{"w":"greater","c":2},{"w":"steinhaus","c":2},{"w":"johnson","c":2},{"w":"trotter","c":2},{"w":"output","c":2},{"w":"constant","c":2},{"w":"heap","c":2},{"w":"robert","c":2},{"w":"built","c":2},{"w":"calculating","c":2},{"w":"spreadsheet","c":2},{"w":"gpp","c":2},{"w":"hashing","c":2},{"w":"introductory","c":2},{"w":"prentice","c":2},{"w":"press","c":2},{"w":"donald","c":2},{"w":"knuth","c":2},{"w":"programming","c":2},{"w":"addison","c":2},{"w":"wesley","c":2},{"w":"selections","c":1},{"w":"disregarded","c":1},{"w":"topic","c":1},{"w":"prominent","c":1},{"w":"ignore","c":1},{"w":"configurations","c":1},{"w":"positive","c":1},{"w":"collection","c":1},{"w":"rearrangements","c":1},{"w":"succession","c":1},{"w":"structured","c":1},{"w":"replacements","c":1},{"w":"history","c":1},{"w":"culture","c":1},{"w":"lilavati","c":1},{"w":"mathematician","c":1},{"w":"bhaskara","c":1},{"w":"passage","c":1},{"w":"translates","c":1},{"w":"arithmetical","c":1},{"w":"series","c":1},{"w":"unity","c":1},{"w":"continued","c":1},{"w":"places","c":1},{"w":"factorials","c":1},{"w":"explaining","c":1},{"w":"ringing","c":1},{"w":"admitted","c":1},{"w":"varied","c":1},{"w":"explains","c":1},{"w":"explanation","c":1},{"w":"moves","c":1},{"w":"tabulates","c":1},{"w":"remarks","c":1},{"w":"comprehends","c":1},{"w":"insomuch","c":1},{"w":"peal","c":1},{"w":"seemeth","c":1},{"w":"uniting","c":1},{"w":"peals","c":1},{"w":"entire","c":1},{"w":"widens","c":1},{"w":"consideration","c":1},{"w":"horses","c":1},{"w":"seemingly","c":1},{"w":"unrelated","c":1},{"w":"mathematical","c":1},{"w":"help","c":1},{"w":"occurred","c":1},{"w":"louis","c":1},{"w":"lagrange","c":1},{"w":"roots","c":1},{"w":"equation","c":1},{"w":"possibilities","c":1},{"w":"solve","c":1},{"w":"ultimately","c":1},{"w":"variste","c":1},{"w":"description","c":1},{"w":"impossible","c":1},{"w":"respect","c":1},{"w":"solving","c":1},{"w":"unknown","c":1},{"w":"radicals","c":1},{"w":"situations","c":1},{"w":"understanding","c":1},{"w":"studying","c":1},{"w":"preferable","c":1},{"w":"asked","c":1},{"w":"discipline","c":1},{"w":"infinite","c":1},{"w":"viewpoint","c":1},{"w":"internal","c":1},{"w":"labels","c":1},{"w":"moved","c":1},{"w":"cauchy","c":1},{"w":"listing","c":1},{"w":"care","c":1},{"w":"distinguish","c":1},{"w":"assumed","c":1},{"w":"commas","c":1},{"w":"separate","c":1},{"w":"admits","c":1},{"w":"weaker","c":1}],"meta":{"abstract":"In mathematics, the notion of permutation relates to the act of rearranging, or permuting, all the members of a set into some sequence or order (unlike combinations, which are selections of some members of the set where order is disregarded). For example, written as tuples, there are six permutations of the set {1,2,3}, namely: (1,2,3), (1,3,2), (2,1,3), (2,3,1), (3,1,2), and (3,2,1). As another example, an anagram of a word, all of whose letters are different, is a permutation of its letters. The study of permutations of finite sets is a topic in the field of combinatorics. Permutations occur, in more or less prominent ways, in almost every area of mathematics. They often arise when different orderings on certain finite sets are considered, possibly only because one wants to ignore such orderings and needs to know how many configurations are thus identified. For similar reasons permutations arise in the study of sorting algorithms in computer science. The number of permutations of n distinct objects is n factorial usually written as n!, which means the product of all positive integers less than or equal to n. In algebra and particularly in group theory, a permutation of a set S is defined as a bijection from S to itself. That is, it is a function from S to S for which every element occurs exactly once as an image value. This is related to the rearrangement of the elements of S in which each element s is replaced by the corresponding f(s). The collection of such permutations form a group called the symmetric group of S. The key to this group's structure is the fact that the composition of two permutations (performing two given rearrangements in succession) results in another rearrangement. Permutations may act on structured objects by rearranging their components, or by certain replacements (substitutions) of symbols. In elementary combinatorics, the k-permutations, or partial permutations, are the ordered arrangements of k distinct elements selected from a set. When k is equal to the size of the set, these are the permutations of the set. History The rule to determine the number of permutations of n objects was known in Indian culture at least as early as around 1150: the Lilavati by the Indian mathematician Bhaskara II contains a passage that translates to The product of multiplication of the arithmetical series beginning and increasing by unity and continued to the number of places, will be the variations of number with specific figures. Fabian Stedman in 1677 described factorials when explaining the number of permutations of bells in change ringing. Starting from two bells: \"first, two must be admitted to be varied in two ways\" which he illustrates by showing 1 2 and 2 1. He then explains that with three bells there are \"three times two figures to be produced out of three\" which again is illustrated. His explanation involves \"cast away 3, and 1.2 will remain; cast away 2, and 1.3 will remain; cast away 1, and 2.3 will remain\". He then","date":"2015-04-08T04:43:56Z","url":"http://en.wikipedia.org/wiki/Permutation"}}}
,{"_index":"test","_type":"document","_id":"55f3e5ac00576034f979fe4e","_score":0,"_source":{"_id":"55f3e5ac00576034f979fe4e","corpus":"Reference","external_id":"Gauss–Newton_algorithm","source_type":"wikipedia","title":"Gauss–Newton Algorithm","words":"The Gauss–Newton algorithm is a method used to solve non-linear least squares problems. It is a modification of Newton's method for finding a minimum of a function. Unlike Newton's method, the Gauss–Newton algorithm can only be used to minimize a sum of squared function values, but it has the advantage that second derivatives, which can be challenging to compute, are not required. Non-linear least squares problems arise for instance in non-linear regression, where parameters in a model are sought such that the model is in good agreement with available observations. The method is named after the mathematicians Carl Friedrich Gauss and Isaac Newton. Description Given m functions r = (r1, …, rm) of n variables β = (β1, …, βn), with m ≥ n, the Gauss–Newton algorithm iteratively finds the minimum of the sum of squares Starting with an initial guess for the minimum, the method proceeds by the iterations where, if r and β are column vectors, the entries of the Jacobian matrix are and the symbol denotes the matrix transpose. If m = n, the iteration simplifies to which is a direct generalization of Newton's method in one dimension. In data fitting, where the goal is to find the parameters β such that a given model function y = f(x, β) best fits some data points (xi, yi), the functions ri are the residuals Then, the Gauss-Newton method can be expressed in terms of the Jacobian Jf of the function f as Notes The assumption m ≥ n in the algorithm statement is necessary, as otherwise the matrix JrTJr is not invertible and the normal equations cannot be solved (at least uniquely). The Gauss–Newton algorithm can be derived by linearly approximating the vector of functions ri. Using Taylor's theorem, we can write at every iteration: with The task of finding Δ minimizing the sum of squares of the right-hand side, i.e., , is a linear least squares problem, which can be solved explicitly, yielding the normal equations in the algorithm. The normal equations are m linear simultaneous equations in the unknown increments, Δ. They may be solved in one step, using Cholesky decomposition, or, better, the QR factorization of Jr. For large systems, an iterative method, such as the conjugate gradient method, may be more efficient. If there is a linear dependence between columns of Jr, the iterations will fail as JrTJr becomes singular. Example In this example, the Gauss–Newton algorithm will be used to fit a model to some data by minimizing the sum of squares of errors between the data and model's predictions. In a biology experiment studying the relation between substrate concentration [S] and reaction rate in an enzyme-mediated reaction, the data in the following table were obtained. It is desired to find a curve (model function) of the form that fits best the data in the least squares sense, with the parameters and to be determined. Denote by and the value of and the rate from the table, Let and We will find and such that the sum of squares of the residuals () is minimized. The Jacobian of the vector of residuals in respect to the unknowns is an matrix with the -th row having the entries Starting with the initial estimates of =0.9 and =0.2, after five iterations of the Gauss–Newton algorithm the optimal values and are obtained. The sum of squares of residuals decreased from the initial value of 1.445 to 0.00784 after the fifth iteration. The plot in the figure on the right shows the curve determined by the model for the optimal parameters versus the observed data. Convergence properties It can be shown that the increment Δ is a descent direction for S, and, if the algorithm converges, then the limit is a stationary point of S. However, convergence is not guaranteed, not even local convergence as in Newton's method. The rate of convergence of the Gauss–Newton algorithm can approach quadratic. The algorithm may converge slowly or not at all if the initial guess is far from the minimum or the matrix is ill-conditioned. For example, consider the problem with equations and variable, given by The optimum is at . (Actually the optimum is at for , because , but .) If then the problem is in fact linear and the method finds the optimum in one iteration. If |λ| < 1 then the method converges linearly and the error decreases asymptotically with a factor |λ| at every iteration. However, if |λ| > 1, then the method does not even converge locally. Derivation from Newton's method In what follows, the Gauss–Newton algorithm will be derived from Newton's method for function optimization via an approximation. As a consequence, the rate of convergence of the Gauss–Newton algorithm can be quadratic under certain regularity conditions. In general (under weaker conditions), the convergence rate is linear. The recurrence relation for Newton's method for minimizing a function S of parameters, , is where g denotes the gradient vector of S and H denotes the Hessian matrix of S. Since , the gradient is given by Elements of the Hessian are calculated by differentiating the gradient elements, , with respect to The Gauss–Newton method is obtained by ignoring the second-order derivative terms (the second term in this expression). That is, the Hessian is approximated by where are entries of the Jacobian Jr. The gradient and the approximate Hessian can be written in matrix notation as These expressions are substituted into the recurrence relation above to obtain the operational equations Convergence of the Gauss–Newton method is not guaranteed in all instances. The approximation that needs to hold to be able to ignore the second-order derivative terms may be valid in two cases, for which convergence is to be expected. The function values are small in magnitude, at least around the minimum. The functions are only \"mildly\" non linear, so that is relatively small in magnitude. Improved versions With the Gauss–Newton method the sum of squares S may not decrease at every iteration. However, since Δ is a descent direction, unless is a stationary point, it holds that for all sufficiently small . Thus, if divergence occurs, one solution is to employ a fraction, , of the increment vector, Δ in the updating formula . In other words, the increment vector is too long, but it points in \"downhill\", so going just a part of the way will decrease the objective function S. An optimal value for can be found by using a line search algorithm, that is, the magnitude of is determined by finding the value that minimizes S, usually using a direct search method in the interval . In cases where the direction of the shift vector is such that the optimal fraction, , is close to zero, an alternative method for handling divergence is the use of the Levenberg–Marquardt algorithm, also known as the \"trust region method\". The normal equations are modified in such a way that the increment vector is rotated towards the direction of steepest descent, , where D is a positive diagonal matrix. Note that when D is the identity matrix and , then , therefore the direction of Δ approaches the direction of the negative gradient . The so-called Marquardt parameter, , may also be optimized by a line search, but this is inefficient as the shift vector must be re-calculated every time is changed. A more efficient strategy is this. When divergence occurs increase the Marquardt parameter until there is a decrease in S. Then, retain the value from one iteration to the next, but decrease it if possible until a cut-off value is reached when the Marquardt parameter can be set to zero; the minimization of S then becomes a standard Gauss–Newton minimization. Other applications The Gauss–Newton algorithm is a popular method for solving nonlinear inverse problems. A particular application is generating computational models of oil and gas reservoirs for consistency with observed production data. Related algorithms In a quasi-Newton method, such as that due to Davidon, Fletcher and Powell or Broyden–Fletcher–Goldfarb–Shanno (BFGS method) an estimate of the full Hessian, , is built up numerically using first derivatives only so that after n refinement cycles the method closely approximates to Newton's method in performance. Note that quasi-Newton methods can minimize general real-valued functions, whereas Gauss-Newton, Levenberg-Marquardt, etc. fits only to nonlinear least-squares problems. Another method for solving minimization problems using only first derivatives is gradient descent. However, this method does not take into account the second derivatives even approximately. Consequently, it is highly inefficient for many functions, especially if the parameters have strong interactions. Notes ^ a b Björck (1996) ^ Björck (1996) p260 ^ Björck (1996) p341, 342 ^ Fletcher (1987) p.113 ^ http://www.henley.ac.uk/web/FILES/maths/09-04.pdf ^ Nocedal (1997) ^ History matching production data and uncertainty assessment with an efficient TSVD parameterization algorithm, Journal of Petroleum Science and Engineering, http://www.sciencedirect.com/science/article/pii/S0920410513003227 References Björck, A. (1996). Numerical methods for least squares problems. SIAM, Philadelphia. ISBN 0-89871-360-9. Fletcher, Roger (1987). Practical methods of optimization (2nd ed.). New York: John Wiley & Sons. ISBN 978-0-471-91547-8. . Nocedal, Jorge; Wright, Stephen (1999). Numerical optimization. New York: Springer. ISBN 0-387-98793-2.","top_words":[{"w":"newton","c":27},{"w":"gauss","c":17},{"w":"algorithm","c":17},{"w":"squares","c":12},{"w":"linear","c":9},{"w":"matrix","c":9},{"w":"vector","c":8},{"w":"convergence","c":8},{"w":"sum","c":7},{"w":"iteration","c":7},{"w":"equations","c":7},{"w":"gradient","c":7},{"w":"problems","c":6},{"w":"direction","c":6},{"w":"minimum","c":5},{"w":"hessian","c":5},{"w":"marquardt","c":5},{"w":"jacobian","c":4},{"w":"residuals","c":4},{"w":"optimal","c":4},{"w":"increment","c":4},{"w":"descent","c":4},{"w":"decrease","c":4},{"w":"fletcher","c":4},{"w":"rck","c":4},{"w":"finding","c":3},{"w":"iterations","c":3},{"w":"entries","c":3},{"w":"denotes","c":3},{"w":"fits","c":3},{"w":"solved","c":3},{"w":"minimizing","c":3},{"w":"problem","c":3},{"w":"efficient","c":3},{"w":"relation","c":3},{"w":"optimum","c":3},{"w":"optimization","c":3},{"w":"magnitude","c":3},{"w":"divergence","c":3},{"w":"search","c":3},{"w":"parameter","c":3},{"w":"minimization","c":3},{"w":"isbn","c":3},{"w":"minimize","c":2},{"w":"finds","c":2},{"w":"guess","c":2},{"w":"best","c":2},{"w":"points","c":2},{"w":"notes","c":2},{"w":"jrtjr","c":2},{"w":"linearly","c":2},{"w":"curve","c":2},{"w":"respect","c":2},{"w":"converges","c":2},{"w":"stationary","c":2},{"w":"point","c":2},{"w":"guaranteed","c":2},{"w":"quadratic","c":2},{"w":"converge","c":2},{"w":"approximation","c":2},{"w":"recurrence","c":2},{"w":"elements","c":2},{"w":"fraction","c":2},{"w":"shift","c":2},{"w":"levenberg","c":2},{"w":"note","c":2},{"w":"inefficient","c":2},{"w":"solving","c":2},{"w":"nonlinear","c":2},{"w":"quasi","c":2},{"w":"nocedal","c":2},{"w":"numerical","c":2},{"w":"york","c":2},{"w":"solve","c":1},{"w":"modification","c":1},{"w":"squared","c":1},{"w":"advantage","c":1},{"w":"challenging","c":1},{"w":"compute","c":1},{"w":"instance","c":1},{"w":"regression","c":1},{"w":"sought","c":1},{"w":"agreement","c":1},{"w":"observations","c":1},{"w":"named","c":1},{"w":"mathematicians","c":1},{"w":"carl","c":1},{"w":"friedrich","c":1},{"w":"isaac","c":1},{"w":"description","c":1},{"w":"variables","c":1},{"w":"iteratively","c":1},{"w":"proceeds","c":1},{"w":"column","c":1},{"w":"vectors","c":1},{"w":"symbol","c":1},{"w":"transpose","c":1},{"w":"simplifies","c":1},{"w":"generalization","c":1},{"w":"dimension","c":1},{"w":"fitting","c":1},{"w":"goal","c":1},{"w":"expressed","c":1},{"w":"assumption","c":1},{"w":"statement","c":1},{"w":"invertible","c":1},{"w":"uniquely","c":1},{"w":"approximating","c":1},{"w":"taylor","c":1},{"w":"theorem","c":1},{"w":"write","c":1},{"w":"task","c":1},{"w":"hand","c":1},{"w":"explicitly","c":1},{"w":"yielding","c":1},{"w":"simultaneous","c":1},{"w":"unknown","c":1},{"w":"increments","c":1},{"w":"cholesky","c":1},{"w":"decomposition","c":1},{"w":"better","c":1},{"w":"factorization","c":1},{"w":"large","c":1},{"w":"iterative","c":1},{"w":"conjugate","c":1},{"w":"dependence","c":1},{"w":"columns","c":1},{"w":"fail","c":1},{"w":"singular","c":1},{"w":"fit","c":1},{"w":"errors","c":1},{"w":"predictions","c":1},{"w":"biology","c":1},{"w":"experiment","c":1},{"w":"studying","c":1},{"w":"substrate","c":1},{"w":"enzyme","c":1},{"w":"sense","c":1},{"w":"denote","c":1},{"w":"minimized","c":1},{"w":"unknowns","c":1},{"w":"row","c":1},{"w":"estimates","c":1},{"w":"plot","c":1},{"w":"versus","c":1},{"w":"limit","c":1},{"w":"slowly","c":1},{"w":"ill","c":1},{"w":"conditioned","c":1},{"w":"consider","c":1},{"w":"variable","c":1},{"w":"error","c":1},{"w":"decreases","c":1},{"w":"asymptotically","c":1},{"w":"locally","c":1},{"w":"derivation","c":1},{"w":"consequence","c":1},{"w":"regularity","c":1},{"w":"weaker","c":1},{"w":"differentiating","c":1},{"w":"ignoring","c":1},{"w":"expression","c":1},{"w":"approximated","c":1},{"w":"approximate","c":1},{"w":"written","c":1},{"w":"notation","c":1},{"w":"expressions","c":1},{"w":"substituted","c":1},{"w":"operational","c":1},{"w":"instances","c":1},{"w":"hold","c":1},{"w":"ignore","c":1},{"w":"valid","c":1},{"w":"expected","c":1},{"w":"mildly","c":1},{"w":"improved","c":1},{"w":"versions","c":1},{"w":"holds","c":1},{"w":"employ","c":1},{"w":"updating","c":1},{"w":"downhill","c":1},{"w":"objective","c":1},{"w":"minimizes","c":1},{"w":"interval","c":1},{"w":"close","c":1},{"w":"alternative","c":1},{"w":"handling","c":1},{"w":"trust","c":1},{"w":"region","c":1},{"w":"modified","c":1},{"w":"rotated","c":1},{"w":"steepest","c":1},{"w":"positive","c":1},{"w":"diagonal","c":1},{"w":"identity","c":1},{"w":"negative","c":1},{"w":"optimized","c":1},{"w":"changed","c":1},{"w":"strategy","c":1},{"w":"retain","c":1},{"w":"cut","c":1},{"w":"reached","c":1},{"w":"applications","c":1},{"w":"popular","c":1},{"w":"inverse","c":1},{"w":"generating","c":1},{"w":"computational","c":1},{"w":"oil","c":1},{"w":"gas","c":1},{"w":"reservoirs","c":1},{"w":"consistency","c":1},{"w":"algorithms","c":1},{"w":"davidon","c":1},{"w":"powell","c":1},{"w":"broyden","c":1},{"w":"goldfarb","c":1},{"w":"shanno","c":1},{"w":"bfgs","c":1},{"w":"estimate","c":1},{"w":"built","c":1},{"w":"numerically","c":1},{"w":"refinement","c":1},{"w":"cycles","c":1},{"w":"closely","c":1},{"w":"approximates","c":1},{"w":"performance","c":1},{"w":"valued","c":1},{"w":"account","c":1},{"w":"consequently","c":1},{"w":"highly","c":1},{"w":"henley","c":1},{"w":"web","c":1},{"w":"files","c":1},{"w":"maths","c":1},{"w":"pdf","c":1},{"w":"history","c":1},{"w":"matching","c":1},{"w":"uncertainty","c":1},{"w":"assessment","c":1},{"w":"tsvd","c":1},{"w":"parameterization","c":1},{"w":"petroleum","c":1},{"w":"engineering","c":1},{"w":"sciencedirect","c":1},{"w":"pii","c":1},{"w":"references","c":1},{"w":"siam","c":1},{"w":"philadelphia","c":1},{"w":"roger","c":1},{"w":"practical","c":1},{"w":"wiley","c":1},{"w":"sons","c":1},{"w":"jorge","c":1},{"w":"wright","c":1},{"w":"stephen","c":1},{"w":"springer","c":1}],"meta":{"abstract":"The Gauss–Newton algorithm is a method used to solve non-linear least squares problems. It is a modification of Newton's method for finding a minimum of a function. Unlike Newton's method, the Gauss–Newton algorithm can only be used to minimize a sum of squared function values, but it has the advantage that second derivatives, which can be challenging to compute, are not required. Non-linear least squares problems arise for instance in non-linear regression, where parameters in a model are sought such that the model is in good agreement with available observations. The method is named after the mathematicians Carl Friedrich Gauss and Isaac Newton. Description Given m functions r = (r1, …, rm) of n variables β = (β1, …, βn), with m ≥ n, the Gauss–Newton algorithm iteratively finds the minimum of the sum of squares Starting with an initial guess for the minimum, the method proceeds by the iterations where, if r and β are column vectors, the entries of the Jacobian matrix are and the symbol denotes the matrix transpose. If m = n, the iteration simplifies to which is a direct generalization of Newton's method in one dimension. In data fitting, where the goal is to find the parameters β such that a given model function y = f(x, β) best fits some data points (xi, yi), the functions ri are the residuals Then, the Gauss-Newton method can be expressed in terms of the Jacobian Jf of the function f as Notes The assumption m ≥ n in the algorithm statement is necessary, as otherwise the matrix JrTJr is not invertible and the normal equations cannot be solved (at least uniquely). The Gauss–Newton algorithm can be derived by linearly approximating the vector of functions ri. Using Taylor's theorem, we can write at every iteration: with The task of finding Δ minimizing the sum of squares of the right-hand side, i.e., , is a linear least squares problem, which can be solved explicitly, yielding the normal equations in the algorithm. The normal equations are m linear simultaneous equations in the unknown increments, Δ. They may be solved in one step, using Cholesky decomposition, or, better, the QR factorization of Jr. For large systems, an iterative method, such as the conjugate gradient method, may be more efficient. If there is a linear dependence between columns of Jr, the iterations will fail as JrTJr becomes singular. Example In this example, the Gauss–Newton algorithm will be used to fit a model to some data by minimizing the sum of squares of errors between the data and model's predictions. In a biology experiment studying the relation between substrate concentration [S] and reaction rate in an enzyme-mediated reaction, the data in the following table were obtained. It is desired to find a curve (model function) of the form that fits best the data in the least squares sense, with the parameters and to be determined. Denote by and the value of and the rate from the table, Let and We will find and","date":"2015-03-24T08:16:37Z","url":"http://en.wikipedia.org/wiki/Gauss%E2%80%93Newton%20algorithm"}}}
,{"_index":"test","_type":"document","_id":"55f3e5ac00576034f979fe53","_score":0,"_source":{"_id":"55f3e5ac00576034f979fe53","corpus":"Reference","external_id":"Postorder_traversal","source_type":"wikipedia","title":"Postorder Traversal","words":"","top_words":[],"meta":{"date":"2004-08-11T19:36:40Z","url":"http://en.wikipedia.org/wiki/Postorder%20traversal"}}}
,{"_index":"test","_type":"document","_id":"55f3e5ac00576034f979fe4d","_score":0,"_source":{"_id":"55f3e5ac00576034f979fe4d","corpus":"Reference","external_id":"Hat_puzzle","source_type":"wikipedia","title":"Hat Puzzle","words":"Hat puzzles are logic problems that date back to as early as 1961. A number of players, at least three, are each wearing a hat, which may be of various specified colours. Players can see the colours of at least some other players' hats, but not that of their own. With highly restricted communication or none, some of the players must guess the colour of their hat. The problem is to find a strategy for the players to determine the colours of their hats based on the hats they see and what the other players do. In some versions, they compete to be the first to guess correctly; in others, they can work out a strategy beforehand to cooperate and maximise the probability of correct guesses. One variation received some new publicity as a result of Todd Ebert's 1998 Ph.D. thesis at the University of California, Santa Barbara. It is a strategy question about a cooperative game, which has connections to algebraic coding theory. A competitive version Three players are told that each of them will receive either a red hat or a blue hat. They are to raise their hands if they see a red hat on another player. The first to guess the colour of his or her hat correctly wins. All three players raise their hands. After the players have seen each other for a few minutes without guessing, one player announces \"Red\", and wins. How did the winner do it? If player 1 sees a blue hat on player 2, then player 1 knows his own hat must be red: if both 2 and 1 had blue hats, 3's hand would not have been raised. Thus any player who sees a blue hat can guess at once. The winner realizes that since no one guesses, there must be no blue hats, so every hat must be red. A cooperative version In the case where every player has to make a guess, but they are free to choose when to guess, there is a cooperative strategy that allows every player to guess correctly unless all the hats are the same colour. Each player should act as follows: Count the numbers b of black hats and w of white hats that you see. Wait b seconds or w seconds, whichever is sooner. If nobody has yet spoken, guess that your hat is black if you can see fewer black hats than white hats, or white if you can see fewer white hats than black hats. If you have not yet spoken, guess that your hat is of the opposite colour to that of one of the first people to speak. Suppose that in total there are B black hats and W white hats. There are three cases. If B = W then those players wearing black hats see B−1 black hats and B white hats, so wait B−1 seconds then correctly guess that they are wearing a black hat. Similarly, those players wearing a white hat will wait W−1 seconds before guessing correctly that they are wearing a white hat. So all players make a correct guess at the same time. If B < W then those wearing a black hat will see B−1 black hats and W white hats, whilst those wearing a white hat will see B black hats and W−1 white hats. Since B−1 < B ≤ W−1, those players wearing a black hat will be the first to speak, guessing correctly that their hat is black. The other players then guess correctly that their hat is white. The case where W < B is similar. Ebert's version and Hamming codes Ebert's version of the problem states that all players who guess must guess at the same predetermined time, but that not all players are required to guess. Now not all players can guess correctly, so the players win if at least one player guesses and all of those who guess do so correctly. How can the players maximise their chance of winning? One strategy for solving this version of the hat problem employs Hamming codes, which are commonly used to detect and correct errors in data transmission. The probability for winning will be much higher than 50%, depending on the number of players in the puzzle configuration: for example, a winning probability of 87.5% for 7 players. Similar strategies can be applied to team sizes of N = 2k−1 and achieve a win rate (2k-1)/2k. Thus the Hamming code strategy yields greater win rates for larger values of N. In this version of the problem, any individual guess has a 50% chance of being right. However, the Hamming code approach works by concentrating wrong guesses together onto certain distributions of hats. For some cases, all the players will guess incorrectly; whereas for the other cases, only one player will guess, but correctly. While half of all guesses are still incorrect, this results in the players winning more than 50% of the time. A simple example of this type of solution with three players is instructive. With three players, there are eight possibilities; in two of them all players have the same colour hat, and in the other six, two players have one colour and the other player has the other colour. The players can guarantee that they win in the latter cases (75% of the time) with the following strategy: Any player who observes two hats of two different colours remains silent. Any player who observes two hats of the same colour guesses the opposite colour. In the two cases when all three players have the same hat colour, they will all guess incorrectly. But in the other six cases, only one player will guess, and correctly, that his hat is the opposite of his fellow players'. References Further reading See also Induction puzzles Prisoners and hats puzzle","top_words":[{"w":"players","c":30},{"w":"hat","c":25},{"w":"hats","c":25},{"w":"guess","c":22},{"w":"player","c":15},{"w":"white","c":12},{"w":"correctly","c":11},{"w":"colour","c":10},{"w":"wearing","c":8},{"w":"three","c":7},{"w":"strategy","c":7},{"w":"guesses","c":6},{"w":"version","c":6},{"w":"red","c":5},{"w":"blue","c":5},{"w":"colours","c":4},{"w":"problem","c":4},{"w":"seconds","c":4},{"w":"hamming","c":4},{"w":"win","c":4},{"w":"winning","c":4},{"w":"probability","c":3},{"w":"correct","c":3},{"w":"ebert","c":3},{"w":"cooperative","c":3},{"w":"guessing","c":3},{"w":"wait","c":3},{"w":"opposite","c":3},{"w":"puzzles","c":2},{"w":"maximise","c":2},{"w":"raise","c":2},{"w":"hands","c":2},{"w":"wins","c":2},{"w":"winner","c":2},{"w":"sees","c":2},{"w":"spoken","c":2},{"w":"fewer","c":2},{"w":"codes","c":2},{"w":"chance","c":2},{"w":"puzzle","c":2},{"w":"code","c":2},{"w":"incorrectly","c":2},{"w":"observes","c":2},{"w":"logic","c":1},{"w":"problems","c":1},{"w":"highly","c":1},{"w":"restricted","c":1},{"w":"communication","c":1},{"w":"versions","c":1},{"w":"compete","c":1},{"w":"cooperate","c":1},{"w":"variation","c":1},{"w":"publicity","c":1},{"w":"todd","c":1},{"w":"thesis","c":1},{"w":"santa","c":1},{"w":"barbara","c":1},{"w":"question","c":1},{"w":"game","c":1},{"w":"connections","c":1},{"w":"algebraic","c":1},{"w":"coding","c":1},{"w":"theory","c":1},{"w":"competitive","c":1},{"w":"told","c":1},{"w":"receive","c":1},{"w":"minutes","c":1},{"w":"announces","c":1},{"w":"hand","c":1},{"w":"raised","c":1},{"w":"realizes","c":1},{"w":"choose","c":1},{"w":"count","c":1},{"w":"numbers","c":1},{"w":"whichever","c":1},{"w":"sooner","c":1},{"w":"suppose","c":1},{"w":"whilst","c":1},{"w":"predetermined","c":1},{"w":"solving","c":1},{"w":"employs","c":1},{"w":"commonly","c":1},{"w":"detect","c":1},{"w":"errors","c":1},{"w":"transmission","c":1},{"w":"higher","c":1},{"w":"configuration","c":1},{"w":"strategies","c":1},{"w":"sizes","c":1},{"w":"achieve","c":1},{"w":"yields","c":1},{"w":"greater","c":1},{"w":"rates","c":1},{"w":"larger","c":1},{"w":"works","c":1},{"w":"concentrating","c":1},{"w":"wrong","c":1},{"w":"distributions","c":1},{"w":"half","c":1},{"w":"incorrect","c":1},{"w":"instructive","c":1},{"w":"possibilities","c":1},{"w":"guarantee","c":1},{"w":"silent","c":1},{"w":"references","c":1},{"w":"reading","c":1},{"w":"induction","c":1},{"w":"prisoners","c":1}],"meta":{"abstract":"Hat puzzles are logic problems that date back to as early as 1961. A number of players, at least three, are each wearing a hat, which may be of various specified colours. Players can see the colours of at least some other players' hats, but not that of their own. With highly restricted communication or none, some of the players must guess the colour of their hat. The problem is to find a strategy for the players to determine the colours of their hats based on the hats they see and what the other players do. In some versions, they compete to be the first to guess correctly; in others, they can work out a strategy beforehand to cooperate and maximise the probability of correct guesses. One variation received some new publicity as a result of Todd Ebert's 1998 Ph.D. thesis at the University of California, Santa Barbara. It is a strategy question about a cooperative game, which has connections to algebraic coding theory. A competitive version Three players are told that each of them will receive either a red hat or a blue hat. They are to raise their hands if they see a red hat on another player. The first to guess the colour of his or her hat correctly wins. All three players raise their hands. After the players have seen each other for a few minutes without guessing, one player announces \"Red\", and wins. How did the winner do it? If player 1 sees a blue hat on player 2, then player 1 knows his own hat must be red: if both 2 and 1 had blue hats, 3's hand would not have been raised. Thus any player who sees a blue hat can guess at once. The winner realizes that since no one guesses, there must be no blue hats, so every hat must be red. A cooperative version In the case where every player has to make a guess, but they are free to choose when to guess, there is a cooperative strategy that allows every player to guess correctly unless all the hats are the same colour. Each player should act as follows: Count the numbers b of black hats and w of white hats that you see. Wait b seconds or w seconds, whichever is sooner. If nobody has yet spoken, guess that your hat is black if you can see fewer black hats than white hats, or white if you can see fewer white hats than black hats. If you have not yet spoken, guess that your hat is of the opposite colour to that of one of the first people to speak. Suppose that in total there are B black hats and W white hats. There are three cases. If B = W then those players wearing black hats see B−1 black hats and B white hats, so wait B−1 seconds then correctly guess that they are wearing a black hat. Similarly, those players wearing a white hat will wait","date":"2015-04-18T13:28:07Z","url":"http://en.wikipedia.org/wiki/Hat%20puzzle"}}}
,{"_index":"test","_type":"document","_id":"55f3e5ac00576034f979fe52","_score":0,"_source":{"_id":"55f3e5ac00576034f979fe52","corpus":"Reference","external_id":"Adiabatic_process","source_type":"wikipedia","title":"Adiabatic Process","words":"An adiabatic process is one that occurs without transfer of heat or matter between a system and its surroundings. The adiabatic process provides a rigorous conceptual basis for the theory used to expound the first law of thermodynamics, and as such it is a key concept in thermodynamics. Some chemical and physical processes occur so rapidly that they may be conveniently described by the \"adiabatic approximation\", meaning that there is not enough time for the transfer of energy as heat to take place to or from the system. In way of example, the adiabatic flame temperature is an idealization that uses the \"adiabatic approximation\" so as to provide an upper limit calculation of temperatures produced by combustion of a fuel. The adiabatic flame temperature is the temperature that would be achieved by a flame if the process of combustion took place in the absence of heat loss to the surroundings. Description A process that does not involve the transfer of heat into or out of a system, so that Q = 0, is called an adiabatic process, and such a system is said to be adiabatically isolated (perfectly insulated). The assumption that a process is adiabatic is a frequently made simplifying assumption. For example, the compression of a gas within a cylinder of an engine is assumed to occur so rapidly that on the time scale of the compression process, little of the system's energy can be transferred out as heat. Even though the cylinders are not insulated and are quite conductive, that process is idealized to be adiabatic. The assumption of adiabatic isolation of a system is a useful one, and is often combined with others so as to make the calculation of the system's behaviour possible. Such assumptions are idealizations. The behaviour of actual machines deviates from these idealizations, but the assumption of such \"perfect\" behaviour provide a useful first approximation of how the real world works. Various applications of the adiabatic assumption If the system has rigid walls such that work cannot be transferred in or out (W = 0), and the walls of the system are not adiabatic and energy is added in the form of heat (Q > 0), the temperature of the system will rise. If the system has rigid walls such that work cannot be added (W = 0), and the system boundaries are adiabatic (Q = 0), but energy is added as work in the form of friction or the stirring of a viscous fluid within the system, the temperature of the system will rise. If the system walls are adiabatic (Q = 0), but not rigid (W ≠ 0), and energy is added to the system in the form of frictionless, non-viscous work, the temperature of the system will rise. The energy added is stored within the system, and is completely recoverable as work. Such a process of the frictionless, non-viscous application of work to a system is called an isentropic process. If the system contains a compressible gas and is reduced in volume, the uncertainty of the position of the gas is reduced as it is compressed to a smaller volume, and seemingly reduces the entropy of the system, but the temperature of the system will rise as the process is isentropic (ΔS = 0). Should the work be added in such a way that friction or viscous forces are operating within the system, the process is not isentropic, the temperature of the system will rise, and the work added to the system is not entirely recoverable in the form of work. If the walls of a system are not adiabatic, and energy is transferred in as heat, entropy is transferred into the system with the heat. Such a process is neither adiabatic nor isentropic, having Q > 0, and ΔS > 0 according to the second law of thermodynamics. Naturally occurring adiabatic processes are irreversible (entropy is produced). The transfer of energy as work into an adiabatic (insulated) system can be imagined as being of two idealized extreme kinds. One kind of work is where there is no entropy produced within the system (no friction, viscous dissipation, etc), and the work is only pressure-volume work (denoted by P dV). In nature, this ideal kind occurs only approximately, because it demands an infinitely slow process and no sources of dissipation. The other extreme kind of work is isochoric work (dV = 0), for which energy is added as work solely through friction or viscous dissipation within the system. A stirrer that transfers energy to a viscous fluid of an adiabatically isolated system with rigid walls will cause a rise in temperature of the fluid, but that work is not recoverable. Isochoric work is irreversible. The second law of thermodynamics observes that a natural process of transfer of energy as work, always consists at least of isochoric work and often both of these extreme kinds of work. Every natural process, adiabatic or not, is irreversible, with ΔS > 0, as friction or viscosity are always present to some extent. Adiabatic heating and cooling The adiabatic compression of a gas causes a rise in temperature of the gas. Adiabatic expansion against pressure, or a spring, causes a drop in temperature. In contrast, free expansion is an isothermal process for an ideal gas. Adiabatic heating occurs when the pressure of a gas is increased from work done on it by its surroundings, e.g., a piston compressing a gas contained within an adiabatic cylinder. This finds practical application in Diesel engines which rely on the lack of quick heat dissipation during their compression stroke to elevate the fuel vapor temperature sufficiently to ignite it. Adiabatic heating occurs in the Earth's atmosphere when an air mass descends, for example, in a katabatic wind, Foehn wind, or chinook wind flowing downhill over a mountain range. When a parcel of air descends, the pressure on the parcel increases. Due to this increase in pressure, the parcel's volume decreases and its temperature increases as work is done on the parcel of air, thus increasing the internal energy. The parcel of air is unable to dissipate energy as heat, hence it is considered adiabatically isolated, and its temperature will rise sensibly. Adiabatic cooling occurs when the pressure on an adiabatically isolated system is decreased, allowing it to expand, thus causing it to do work on its surroundings. When the pressure applied on a parcel of air is reduced, the air in the parcel is allowed to expand; as the volume increases, the temperature falls as internal energy decreases. Adiabatic cooling occurs in the Earth's atmosphere with orographic lifting and lee waves, and this can form pileus or lenticular clouds. Adiabatic cooling does not have to involve a fluid. One technique used to reach very low temperatures (thousandths and even millionths of a degree above absolute zero) is adiabatic demagnetisation, where the change in magnetic field on a magnetic material is used to provide adiabatic cooling. Also, the contents of an expanding universe can be described (to first order) as an adiabatically cooling fluid. (See - Heat death of the universe) Rising magma also undergoes adiabatic cooling before eruption, particularly significant in the case of magmas that rise quickly from great depths such as kimberlites. Such temperature changes can be quantified using the ideal gas law, or the hydrostatic equation for atmospheric processes. In practice, no process is truly adiabatic. Many processes rely on a large difference in time scales of the process of interest and the rate of heat dissipation across a system boundary, and thus are approximated by using an adiabatic assumption. There is always some heat loss, as no perfect insulators exist. Ideal gas (reversible process) The mathematical equation for an ideal gas undergoing a reversible (i.e., no entropy generation) adiabatic process is where P is pressure, V is volume, and being the specific heat for constant pressure, being the specific heat for constant volume, is the adiabatic index, and is the number of degrees of freedom (3 for monatomic gas, 5 for diatomic gas and collinear molecules e.g. carbon dioxide). For a monatomic ideal gas, , and for a diatomic gas (such as nitrogen and oxygen, the main components of air) . Note that the above formula is only applicable to classical ideal gases and not Bose–Einstein or Fermi gases. For reversible adiabatic processes, it is also true that where T is an absolute temperature. This can also be written as Example of adiabatic compression Let's now look at a common example of adiabatic compression- the compression stroke in a gasoline engine. We will make a few simplifying assumptions: that the uncompressed volume of the cylinder is 1000 cm3 (one litre), that the gas within is nearly pure nitrogen (thus a diatomic gas with five degrees of freedom and so = 7/5), and that the compression ratio of the engine is 10:1 (that is, the 1000 cm3 volume of uncompressed gas will compress down to 100 cm3 when the piston goes from bottom to top). The uncompressed gas is at approximately room temperature and pressure (a warm room temperature of ~27 ºC or 300 K, and a pressure of 1 bar ~ 100 kPa, or about 14.7 PSI, i.e. typical sea-level atmospheric pressure). so our adiabatic constant for this experiment is about 1.58 billion. The gas is now compressed to a 100 cm3 volume (we will assume this happens quickly enough that no heat can enter or leave the gas). The new volume is 100 cm3, but the constant for this experiment is still 1.58 billion: so solving for P: or about 362 PSI or 24.5 atm. Note that this pressure increase is more than a simple 10:1 compression ratio would indicate; this is because the gas is not only compressed, but the work done to compress the gas has also heated the gas and the hotter gas will have a greater pressure even if the volume had not changed. We can solve for the temperature of the compressed gas in the engine cylinder as well, using the ideal gas law. Our initial conditions are 100,000 pa of pressure, 1000 cm3 volume, and 300 K of temperature, so our experimental constant is: We know the compressed gas has V = 100 cm3 and P = 2.50E6 pascals, so we can solve for temperature by simple algebra: That is a final temperature of 751 K, or 477 °C, or 892 °F, well above the ignition point of many fuels. This is why a high compression engine requires fuels specially formulated to not self-ignite (which would cause engine knocking when operated under these conditions of temperature and pressure), or that a supercharger and intercooler to provide a lower temperature at the same pressure would be advantageous. A diesel engine operates under even more extreme conditions, with compression ratios of 20:1 or more being typical, in order to provide a very high gas temperature which ensures immediate ignition of injected fuel. Adiabatic free expansion of a gas For an adiabatic free expansion of an ideal gas, the gas is contained in an insulated container and then allowed to expand in a vacuum. Because there is no external pressure for the gas to expand against, the work done by or on the system is zero. Since this process does not involve any heat transfer or work, the First Law of Thermodynamics then implies that the net internal energy change of the system is zero. For an ideal gas, the temperature remains constant because the internal energy only depends on temperature in that case. Since at constant temperature, the entropy is proportional to the volume, the entropy increases in this case, therefore this process is irreversible. Derivation of P-V relation for adiabatic heating and cooling The definition of an adiabatic process is that heat transfer to the system is zero, . Then, according to the first law of thermodynamics, where dU is the change in the internal energy of the system and δW is work done by the system. Any work (δW) done must be done at the expense of internal energy U, since no heat δQ is being supplied from the surroundings. Pressure-volume work δW done by the system is defined as However, P does not remain constant during an adiabatic process but instead changes along with V. It is desired to know how the values of dP and dV relate to each other as the adiabatic process proceeds. For an ideal gas the internal energy is given by where is the number of degrees of freedom divided by two, R is the universal gas constant and n is the number of moles in the system (a constant). Differentiating Equation (3) and use of the ideal gas law, , yields Equation (4) is often expressed as because . Now substitute equations (2) and (4) into equation (1) to obtain factorize :: and divide both sides by PV: After integrating the left and right sides from to V and from to P and changing the sides respectively, Exponentiate both sides, and substitute with , the heat capacity ratio and eliminate the negative sign to obtain Therefore, and Derivation of T-V relation for adiabatic heating and cooling Substituting the ideal gas law into the above, we obtain which simplifies to Derivation of discrete formula The change in internal energy of a system, measured from state 1 to state 2, is equal to At the same time, the work done by the pressure-volume changes as a result from this process, is equal to Since we require the process to be adiabatic, the following equation needs to be true By the previous derivation, Rearranging (4) gives Substituting this into (2) gives Integrating, Substituting , Rearranging, Using the ideal gas law and assuming a constant molar quantity (as often happens in practical cases), By the continuous formula, Or, Substituting into the previous expression for , Substituting this expression and (1) in (3) gives Simplifying, Simplifying, Simplifying, Graphing adiabats An adiabat is a curve of constant entropy on the P-V diagram. Some properties of adiabats on a P-V diagram are indicated. These properties may be read from the classical behaviour of ideal gases, except in the region where PV becomes small (low temperature), where quantum effects become important. Every adiabat asymptotically approaches both the V axis and the P axis (just like isotherms). Each adiabat intersects each isotherm exactly once. An adiabat looks similar to an isotherm, except that during an expansion, an adiabat loses more pressure than an isotherm, so it has a steeper inclination (more vertical). If isotherms are concave towards the \"north-east\" direction (45 °), then adiabats are concave towards the \"east north-east\" (31 °). If adiabats and isotherms are graphed at regular intervals of entropy and temperature, respectively (like altitude on a contour map), then as the eye moves towards the axes (towards the south-west), it sees the density of isotherms stay constant, but it sees the density of adiabats grow. The exception is very near absolute zero, where the density of adiabats drops sharply and they become rare (see Nernst's theorem). The following diagram is a P-V diagram with a superposition of adiabats and isotherms: The isotherms are the red curves and the adiabats are the black curves. The adiabats are isentropic. Volume is the horizontal axis and pressure is the vertical axis. Etymology The term adiabatic/ˌædiəˈbætɪk/, literally means 'not to be passed through'. It is formed from the ancient Greek privative \"α\" (\"not\") + διαβατός, \"able to be passed through\", in turn deriving from διὰ- (\"through\"), and βαῖνειν (\"to walk, go, come\"), thus ἀδιάβατος . According to Maxwell, and to Partington, the term was introduced by Rankine. The etymological origin corresponds here to an impossibility of transfer of energy as heat and of transfer of matter across the wall. Divergent usages of the word adiabatic This present article is written from the viewpoint of macroscopic thermodynamics, and the word adiabatic is used in this article in the traditional way of thermodynamics, introduced by Rankine. It is pointed out in the present article that, for example, if a compression of a gas is rapid, then there is little time for heat transfer to occur, even when the gas is not adiabatically isolated. In this sense, a rapid compression of a gas is sometimes approximately or loosely said to be adiabatic (though often far from isentropic) even when the gas is not adiabatically isolated. Quantum mechanics and quantum statistical mechanics, however, use the word adiabatic in very a different sense, one that can at times seem almost opposite to the classical thermodynamic sense. In quantum theory, the word adiabatic can mean something perhaps near isentropic, or perhaps near quasi-static, but the usage of the word is very different between the two disciplines. On one hand in quantum theory, if a perturbative element of compressive work is done almost infinitely slowly (that is to say quasi-statically), it is said to have been done adiabatically. The idea is that the shapes of the eigenfunctions change slowly and continuously, so that no quantum jump is triggered, and the change is virtually reversible. While the occupation numbers are unchanged, nevertheless there is change in the energy levels of one-to-one corresponding, pre-and post-compression, eigenstates. Thus a perturbative element of work has been done without heat transfer and without introduction of random change within the system. For example, Max Born writes \"Actually, it is usually the 'adiabatic' case with which we have to do: i.e. the limiting case where the external force (or the reaction of the parts of the system on each other) acts very slowly. In this case, to a very high approximation that is, there is no probability for a transition, and the system is in the initial state after cessation of the perturbation. Such a slow perturbation is therefore reversible, as it is classically.\" On the other hand in quantum theory, if a perturbative element of compressive work is done rapidly, it randomly changes the occupation numbers of the eigenstates, as well as changing their shapes. In that theory, such a rapid change is said not to be 'adiabatic', and the contrary word 'diabatic' is even applied to it. One might guess that perhaps Clausius, if he were confronted with this, in the now-obsolete language he used in his day, would have said that \"internal work\" was done and that 'heat was generated though not transferred'. In classical thermodynamics, such a rapid change would still be called adiabatic because the system is adiabatically isolated, and there is no transfer of energy as heat. The strong irreversibility of the change, due to viscosity or other entropy production, does not impinge on this classical usage. Thus for a mass of gas, in macroscopic thermodynamics, words are so used that a compression is sometimes loosely or approximately said to be adiabatic if it is rapid enough to avoid heat transfer, even if the system is not adiabatically isolated. But in quantum statistical theory, a compression is not called adiabatic if it is rapid, even if the system is adiabatically isolated in the classical thermodynamic sense of the term. The words are used differently in the two disciplines, as stated just above. See also Cyclic process First law of thermodynamics Heat burst Isobaric process Isenthalpic process Isentropic process Isochoric process Isothermal process Polytropic process Entropy (classical thermodynamics) Quasistatic process Total air temperature Magnetic refrigeration References Silbey, Robert J. et al. (2004). Physical chemistry. Hoboken: Wiley. p. 55. ISBN 978-0-471-21504-2. Broholm, Collin. \"Adiabatic free expansion.\" Physics & Astronomy @ Johns Hopkins University. N.p., 26 Nov. 1997. Web. 14 Apr. *Nave, Carl Rod. \"Adiabatic Processes.\" HyperPhysics. N.p., n.d. Web. 14 Apr. 2011. [1]. Thorngren, Dr. Jane R.. \"Adiabatic Processes.\" Daphne – A Palomar College Web Server. N.p., 21 July 1995. Web. 14 Apr. 2011. [2]. External links Article in HyperPhysics Encyclopaedia","top_words":[{"w":"adiabatic","c":61},{"w":"gas","c":44},{"w":"heat","c":27},{"w":"energy","c":23},{"w":"pressure","c":22},{"w":"compression","c":16},{"w":"ideal","c":15},{"w":"transfer","c":13},{"w":"constant","c":13},{"w":"thermodynamics","c":12},{"w":"law","c":11},{"w":"adiabatically","c":11},{"w":"entropy","c":11},{"w":"isolated","c":9},{"w":"rise","c":9},{"w":"cooling","c":9},{"w":"internal","c":9},{"w":"adiabats","c":9},{"w":"isentropic","c":8},{"w":"air","c":8},{"w":"quantum","c":8},{"w":"engine","c":7},{"w":"viscous","c":7},{"w":"parcel","c":7},{"w":"classical","c":7},{"w":"theory","c":6},{"w":"assumption","c":6},{"w":"walls","c":6},{"w":"expansion","c":6},{"w":"equation","c":6},{"w":"isotherms","c":6},{"w":"word","c":6},{"w":"rapid","c":6},{"w":"surroundings","c":5},{"w":"simplifying","c":5},{"w":"transferred","c":5},{"w":"friction","c":5},{"w":"fluid","c":5},{"w":"compressed","c":5},{"w":"dissipation","c":5},{"w":"heating","c":5},{"w":"reversible","c":5},{"w":"substituting","c":5},{"w":"adiabat","c":5},{"w":"approximation","c":4},{"w":"insulated","c":4},{"w":"cylinder","c":4},{"w":"behaviour","c":4},{"w":"rigid","c":4},{"w":"irreversible","c":4},{"w":"extreme","c":4},{"w":"isochoric","c":4},{"w":"increases","c":4},{"w":"expand","c":4},{"w":"derivation","c":4},{"w":"sides","c":4},{"w":"diagram","c":4},{"w":"axis","c":4},{"w":"sense","c":4},{"w":"web","c":4},{"w":"rapidly","c":3},{"w":"flame","c":3},{"w":"fuel","c":3},{"w":"involve","c":3},{"w":"recoverable","c":3},{"w":"reduced","c":3},{"w":"kind","c":3},{"w":"wind","c":3},{"w":"absolute","c":3},{"w":"magnetic","c":3},{"w":"degrees","c":3},{"w":"freedom","c":3},{"w":"diatomic","c":3},{"w":"gases","c":3},{"w":"uncompressed","c":3},{"w":"isotherm","c":3},{"w":"east","c":3},{"w":"density","c":3},{"w":"perturbative","c":3},{"w":"element","c":3},{"w":"slowly","c":3},{"w":"apr","c":3},{"w":"matter","c":2},{"w":"physical","c":2},{"w":"calculation","c":2},{"w":"temperatures","c":2},{"w":"combustion","c":2},{"w":"loss","c":2},{"w":"idealized","c":2},{"w":"assumptions","c":2},{"w":"idealizations","c":2},{"w":"perfect","c":2},{"w":"frictionless","c":2},{"w":"kinds","c":2},{"w":"infinitely","c":2},{"w":"slow","c":2},{"w":"natural","c":2},{"w":"viscosity","c":2},{"w":"isothermal","c":2},{"w":"piston","c":2},{"w":"contained","c":2},{"w":"practical","c":2},{"w":"diesel","c":2},{"w":"rely","c":2},{"w":"stroke","c":2},{"w":"ignite","c":2},{"w":"earth","c":2},{"w":"atmosphere","c":2},{"w":"descends","c":2},{"w":"decreases","c":2},{"w":"universe","c":2},{"w":"atmospheric","c":2},{"w":"specific","c":2},{"w":"monatomic","c":2},{"w":"nitrogen","c":2},{"w":"note","c":2},{"w":"true","c":2},{"w":"written","c":2},{"w":"compress","c":2},{"w":"psi","c":2},{"w":"experiment","c":2},{"w":"billion","c":2},{"w":"solve","c":2},{"w":"ignition","c":2},{"w":"fuels","c":2},{"w":"relation","c":2},{"w":"substitute","c":2},{"w":"integrating","c":2},{"w":"changing","c":2},{"w":"equal","c":2},{"w":"previous","c":2},{"w":"rearranging","c":2},{"w":"expression","c":2},{"w":"vertical","c":2},{"w":"concave","c":2},{"w":"north","c":2},{"w":"sees","c":2},{"w":"curves","c":2},{"w":"passed","c":2},{"w":"rankine","c":2},{"w":"macroscopic","c":2},{"w":"loosely","c":2},{"w":"mechanics","c":2},{"w":"statistical","c":2},{"w":"thermodynamic","c":2},{"w":"quasi","c":2},{"w":"disciplines","c":2},{"w":"hand","c":2},{"w":"compressive","c":2},{"w":"shapes","c":2},{"w":"occupation","c":2},{"w":"numbers","c":2},{"w":"eigenstates","c":2},{"w":"perturbation","c":2},{"w":"hyperphysics","c":2},{"w":"rigorous","c":1},{"w":"conceptual","c":1},{"w":"basis","c":1},{"w":"expound","c":1},{"w":"concept","c":1},{"w":"conveniently","c":1},{"w":"meaning","c":1},{"w":"idealization","c":1},{"w":"upper","c":1},{"w":"limit","c":1},{"w":"absence","c":1},{"w":"description","c":1},{"w":"perfectly","c":1},{"w":"frequently","c":1},{"w":"assumed","c":1},{"w":"scale","c":1},{"w":"cylinders","c":1},{"w":"conductive","c":1},{"w":"isolation","c":1},{"w":"combined","c":1},{"w":"actual","c":1},{"w":"machines","c":1},{"w":"deviates","c":1},{"w":"works","c":1},{"w":"applications","c":1},{"w":"boundaries","c":1},{"w":"stirring","c":1},{"w":"stored","c":1},{"w":"completely","c":1},{"w":"compressible","c":1},{"w":"uncertainty","c":1},{"w":"position","c":1},{"w":"smaller","c":1},{"w":"seemingly","c":1},{"w":"reduces","c":1},{"w":"forces","c":1},{"w":"operating","c":1},{"w":"entirely","c":1},{"w":"naturally","c":1},{"w":"imagined","c":1},{"w":"denoted","c":1},{"w":"demands","c":1},{"w":"sources","c":1},{"w":"solely","c":1},{"w":"stirrer","c":1},{"w":"transfers","c":1},{"w":"observes","c":1},{"w":"consists","c":1},{"w":"extent","c":1},{"w":"spring","c":1},{"w":"drop","c":1},{"w":"contrast","c":1},{"w":"compressing","c":1},{"w":"finds","c":1},{"w":"engines","c":1},{"w":"lack","c":1},{"w":"quick","c":1},{"w":"elevate","c":1},{"w":"vapor","c":1},{"w":"katabatic","c":1},{"w":"foehn","c":1},{"w":"chinook","c":1},{"w":"flowing","c":1},{"w":"downhill","c":1},{"w":"mountain","c":1},{"w":"increasing","c":1},{"w":"unable","c":1},{"w":"dissipate","c":1},{"w":"sensibly","c":1},{"w":"allowing","c":1},{"w":"causing","c":1},{"w":"falls","c":1},{"w":"orographic","c":1},{"w":"lifting","c":1},{"w":"waves","c":1},{"w":"pileus","c":1},{"w":"lenticular","c":1},{"w":"clouds","c":1},{"w":"technique","c":1},{"w":"reach","c":1},{"w":"thousandths","c":1},{"w":"millionths","c":1},{"w":"demagnetisation","c":1},{"w":"contents","c":1},{"w":"expanding","c":1},{"w":"death","c":1},{"w":"rising","c":1},{"w":"magma","c":1},{"w":"undergoes","c":1},{"w":"eruption","c":1},{"w":"magmas","c":1},{"w":"depths","c":1},{"w":"kimberlites","c":1},{"w":"quantified","c":1},{"w":"hydrostatic","c":1},{"w":"practice","c":1},{"w":"large","c":1},{"w":"difference","c":1},{"w":"scales","c":1},{"w":"boundary","c":1},{"w":"approximated","c":1},{"w":"insulators","c":1},{"w":"exist","c":1},{"w":"mathematical","c":1},{"w":"undergoing","c":1},{"w":"generation","c":1},{"w":"collinear","c":1},{"w":"carbon","c":1},{"w":"dioxide","c":1},{"w":"oxygen","c":1},{"w":"applicable","c":1},{"w":"bose","c":1},{"w":"einstein","c":1},{"w":"fermi","c":1},{"w":"gasoline","c":1},{"w":"litre","c":1},{"w":"pure","c":1},{"w":"bottom","c":1},{"w":"warm","c":1},{"w":"bar","c":1},{"w":"kpa","c":1},{"w":"sea","c":1},{"w":"assume","c":1},{"w":"leave","c":1},{"w":"solving","c":1},{"w":"atm","c":1},{"w":"heated","c":1},{"w":"hotter","c":1},{"w":"greater","c":1},{"w":"changed","c":1},{"w":"pascals","c":1},{"w":"algebra","c":1},{"w":"point","c":1},{"w":"requires","c":1},{"w":"specially","c":1},{"w":"formulated","c":1},{"w":"knocking","c":1},{"w":"operated","c":1},{"w":"supercharger","c":1},{"w":"intercooler","c":1},{"w":"lower","c":1},{"w":"advantageous","c":1},{"w":"operates","c":1},{"w":"ratios","c":1},{"w":"ensures","c":1},{"w":"injected","c":1},{"w":"container","c":1},{"w":"vacuum","c":1},{"w":"implies","c":1},{"w":"net","c":1},{"w":"depends","c":1},{"w":"proportional","c":1},{"w":"definition","c":1},{"w":"expense","c":1},{"w":"supplied","c":1},{"w":"proceeds","c":1},{"w":"divided","c":1},{"w":"universal","c":1},{"w":"moles","c":1},{"w":"differentiating","c":1},{"w":"yields","c":1},{"w":"expressed","c":1},{"w":"equations","c":1},{"w":"factorize","c":1},{"w":"divide","c":1},{"w":"exponentiate","c":1},{"w":"capacity","c":1},{"w":"eliminate","c":1},{"w":"negative","c":1},{"w":"sign","c":1},{"w":"simplifies","c":1},{"w":"discrete","c":1},{"w":"assuming","c":1},{"w":"molar","c":1},{"w":"quantity","c":1},{"w":"graphing","c":1},{"w":"curve","c":1},{"w":"read","c":1},{"w":"region","c":1},{"w":"asymptotically","c":1},{"w":"intersects","c":1},{"w":"exactly","c":1},{"w":"loses","c":1},{"w":"steeper","c":1},{"w":"inclination","c":1},{"w":"direction","c":1},{"w":"graphed","c":1},{"w":"intervals","c":1},{"w":"altitude","c":1},{"w":"contour","c":1},{"w":"map","c":1},{"w":"eye","c":1},{"w":"moves","c":1},{"w":"axes","c":1},{"w":"south","c":1},{"w":"west","c":1},{"w":"stay","c":1},{"w":"grow","c":1},{"w":"exception","c":1},{"w":"drops","c":1},{"w":"sharply","c":1},{"w":"rare","c":1},{"w":"nernst","c":1},{"w":"theorem","c":1},{"w":"superposition","c":1},{"w":"red","c":1},{"w":"horizontal","c":1},{"w":"etymology","c":1},{"w":"literally","c":1},{"w":"ancient","c":1},{"w":"greek","c":1},{"w":"privative","c":1},{"w":"turn","c":1},{"w":"deriving","c":1},{"w":"walk","c":1},{"w":"maxwell","c":1},{"w":"partington","c":1},{"w":"etymological","c":1},{"w":"origin","c":1},{"w":"corresponds","c":1},{"w":"impossibility","c":1},{"w":"wall","c":1},{"w":"divergent","c":1},{"w":"usages","c":1},{"w":"viewpoint","c":1},{"w":"traditional","c":1},{"w":"pointed","c":1},{"w":"opposite","c":1},{"w":"static","c":1},{"w":"statically","c":1},{"w":"idea","c":1},{"w":"eigenfunctions","c":1},{"w":"continuously","c":1},{"w":"jump","c":1},{"w":"triggered","c":1},{"w":"virtually","c":1},{"w":"unchanged","c":1},{"w":"introduction","c":1},{"w":"random","c":1},{"w":"max","c":1},{"w":"writes","c":1},{"w":"force","c":1},{"w":"parts","c":1},{"w":"acts","c":1},{"w":"probability","c":1}],"meta":{"abstract":"An adiabatic process is one that occurs without transfer of heat or matter between a system and its surroundings. The adiabatic process provides a rigorous conceptual basis for the theory used to expound the first law of thermodynamics, and as such it is a key concept in thermodynamics. Some chemical and physical processes occur so rapidly that they may be conveniently described by the \"adiabatic approximation\", meaning that there is not enough time for the transfer of energy as heat to take place to or from the system. In way of example, the adiabatic flame temperature is an idealization that uses the \"adiabatic approximation\" so as to provide an upper limit calculation of temperatures produced by combustion of a fuel. The adiabatic flame temperature is the temperature that would be achieved by a flame if the process of combustion took place in the absence of heat loss to the surroundings. Description A process that does not involve the transfer of heat into or out of a system, so that Q = 0, is called an adiabatic process, and such a system is said to be adiabatically isolated (perfectly insulated). The assumption that a process is adiabatic is a frequently made simplifying assumption. For example, the compression of a gas within a cylinder of an engine is assumed to occur so rapidly that on the time scale of the compression process, little of the system's energy can be transferred out as heat. Even though the cylinders are not insulated and are quite conductive, that process is idealized to be adiabatic. The assumption of adiabatic isolation of a system is a useful one, and is often combined with others so as to make the calculation of the system's behaviour possible. Such assumptions are idealizations. The behaviour of actual machines deviates from these idealizations, but the assumption of such \"perfect\" behaviour provide a useful first approximation of how the real world works. Various applications of the adiabatic assumption If the system has rigid walls such that work cannot be transferred in or out (W = 0), and the walls of the system are not adiabatic and energy is added in the form of heat (Q > 0), the temperature of the system will rise. If the system has rigid walls such that work cannot be added (W = 0), and the system boundaries are adiabatic (Q = 0), but energy is added as work in the form of friction or the stirring of a viscous fluid within the system, the temperature of the system will rise. If the system walls are adiabatic (Q = 0), but not rigid (W ≠ 0), and energy is added to the system in the form of frictionless, non-viscous work, the temperature of the system will rise. The energy added is stored within the system, and is completely recoverable as work. Such a process of the frictionless, non-viscous application of work to a system is called an isentropic process. If the system contains a compressible gas and is","date":"2015-04-08T17:13:29Z","url":"http://en.wikipedia.org/wiki/Adiabatic%20process"}}}
